{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Minetest:Education Edition",
  "home_page_url": "https://edu.ihom.app/en/",
  "feed_url": "https://edu.ihom.app/feed.json",
  "description": "An open source block-based sandbox app designed specifically for education and similar to Minecraft: Education!🚀 Inspire creativity and inclusive learning by exploring a virtual world of blocks and unlocking new ways to solve any subject or challenge!✨",
  "items": [
    {
      "title": "About",
      "url": "https://edu.ihom.app/en/about.html",
      "id": "https://edu.ihom.app/en/about.html",
      "content_html": "<h2 id=\"about-minetest-education\" tabindex=\"-1\"> About <strong>Minetest:Education</strong></h2>\n<p>This project started from my own child's education. In 2020, I came across &quot;<a href=\"https://education.minecraft.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Minecraft: Education Edition</a>&quot; and initially thought it was a good option, However, I soon found out that as an individual user, I could only use it a limited number of times. The full &quot;Minecraft: Education Edition&quot; is designed specifically for schools only(which often have larger budgets) and is currently used in more than 115 countries/regions worldwide. It is a monthly subscription service that requires Microsoft 365 educational accounts and Mojang accounts, so access is limited unless the school allows it, making it inaccessible for ordinary people. This clearly does not align with the principle of everyone having the right to education.</p>\n<p>During the trial period, I noticed that if a child played alone without any company, they would not follow the course content and instead play around aimlessly in the game world. They would prefer not to think and engage in mindless play, like digging holes, getting lost, climbing to high places, and jumping off, calling it &quot;bungee jumping.&quot; This kind of aimless play could go on endlessly.</p>\n<p>So, the idea of using &quot;Minecraft: Education Edition&quot; for learning didn't work out.</p>\n<p>Later, I discovered the open-source &quot;<a href=\"https://minetest.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest voxel game engine</a>,&quot; which was even more open and free. Having learned my lesson from &quot;Minecraft: Education Edition,&quot; I developed the <a href=\"/en/guide/mods/quiz/\">Quiz</a> player challenge mod first to implement periodic exercises during gameplay and to control the gameplay time. Even when playing foolishly, we still need to practice! Surprisingly, it worked well. Of course, my child still complained and demanded that I remove the practice exercises. So, I gave her a choice between practicing alone or practicing while playing the game, and she immediately chose the latter option without any hesitation.</p>\n<p>The learning effect is quite well. Words that are usually hard to remember become easier when learned through the game. My child can remember them naturally and doesn't need me to supervise her. In the game, I gave her math and English questions. At first, the math questions were fixed and unchanging. After a day or two, she remembered the answers and stopped calculating. So, I had to change the questions frequently and even added the &quot;four basic arithmetic operations&quot; question type, which randomly generates questions based on a set of rules.</p>\n<p>Afterward, to facilitate game content management, I directly modified the interface of Minetest by separating the student game interface (gameplay) from the teacher interface (manage game content). Then, I gave it a Chinese name &quot;莽兜&quot; which is a transliteration of Minetest. The game is filled with square blocks, and the name &quot;莽兜&quot; is a loose translation that fits well. After integrating several educational mods, &quot;Minetest: Education Edition&quot; was born.</p>\n<p>Nowadays, whenever I have free time, I teach my child programming in &quot;Minetest World.&quot; As long as she can complete the tasks I assign in the game, she can play recklessly and do whatever she wants afterward. To be honest, although she has learned some programming skills, she still struggles to apply them. Even though she understands that programming can be used to quickly create a room, she still prefers to build it block by block with her own hands. She also knows that doors can be automatically opened and closed using pressure plates (player detectors), but she still likes to open and close them manually. Nonetheless, learning and experimenting in the game is more engaging than real life, and she has to keep practicing if she wants to continue playing.</p>\n<p>Subsequently, our relatives and friends became interested in trying it out, and eventually, it evolved into an open-source project that we publicly released, hoping to help more people.</p>\n<p>However, I must emphasize that if you don't have the time and energy, it's not advisable to force your child to learn through this game. It's not realistic to expect young children to have enough self-control to use it effectively, at least not in my experience. If you do want to try it, parents must be willing to invest more time and effort into the project, designing the curriculum within the game world, preparing suitable questions for their child, and playing together with them.</p>\n<p>The source code repository for &quot;Minetest: Education Edition&quot; is located on GitHub at <a href=\"https://github.com/edu-minetest/minetest/\" target=\"_blank\" rel=\"noopener noreferrer\">https://github.com/edu-minetest/minetest/</a>. The main UI branch is edu/builtin, and a series of sub-functional branches prefixed with edu/ make up the rest of the project.</p>\n<h2 id=\"about-minetest-voxel-game-engine\" tabindex=\"-1\"> About <a href=\"https://minetest.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest Voxel Game Engine</a></h2>\n<p>Thanks to the <a href=\"https://minetest.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest voxel game engine</a><sup></sup>, there wouldn't be the &quot;Minetest: Education Edition&quot; without it.</p>\n<p>&quot;Minetest&quot; is a free and open-source sandbox game engine developed by a team of volunteers. It is written in C++ and can run on various systems such as Linux, FreeBSD, Microsoft Windows, macOS, and Android. Minetest provides developers with an application programming interface (API) using Lua, allowing them to create their own games and mods.</p>\n<p>Minetest has been used in educational environments to teach subjects such as mathematics, programming, and earth science. Compared to similar programs or packages, its advantages include zero cost and the ability to be deployed at scale in classrooms or research environments. Additionally, even though Minetest's graphics engine is not optimized for the latest hardware, it performs well on low-cost and low-end hardware<sup></sup>.</p>\n<p>Here are some specific examples of how Minetest has been used in education:</p>\n<ul>\n<li>Minetest has been used as an aid in design and for remote teaching<sup></sup>.</li>\n<li>Minetest has been used to teach logic and debugging skills to primary and secondary school students<sup></sup>.</li>\n<li>Minetest has been utilized for teaching <a href=\"https://en.wikipedia.org/wiki/Calculus\" target=\"_blank\" rel=\"noopener noreferrer\">calculus</a> and <a href=\"https://en.wikipedia.org/wiki/Trigonometry\" target=\"_blank\" rel=\"noopener noreferrer\">trigonometry</a><sup></sup>.</li>\n<li>In the Federal University of Santa Catarina in Brazil, MineScratch (a variant of Minetest) has been used for teaching purposes<sup></sup>.</li>\n<li>In Paris Descartes University, Minetest has been used to teach life and earth science to sixth-grade students who cannot observe certain phenomena in person but can experience them in the virtual world of Minetest<sup></sup>.</li>\n</ul>\n<h2 id=\"copyright-notice\" tabindex=\"-1\"> Copyright Notice</h2>\n<ul>\n<li><a href=\"https://minetest.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest</a>Follow the <a href=\"https://www.gnu.org/licenses/old-licenses/lgpl-2.1.html\" target=\"_blank\" rel=\"noopener noreferrer\">LGPL2.1</a> Copyright License.</li>\n<li>《<a href=\"https://edu.ihom.app/\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest:Education</a>》Follow the <a href=\"https://www.gnu.org/licenses/lgpl-3.0.html\" target=\"_blank\" rel=\"noopener noreferrer\">LGPL3</a>Copyright License.</li>\n</ul>\n<hr />\n<section>\n<ol>\n<li id=\"footnote1\"><p>Voxel is the abbreviation of Volume Pixel. Conceptually similar to the smallest unit of two-dimensional space—pixels, pixels are used in image data of two-dimensional computer graphics. As its name suggests, a volume pixel is the smallest unit of digital data in three-dimensional space segmentation, and it is used in three-dimensional imaging, scientific data, and medical imaging. <a href=\"https://en.wikipedia.org/wiki/Voxel\" target=\"_blank\" rel=\"noopener noreferrer\">Wikipedia</a> </p>\n</li>\n<li id=\"footnote2\"><p><a href=\"https://en.wikinews.org/wiki/Open_source_game_developer_Perttu_Ahola_talks_about_Minetest_with_Wikinews\" target=\"_blank\" rel=\"noopener noreferrer\">Open source game developer Perttu Ahola talks about Minetest with Wikinews</a>. Wikinews. 2020-06-30 [2020-07-11]. （<a href=\"https://web.archive.org/web/20200712073905/https://en.wikinews.org/wiki/Open_source_game_developer_Perttu_Ahola_talks_about_Minetest_with_Wikinews\" target=\"_blank\" rel=\"noopener noreferrer\">Original content archive</a>于2020-07-12）. </p>\n</li>\n<li id=\"footnote3\"><p>Walsh, Greg; Donahue, Craig; Rhodes, Emily E. <a href=\"https://mdsoar.org/bitstream/handle/11603/7723/KidCraft.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">KidCraft: Co-Designing within a Game Environment</a> (PDF). 2015 [2019-10-12]. （<a href=\"https://web.archive.org/web/20210203071241/https://mdsoar.org/bitstream/handle/11603/7723/KidCraft.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Original content archive</a> (PDF) 2021-02-03） . </p>\n</li>\n<li id=\"footnote4\"><p><a href=\"http://www.taccle3.eu/wp-content/uploads/2017/12/20161024-O4-Evaluation-of-existing-resources-for-introducing-to-coding.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Evaluation of existing resources (study/analysis)</a> (PDF). TACCLE 3 – Coding. 2016-10-24 [2019-02-16]. （<a href=\"https://web.archive.org/web/20180516205409/http://www.taccle3.eu/wp-content/uploads/2017/12/20161024-O4-Evaluation-of-existing-resources-for-introducing-to-coding.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Original content archive</a> (PDF) 2018-05-16）. </p>\n</li>\n<li id=\"footnote5\"><p>Boutet, Henri. <a href=\"http://revue.sesamath.net/spip.php?article940\" target=\"_blank\" rel=\"noopener noreferrer\">Mathématiques et &quot;serious gaming&quot;: l'exemple de Minetest [Mathematics and &quot;serious gaming&quot;: the example of Minetest]</a>. Mathématice. Num. 53. January 2017 [2019-10-12]. （<a href=\"https://web.archive.org/web/20190629075729/http://revue.sesamath.net/spip.php?article940\" target=\"_blank\" rel=\"noopener noreferrer\">Original content archive</a>于2019-06-29） （French）. </p>\n</li>\n<li id=\"footnote6\"><p>da, Rocha, Jhonata. <a href=\"http://150.162.242.35/handle/123456789/171545\" target=\"_blank\" rel=\"noopener noreferrer\">MineScratch: integração minetest-scratch para apoiar o ensino de programação [MineScratch: Minetest-Scratch Integration to Support Programming Teaching]</a>. Repositório Institucional da UFSC. 2016-11-23 [2019-02-16]. （<a href=\"https://web.archive.org/web/20210203071244/http://150.162.242.35/handle/123456789/171545\" target=\"_blank\" rel=\"noopener noreferrer\">Original content archive</a>于2021-02-03） （Brazilian Portuguese）. </p>\n</li>\n<li id=\"footnote7\"><p>Pauty-Combemorel C. <a href=\"https://hal.archives-ouvertes.fr/hal-01753090/document\" target=\"_blank\" rel=\"noopener noreferrer\">Utilisation d'un jeu vidéo dans le cadre de l'enseignement des SVT: le cas de Minetest. De 0 à 1 ou l'heure de l'informatique à l'école. [Using a video game as part of the teaching of Life and Earth Sciences: the case of Minetest. From 0 to 1 or computer time at school.]</a>. 2018-02-07 [2019-10-11]. （<a href=\"https://web.archive.org/web/20191011091553/https://hal.archives-ouvertes.fr/hal-01753090/document\" target=\"_blank\" rel=\"noopener noreferrer\">Original content archive</a> 2019-10-11） （French）. </p>\n</li>\n</ol>\n</section>\n",
      "date_published": "2023-06-29T14:40:54.000Z",
      "date_modified": "2023-07-02T08:01:24.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "🔗 Useful Links",
      "url": "https://edu.ihom.app/en/links/",
      "id": "https://edu.ihom.app/en/links/",
      "content_html": "<h2 id=\"fun-elearning-free-resources\" tabindex=\"-1\"> Fun eLearning Free Resources</h2>\n<h3 id=\"khan-academy\" tabindex=\"-1\"> <a href=\"https://zh.khanacademy.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Khan Academy</a></h3>\n<p>Khan Academy is a well-known institution (non-profit organization) with many years of experience in online education. Its educational content and course design have been professionally researched and reviewed. Committed to providing free, first-class education to everyone in the world.</p>\n<p><a href=\"https://khanacademy.org/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"@source/en/links/khanacademy.jpg\" alt=\"khanAcademy\" /></a></p>\n<p>Khan Academy's mission is to provide high-quality, free, personalized online educational resources to help everyone improve their knowledge and skills. Khan Academy's goal is to make education more accessible and equitable by using technology to break down barriers in education. The platform uses adaptive learning technology to provide users with a personalized learning experience based on their learning progress and abilities. Plus, Khan Academy's video lessons and practice questions are free, and everyone can access them anytime, anywhere.</p>\n<ul>\n<li>Adaptive Learning: Khan Academy uses adaptive learning technology to provide users with a personalized learning experience based on their learning progress and abilities. This allows students to learn at their own pace and adapt it to their needs and abilities.</li>\n<li>Rich curriculum resources: Khan Academy covers a wide range of subjects, including math, science, computer science, history, art, and more. The platform's video lessons and practice questions are free, and everyone can access them anytime, anywhere. In addition, Khan Academy provides some other educational resources such as tools and guides.</li>\n<li>Community support: Khan Academy has a large community that can help students with the problems they encounter. Users of the platform can interact with other students and volunteer tutors to share learning experiences and resources. In addition, Khan Academy also offers several educational programs such as salons and student challenges to encourage students to actively participate in learning.</li>\n</ul>\n<h3 id=\"phet-interactive-simulations-for-science-and-math\" tabindex=\"-1\"> <a href=\"https://phet.colorado.edu\" target=\"_blank\" rel=\"noopener noreferrer\">PhET Interactive simulations for science and math</a></h3>\n<p>PhET (Physics Education Technology) is an educational technology project created by teachers and researchers at the University of Colorado Boulder to provide students with free, interactive, and visualized lessons in physics, chemistry, mathematics, earth science, and biology, etc. Various subject simulators.</p>\n<p>PhET's simulators are based on scientific research and incorporate feedback and suggestions from teachers and students, and are highly interactive, visualized and personalized.</p>\n<p>Students can learn concepts in various disciplines through experimentation and exploration, and can adjust the parameters and difficulty level of the simulator according to their needs and abilities. The PhET simulator can be obtained for free on the website <a href=\"https://phet.colorado.edu/\" target=\"_blank\" rel=\"noopener noreferrer\">phet.colorado.edu</a>, and supports multiple languages. The goal of PhET is to provide education with better tools to help students better understand and grasp concepts from different disciplines.</p>\n<p><a href=\"https://phet.colorado.edu/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"@source/en/links/phET.jpg\" alt=\"phET\" /></a></p>\n<h3 id=\"geogebra-mathematics-teaching\" tabindex=\"-1\"> <a href=\"https://www.geogebra.org/\" target=\"_blank\" rel=\"noopener noreferrer\">GeoGebra - mathematics teaching</a></h3>\n<p>Free classroom activity digital tool for drawing calculations, geometric construction, whiteboard collaboration and more</p>\n<p><a href=\"https://www.geogebra.org/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"@source/en/links/geogebra.jpg\" alt=\"geogebra\" /></a></p>\n<h3 id=\"the-evolution-of-trust\" tabindex=\"-1\"> <a href=\"https://ncase.me/trust/\" target=\"_blank\" rel=\"noopener noreferrer\">THE EVOLUTION OF TRUST</a></h3>\n<p>An interactive instruction manual for <a href=\"https://en.wikipedia.org/wiki/Cooperative_game_theory\" target=\"_blank\" rel=\"noopener noreferrer\">Cooperative game theory</a> in the form of a game, with a total of 10 levels.</p>\n<p><a href=\"https://ncase.me/trust/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"@source/en/links/trust.jpg\" alt=\"trust\" /></a></p>\n<h3 id=\"the-scale-of-the-universe-2\" tabindex=\"-1\"> <a href=\"https://htwins.net/scale2/\" target=\"_blank\" rel=\"noopener noreferrer\">The Scale of the Universe 2</a></h3>\n<p>From the Planck length and quantum foam to the entire universe, almost infinitesimal to infinity are clearly and intuitively displayed in front of the audience. The producer uses scientific and artistic methods to let us better grasp the concept of scale.</p>\n<p><a href=\"https://htwins.net/scale2/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"@source/en/links/scale_of_the_universe.jpg\" alt=\"scale_of_the_universe\" /></a></p>\n<h3 id=\"scratch-visual-programming\" tabindex=\"-1\"> <a href=\"https://scratch.mit.edu/\" target=\"_blank\" rel=\"noopener noreferrer\">Scratch visual programming</a></h3>\n<p>It is a graphical children's programming tool designed and developed by the Massachusetts Institute of Technology MIT. Through graphic controls, children can realize many program functions without writing any code. Judging from the initial experience, children over the age of five or six can get started.</p>\n<p><a href=\"https://scratch.mit.edu/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"@source/en/links/scratch.jpg\" alt=\"scratch\" /></a></p>\n<h3 id=\"codecombat\" tabindex=\"-1\"> <a href=\"https://codecombat.com/play\" target=\"_blank\" rel=\"noopener noreferrer\">CodeCombat</a></h3>\n<p><a href=\"https://codecombat.com/play\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"@source/en/links/codecombat.jpg\" alt=\"CodeCombat\" /></a></p>\n<p>is an educational video game for learning programming concepts and programming languages. Students learn to type coding languages like JavaScript, Python, HTML, and CoffeeScript, and learn the fundamentals of computer science. CodeCombat has been open sourced so users can create their own game content</p>\n<ul>\n<li><strong>Note: <em>You can only try the first 5 levels online. To play all the content for free, you need to build your own server</em></strong></li>\n<li><strong>Note: The latest version of the CodeCombat server is no longer open source</strong></li>\n</ul>\n<h3 id=\"snap-visual-programming\" tabindex=\"-1\"> <a href=\"https://snap.berkeley.edu/\" target=\"_blank\" rel=\"noopener noreferrer\">Snap! visual programming</a></h3>\n<p>It is an open source multi-paradigm visual computer programming language developed by JS and running in the browser. Derived from the Scratch language, it includes and extends the functionality of Scratch. Primarily intended for users over the age of 12.</p>\n<ul>\n<li><a href=\"https://snap.berkeley.edu/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"@source/en/links/snap.gif\" alt=\"Snap!\" /></a></li>\n<li>The most important features different from Scratch are:\n<ul>\n<li>Higher order functions</li>\n<li>Nested lists, such as lists of lists</li>\n<li>Role nesting</li>\n<li>Snap! Code can be converted to other mainstream programming languages, such as Python, JavaScript and C, etc.</li>\n</ul>\n</li>\n<li><a href=\"https://bjc.berkeley.edu/curriculum/\" target=\"_blank\" rel=\"noopener noreferrer\">Beauty and Joy of Computing (BJC) curriculum</a></li>\n</ul>\n<h3 id=\"nasa-s-eyes\" tabindex=\"-1\"> <a href=\"https://eyes.nasa.gov/\" target=\"_blank\" rel=\"noopener noreferrer\">NASA’s Eyes</a></h3>\n<ul>\n<li><a href=\"https://eyes.nasa.gov/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"@source/en/links/nasaeyes.jpg\" alt=\"Nasa eyes\" /></a></li>\n<li>The &quot;Eye of the Solar System&quot; developed by NASA broadcasts the operation of the major planets, satellites, asteroids, and space vehicles in the solar system in all directions, as if you were there.</li>\n<li><a href=\"https://eyes.nasa.gov/curiosity/\" target=\"_blank\" rel=\"noopener noreferrer\">Curiosity Mars Rover</a></li>\n</ul>\n<h3 id=\"nasa-open-source-mars-rover\" tabindex=\"-1\"> <a href=\"https://opensourcerover.jpl.nasa.gov/\" target=\"_blank\" rel=\"noopener noreferrer\">NASA Open Source Mars Rover</a></h3>\n<p><a href=\"https://opensourcerover.jpl.nasa.gov/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"@source/en/links/jpl-rover.jpg\" alt=\"jpl-rover\" /></a></p>\n<ul>\n<li>NASA's Jet Propulsion Laboratory [JPL] is an open source DIY Mars rover project. You can make your own Mars rover according to the tutorials provided by this project.</li>\n</ul>\n<h3 id=\"children-s-programming-introduction-blockly-games\" tabindex=\"-1\"> <a href=\"https://blockly.games/\" target=\"_blank\" rel=\"noopener noreferrer\">Children's Programming Introduction - Blockly Games</a></h3>\n<p><video src=\"@source/en/links/blocky-games-small.mp4\" alt=\"blocky-games\"  controls=\"\"  autoplay=\"\"  loop=\"\"  muted=\"\" /></p>\n<ul>\n<li>A collection of learning programming games for kids with no computer programming experience</li>\n</ul>\n<h3 id=\"otto-open-source-interactive-robot-diy-that-anyone-can-do\" tabindex=\"-1\"> <a href=\"https://www.ottodiy.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Otto Open Source Interactive Robot DIY</a> that anyone can do</h3>\n<ul>\n<li><img src=\"@source/en/links/otto.jpg\" alt=\"Otto\" /></li>\n<li>Otto uses open source hardware; this means the hardware is easily available so others can make it, is Arduino compatible, and the enclosure can be customized with 3D printing</li>\n<li>Otto is not just a robot toy; you can program it which creates an emotional connection between you and him</li>\n<li><video src=\"@source/en/links/otto-obstacle-detection.mp4\" alt=\"otto-obstacle-detection\"  controls=\"\"  autoplay=\"\"  loop=\"\"  muted=\"\" /></li>\n<li>Otto is truly open source and hardware where anyone can create and share their inventions. Hundreds of people use home 3D printers to build Otto every day!</li>\n<li><img src=\"@source/en/links/otto_invs.jpg\" alt=\"otto_invs\" /></li>\n</ul>\n<h3 id=\"open-source-offline-education-platform-and-resources-kolibri\" tabindex=\"-1\"> <a href=\"https://learningequality.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Open Source Offline Education Platform and Resources - Kolibri</a></h3>\n<p>is an open source educational software designed to provide learners around the world with high-quality educational resources and a personalized learning experience. It has functions such as offline learning, personalized learning and open educational resources, which can help students learn without an Internet connection, and provide learning resources and learning paths that suit individual needs, while also allowing teachers and students to freely Create, share and access educational resources.</p>\n<ul>\n<li><img src=\"@source/en/links/kolibri-channels.jpg\" alt=\"kolibri-channels\" /></li>\n<li>Addresses the problem of hard-to-find, useful and affordable teaching and learning materials, providing a vast library of open educational resources that can be accessed offline and personalized to individual learning needs.</li>\n<li>Supports educators in achieving student-centered learning by providing a platform to create and share interactive learning content and assessments, as well as tools to track student progress and identify areas for improvement.</li>\n<li>Addresses the challenges of large class teaching and the needs of diverse learners by providing adaptive learning paths and personalized feedback that can be tailored to individual student needs and learning styles.</li>\n<li>Challenge persistent oppressive structures in education by promoting open and inclusive learning environments that prioritize the needs and voices of marginalized communities to promote fair and equitable learning environments.</li>\n<li>Promotes community ownership of the design and integration of educational technology into learning spaces by providing tools for collaboration and co-creation of learning resources.</li>\n<li>Addresses the cost of technical infrastructure and reliable internet access by allowing learners to access educational resources offline and providing content creation and sharing tools with minimal technical requirements. So far, there are 135 teaching resource channels available for download, including the aforementioned <a href=\"https://khanacademy.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Khan Academy</a>, [Blockly Games for Children's Programming Introduction](https:/ /blockly.games/),<a href=\"https://phet.colorado.edu/\" target=\"_blank\" rel=\"noopener noreferrer\">phET Interactive Simulation of Science and Math (English)</a>.</li>\n</ul>\n<h3 id=\"concord-consortium\" tabindex=\"-1\"> <a href=\"https://concord.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Concord Consortium</a></h3>\n<p>Concord Consortium is a non-profit educational research and development organization that creates innovative technology-based educational resources for teachers and students. Their mission is to help educators integrate technology into their teaching, and to help students learn more effectively through interactive and engaging activities.</p>\n<p>Concord Consortium's educational resources cover a wide range of subjects, including science, math, engineering, and technology. Some of their notable projects include <a href=\"http://mw.concord.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Molecular Workbench</a>, a simulation software for chemistry and physics education, and Common Online Data Analysis Platform (CODAP), a data analysis tool for students and teachers.</p>\n<p>Concord Consortium also conducts research and evaluation studies to measure the effectiveness of their educational resources and to inform the development of new tools and approaches.</p>\n<p><a href=\"https://learn.concord.org/\" target=\"_blank\" rel=\"noopener noreferrer\">free STEM learning resources</a></p>\n<h2 id=\"minetest\" tabindex=\"-1\"> Minetest</h2>\n<ul>\n<li><a href=\"https://www.minetest.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest official website</a>: An open source voxel game engine.</li>\n<li><a href=\"https://content.minetest.net\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest ContentDB</a>: All Mods, sub-games, textures of minetest</li>\n<li><a href=\"https://forum.minetest.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest Official Forum</a>: The official Minetest discussion board.</li>\n<li><a href=\"https://rubenwardy.com/minetest_modding_book/en/index.html\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest Modding Guide</a>: Minetest uses Lua scripts to provide modding support. This book aims to teach you how to create your own mods .</li>\n<li><a href=\"https://www.minetest.net/education/\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest for Education</a>: The Minetest for Education Information and Resources</li>\n</ul>\n",
      "date_published": "2023-06-29T14:40:54.000Z",
      "date_modified": "2023-07-07T22:57:16.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "💾 Download",
      "url": "https://edu.ihom.app/en/download/",
      "id": "https://edu.ihom.app/en/download/",
      "content_html": "<ul>\n<li>Latest Version: <a href=\"/en/changelog.html\">Minetest:Education v5.7.0-663961b4b(2023-07-06)</a></li>\n</ul>\n<h2 id=\"help-manual-offline-version-of-this-website\" tabindex=\"-1\"> Help manual (offline version of this website)</h2>\n<ul>\n<li><a href=\"https://github.com/edu-minetest/manual/releases\" target=\"_blank\" rel=\"noopener noreferrer\">Download</a></li>\n</ul>\n<h2 id=\"external-mods\" tabindex=\"-1\"> External mods</h2>\n<ul>\n<li><a href=\"https://github.com/edu-minetest/minetest/releases/download/extMods/extMods.7z\" target=\"_blank\" rel=\"noopener noreferrer\">extMods.7z</a></li>\n</ul>\n<p>After downloading, directly decompress the external module <code>extMods.7z</code> into the <code>mods</code> directory under minetest.</p>\n<h2 id=\"linux\" tabindex=\"-1\"> Linux</h2>\n<h3 id=\"linux-portable-appimage\" tabindex=\"-1\"> Linux portable(AppImage)</h3>\n<div>\n<p>Download</p>\n<ul>\n<li>Official version download:\n<ul>\n<li><a href=\"https://github.com/edu-minetest/minetest/releases/download/v5.7.0-edu-663961b4b/minetest-5.7.0-edu-663961b4b-x86_64.AppImage\" target=\"_blank\" rel=\"noopener noreferrer\">minetest-5.7.0-edu-663961b4b-x86_64.AppImage</a></li>\n</ul>\n</li>\n</ul>\n</div>\n<div>\n<p>Tips</p>\n<ul>\n<li>After downloading, modify the permissions of the file to be executable, and you can run it directly without installing dependent packages</li>\n<li>But the mod can only be set by directly modifying the configuration file\n<ul>\n<li>You cannot see the installed modules on the interface. To manage modules on the interface, you must first copy the modules to the <code>~/.minetest/</code> directory</li>\n</ul>\n</li>\n<li>The built-in CSM module cannot be loaded directly, it must be copied to the <code>~/.minetest/</code> directory too.</li>\n</ul>\n</div>\n<h3 id=\"linux-compression-files\" tabindex=\"-1\"> Linux Compression Files</h3>\n<div>\n<p>Download</p>\n<ul>\n<li>Official version download:\n<ul>\n<li><a href=\"https://github.com/edu-minetest/minetest/releases/download/v5.7.0-edu-663961b4b/minetest-5.7.0-edu-663961b4b-linux.tar.gz\" target=\"_blank\" rel=\"noopener noreferrer\">minetest-5.7.0-edu-663961b4b-linux.tar.gz</a></li>\n</ul>\n</li>\n</ul>\n</div>\n<div>\n<p>Tips</p>\n<p>After downloading, right-click to unzip the compressed file package and run <code>minetest</code> 🎮 in the bin directory (you may need to install dependent packages).</p>\n<ul>\n<li>Dependent Packages:\n<ul>\n<li>libc6</li>\n<li>libcurl3-gnutls</li>\n<li>libfreetype6</li>\n<li>libgl1</li>\n<li>libgmp10</li>\n<li>libjpeg-turbo8</li>\n<li>libjsoncpp25</li>\n<li>libleveldb1d</li>\n<li>libluajit-5.1-2</li>\n<li>libncursesw6</li>\n<li>libopenal1</li>\n<li>libpq5</li>\n<li>libspatialindex6</li>\n<li>libpng16-16</li>\n<li>libsqlite3-0</li>\n<li>libstdc++6</li>\n<li>libvorbisfile3</li>\n<li>libx11-6</li>\n<li>libxxf86vm1</li>\n<li>zlib1g</li>\n</ul>\n</li>\n</ul>\n<p>Under <code>Ubuntu</code>, you can execute the following command to install dependent packages:</p>\n<div><pre><code><span>sudo</span> <span>apt</span> <span>install</span> libc6 libcurl3-gnutls libfreetype6 libgcc-s1 <span>\\</span>\nlibgl1 libgmp10 libjsoncpp25 libleveldb1d libluajit-5.1-2 <span>\\</span>\nlibncursesw6 libopenal1 libpq5 libspatialindex6 libsqlite3-0 <span>\\</span>\nlibstdc++6 libtinfo6 libvorbisfile3 libx11-6 zlib1g\n</code></pre><div aria-hidden=\"true\"><div></div><div></div><div></div><div></div></div></div></div>\n<h2 id=\"windows-portable\" tabindex=\"-1\"> Windows portable</h2>\n<div>\n<p>Download</p>\n<ul>\n<li>Official version download:\n<ul>\n<li>Win64 self-extracting: <a href=\"https://github.com/edu-minetest/minetest/releases/download/v5.7.0-edu-663961b4b/minetest-5.7.0-edu-663961b4b-win64.exe\" target=\"_blank\" rel=\"noopener noreferrer\">minetest-5.7.0-edu-663961b4b-win64.exe</a></li>\n<li>Win64 compressed file: <a href=\"https://github.com/edu-minetest/minetest/releases/download/v5.7.0-edu-663961b4b/minetest-5.7.0-edu-663961b4b-win64.7z\" target=\"_blank\" rel=\"noopener noreferrer\">minetest-5.7.0-edu-663961b4b-win64.7z</a></li>\n<li>Win32 self-extracting: <a href=\"https://github.com/edu-minetest/minetest/releases/download/v5.7.0-edu-663961b4b/minetest-5.7.0-edu-663961b4b-win32.exe\" target=\"_blank\" rel=\"noopener noreferrer\">minetest-5.7.0-edu-663961b4b-win32.exe</a></li>\n<li>Win32 compressed file: <a href=\"https://github.com/edu-minetest/minetest/releases/download/v5.7.0-edu-663961b4b/minetest-5.7.0-edu-663961b4b-win32.7z\" target=\"_blank\" rel=\"noopener noreferrer\">minetest-5.7.0-edu-663961b4b-win32.7z</a></li>\n</ul>\n</li>\n</ul>\n</div>\n<div>\n<p>Tips</p>\n<p>After downloading, right-click to unzip the compressed file package, and run the executable file in the bin directory: <code>minetest.exe</code> 🎮.</p>\n</div>\n<div>\n<p>Note</p>\n<ul>\n<li><strong>Known Issues</strong>: Versions released before <a href=\"/en/download/\">minetest-5.6.1-edu-2d4c67fd6(2022-10-15)</a> input text on Windows systems, only Can use pure English input method, can not use any <strong>Unicode IME input method</strong> input, otherwise no text can be input. The latest version must be installed to use <strong>Unicode IME Input Method</strong>.</li>\n<li>If occasionally the IME input method cannot be called out, please click the window outside the input box (let the input box lose focus), and then switch back to the input box (click the input box again)</li>\n<li>BTW: It is normal to input unicode chars under <code>Android</code> and <code>Linux</code>(<code>Ubuntu</code>).</li>\n</ul>\n</div>\n<h3 id=\"android-phone-tablet-touch-screen-cannot-close-the-open-window-inventory-bar-in-the-game\" tabindex=\"-1\"> Android phone/tablet (touch screen) cannot close the open window (inventory bar) in the game</h3>\n<h2 id=\"android-mobile-tablet\" tabindex=\"-1\"> Android Mobile/tablet</h2>\n<div>\n<p>Download</p>\n<ul>\n<li>Official version download:\n<ul>\n<li><a href=\"https://github.com/edu-minetest/minetest/releases/download/v5.7.0-edu-663961b4b/minetest-5.7.0-edu-663961b4b-android.apk\" target=\"_blank\" rel=\"noopener noreferrer\">minetest-5.7.0-edu-663961b4b-android.apk</a></li>\n</ul>\n</li>\n</ul>\n</div>\n<div>\n<p>Tips</p>\n<p>After downloading, install it directly on your phone or tablet.</p>\n</div>\n<div>\n<p>Tips</p>\n<p>On some devices it will be extremely slow when first starting to play (new world/course), please be patient.</p>\n</div>\n<div>\n<p>Note</p>\n<p>The game operation method on Android phones and tablets is not the same as that on PCs, please read 《<a href=\"/en/guide/get-started/mobile.html\">Android Phone/Tablet Quick Start Guide</a>》</p>\n</div>\n<h2 id=\"source-code\" tabindex=\"-1\"> Source Code</h2>\n<ul>\n<li>Github : https://github.com/edu-minetest/minetest/</li>\n</ul>\n<div>\n<p>Tips</p>\n<p>This branch (<code>Release</code>) is created for releases only.</p>\n</div>\n<p>To be honest, I don't want to create an independent minetest version. In order to be able to merge back to the main branch at any time, I use an independent function branch for development.\nThe main function branch of <code>Minetest:Edu</code> is: <code>edu/builtin</code>, and a series of sub-function branches starting with <code>edu/</code>.</p>\n<p>Branch description:</p>\n<ul>\n<li><code>edu/builtin</code>: Add student interface and teacher interface</li>\n<li><code>edu/settings/binary</code>: Add support for binary configuration files</li>\n<li><code>edu/drawHeader</code>: fix drawHeader</li>\n<li><code>edu/static_spawnpoint</code>: fix spawn point issue</li>\n<li><code>edu/android/client-translation</code>: fix android default Chinese problem</li>\n<li><code>feat/singleplayer-user</code>: support multi-player in single player game</li>\n<li><code>fix/trusted_mod_io</code>: This security patch determines a function's access rights by checking which mod ultimately initiated the execution of the script function.\n<ul>\n<li>Note: You should disable Lua's tail call optimization to address the issue of Lua call stack information being lost.</li>\n<li>Here is my code to <a href=\"https://github.com/edu-minetest/LuaJIT/tree/feat/tailcall\" target=\"_blank\" rel=\"noopener noreferrer\">disable Lua's tail call optimization</a></li>\n<li>When a regular mod calls a function of a trusted mod, the privilege should not be elevated.</li>\n<li>When a trusted mod calls a function of a regular mod, the privilege should not downgrade.</li>\n</ul>\n</li>\n<li><code>rubenwardy-world_independent_common_data</code>: Modified from <a href=\"https://github.com/minetest/minetest/pull/12315\" target=\"_blank\" rel=\"noopener noreferrer\">Add world-independent storage directory for mods</a>\n<ul>\n<li><code>minetest.get_mod_data_path([mod_name])</code>: add optional <code>mod_name</code> argument.</li>\n<li>add <code>minetest.get_mod_data_path(mod_name)</code> to <code>mainmenu</code></li>\n<li>add <code>minetest.get_mod_data_path([mod_name])</code> to <code>client(CSM)</code></li>\n<li>The <code>mod_data/[mod_name]/</code> directory is typically writable by its mod owner and readable by others.</li>\n<li>already merged the <code>fix/trusted_mod_io</code> branch.</li>\n</ul>\n</li>\n<li><code>feat/csm-check_is_single_player</code>: add <code>is_single_player</code> boolean field to the <code>get_server_info()</code> client(CSM) api</li>\n<li><code>feat/csm-client_ready_etc</code>: add register_on_client_ready, register_on_camera_ready and register_on_minimap_ready callback registration to the client(CSM) api</li>\n<li><code>feature/add-unregister-function</code>: add an unregister function that is returned by global callback registration functions in LUA.</li>\n</ul>\n<h2 id=\"change-log\" tabindex=\"-1\"> Change log</h2>\n<p>See: <a href=\"/en/changelog.html\">Change log</a></p>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-07-06T10:48:05.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "📱 Get Started With Android Phone/Tablet",
      "url": "https://edu.ihom.app/en/guide/get-started/mobile.html",
      "id": "https://edu.ihom.app/en/guide/get-started/mobile.html",
      "content_html": "<h2 id=\"android-operation-guide\" tabindex=\"-1\"> Android Operation Guide</h2>\n<p>Enter the student interface after running:</p>\n<p><img src=\"@source/en/guide/get-started/imgs/mobile-student-cn.webp\" alt=\"stu-play\" /></p>\n<p>Then click the &quot;Start (Single Player) Game&quot; button to enter the game.</p>\n<div>\n<p>multiplayer game</p>\n<p>Appears only after enabling multiplayer in &quot;Teacher Mode&quot; and configuring the server address.</p>\n</div>\n<p>After entering the game, the operation method is as follows:</p>\n<p><img src=\"@source/en/guide/get-started/imgs/minetest_android_keys.webp\" alt=\"minetest_android_keys\" /></p>\n<p>The game world is made up of different kinds of &quot;blocks&quot;. All blocks in the game world can be dug out (destroyed), and of course you can place &quot;blocks&quot; anywhere.</p>\n<p>Basic operation of the game:</p>\n<ol>\n<li>First-person character walking operation</li>\n<li>Dig out (destroy) and place the &quot;block&quot;</li>\n</ol>\n<p>The game operation on the mobile phone is different from the computer operation. The mobile phone is a touch screen operation, and the touch screen operation is divided into left and right sides from the middle.</p>\n<h3 id=\"screen-left\" tabindex=\"-1\"> Screen Left</h3>\n<p>Pushing and pulling at any position on the left is to control the character's walking direction control area (<strong>movement direction control</strong> virtual button<img src=\"@source/en/guide/get-started/imgs/direction.png\" alt=\"Diection\" />) and <strong>function menu</strong> buttons (three Vertical dots<img src=\"@source/en/guide/get-started/imgs/three-dot.png\" alt=\"three dot\" />).</p>\n<ul>\n<li>Click on the <strong>Function Menu</strong> on the left (three vertical dots) <img src=\"@source/en/guide/get-started/imgs/three-dot.png\" alt=\"three dot\" />:\n<ul>\n<li>Chat bubble icon <img src=\"@source/en/guide/get-started/imgs/chat.png\" alt=\"chat\" /> - open chat window: used for chatting in multiplayer games or entering various commands</li>\n<li>Nine squares icon <img src=\"@source/en/guide/get-started/imgs/inventory.png\" alt=\"Inventory\" /> - Open the player's inventory: item equipment (synthesis) column</li>\n<li>Chest drop icon <img src=\"@source/en/guide/get-started/imgs/drop.png\" alt=\"Drop\" /> - Click to drop the item the player is holding</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"screen-right\" tabindex=\"-1\"> Screen Right</h3>\n<p>On the right is the operating area:</p>\n<ul>\n<li>Touch the screen and swipe around to adjust the line of sight for the character to rotate in place (look around)</li>\n<li>Press and hold the nearby square (object) on the screen to <strong>dig (drop the square)</strong> or <strong>click</strong>, which is equivalent to the left mouse button on the computer</li>\n<li>Double-clicking (twice in a row) the items on the screen (also all blocks) is an interactive operation (such as: placing the block in the hand, opening the door), which is equivalent to the right mouse button on the computer</li>\n</ul>\n<p>The other buttons are explained as follows:</p>\n<ul>\n<li>Click <strong>Configuration Menu</strong> <img src=\"@source/en/guide/get-started/imgs/gear.png\" alt=\"gear\" />, you can see the following buttons:\n<ul>\n<li>Binocular icon <img src=\"@source/en/guide/get-started/imgs/binocular.png\" alt=\"Binocular\" /> - toggle field of view</li>\n<li>The eye icon <img src=\"@source/en/guide/get-started/imgs/eye.png\" alt=\"Eye\" /> - toggles player view</li>\n<li>Three gear icon <img src=\"@source/en/guide/get-started/imgs/three-gear.png\" alt=\"three gear\" /> - Toggle display of debug information</li>\n<li>Running icon <img src=\"@source/en/guide/get-started/imgs/running.png\" alt=\"Running\" /> - enable/disable fast movement (requires &quot;fast&quot; privilege)</li>\n<li>Player walks through blocks icon <img src=\"@source/en/guide/get-started/imgs/noclip.png\" alt=\"NoClip\" /> - enable/disable walk through walls (requires &quot;noclip&quot; privilege)</li>\n<li>Paper airplane icon <img src=\"@source/en/guide/get-started/imgs/fly.png\" alt=\"Fly\" /> - enable/disable flight mode (requires &quot;fly&quot; privilege)</li>\n</ul>\n</li>\n<li><strong>Zoom</strong>: Depends on the game</li>\n<li><strong>Auxiliary Key</strong>(Aux1): Depends on the game.</li>\n<li><strong>Up<img src=\"@source/en/guide/get-started/imgs/up.png\" alt=\"up\" />Down<img src=\"@source/en/guide/get-started/imgs/down.png\" alt=\"down\" />Control</strong>: Use for climbing ladders, swimming, flying, etc.\n<ul>\n<li>Press and hold &quot;down&quot;! <a href=\"./imgs/down.png\">down</a> is stealth, then walk around the edge of the block, it will not fall,</li>\n<li>Hold down &quot;down&quot;<img src=\"@source/en/guide/get-started/imgs/down.png\" alt=\"down\" /> can also place blocks on chests</li>\n</ul>\n</li>\n</ul>\n<p>At the bottom of the screen is <strong>Shortcut (Equipment) Item Bar</strong>: Click to switch the things (items/equipment) in your hand.</p>\n<p><img src=\"@source/en/guide/get-started/imgs/inv.png\" alt=\"inventory\" /></p>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-30T11:48:42.000Z",
      "authors": [],
      "tags": [
        "Get Started"
      ]
    },
    {
      "title": "🖥 Get Started With PC(Computer)",
      "url": "https://edu.ihom.app/en/guide/get-started/pc.html",
      "id": "https://edu.ihom.app/en/guide/get-started/pc.html",
      "content_html": "<h2 id=\"character-movement-control-method-default-keys-binding\" tabindex=\"-1\"> Character movement control method (default keys binding)</h2>\n<ul>\n<li><img src=\"@source/imgs/wasd.jpg\" alt=\"WASD\" width=\"128\" /> Parallel movement keys: <code>W</code> forward; <code>S</code> backward, <code>A</code> left; <code>D</code> right move</li>\n<li>Mouse:\n<ul>\n<li>Move the mouse (up, down, left, and right): The character rotates in situ to adjust the line of sight (look around)</li>\n<li>Left mouse button: Destroy your selected blocks (mining)/creatures (hitting), and eat food; move items in backpack (inventory)</li>\n<li>Right Mouse Button: Interact with blocks, open (such as opening a chest, door or furnace) or use, place a block, move an item or split an item in the inventory to place a block or use an item in your hand</li>\n<li><code>Shift</code>+Right Mouse Button: Place blocks only (when needing to place blocks on chests or furnaces)</li>\n<li>Middle mouse button (usually mouse wheel pressed): Move 10 items in inventory</li>\n<li>Mouse wheel (scroll forward and backward): select items in the <code>Equip Item Quick Bar</code></li>\n</ul>\n</li>\n<li><code>Shift</code> key: Sneak (walks slower, but prevents falling off the edge of the block), down (fly, 🪜climb stairs)</li>\n<li><code>Space</code> key: jump (on the ground), up (fly, 🪜 climb stairs)</li>\n<li><code>Q</code>: Throws the item or tool in hand and throws it on the ground</li>\n<li><code>1-9</code>: <code>Equip item shortcut bar</code> to select items</li>\n<li><code>I</code>: open/close backpack (inventory)</li>\n<li><code>T</code>: open/close chat window</li>\n<li><code>C</code>: Change camera view: switch between first person and third person front (back).</li>\n<li><code>V</code>: switch minimap</li>\n<li><code>K</code>: enable/disable airplane mode (must have flight permission)</li>\n<li><code>J</code>: enable/disable fast mode (must have fast permission)</li>\n<li><code>H</code>: enable/disable wall penetration mode (must have wall penetration noclip permission)</li>\n<li><code>ESC</code> key: Open the system menu, where you can change the key position and exit the game</li>\n</ul>\n<h2 id=\"change-keys-binding\" tabindex=\"-1\"> Change keys binding</h2>\n<p><img src=\"@source/en/guide/get-started/imgs/keys.jpg\" alt=\"keys\" /></p>\n<p>Check <code>Automatic Jumping</code>, and you can jump over obstacles that you can jump over directly, just like Android phones and tablets.</p>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-28T09:25:32.000Z",
      "authors": [],
      "tags": [
        "Get Started"
      ]
    },
    {
      "title": "🎁 Mods",
      "url": "https://edu.ihom.app/en/guide/mods/",
      "id": "https://edu.ihom.app/en/guide/mods/",
      "content_html": "<ul>\n<li>Mod is short for <code>modifications</code> or <code>modules</code>, which are used to add or change gameplay</li>\n<li>Modpack (Modpack): A modpack (abbreviation: &quot;MP&quot;) is a group of mods that combine many modules (mods). Basically, modpacks are just special directories that contain the actual mod directories.</li>\n</ul>\n<div>\n<p>Please install mods carefully</p>\n<p>Poorly written mods can crash the game/server</p>\n</div>\n<div>\n<p>Tips</p>\n<ul>\n<li>How to enable/disable functional mods for the game? Please read &quot;[Parent/Teacher Guide-Out-of-Game Management: Start the Game/Master the Game](../teacher/outgame-man/#Start the Game-Host the Game)&quot;.\n<ul>\n<li>Remember: <strong>more mods you enabled</strong>, the <strong>more slower the startup speed</strong>.</li>\n</ul>\n</li>\n<li><code>Built-in mods</code> are mods that have been integrated into the game and are enabled by default. You can choose to disable the mods if you don't need them.</li>\n<li><code>external mod</code> needs to be installed by itself</li>\n</ul>\n</div>\n<p>Table of contents:</p>\n<ul>\n<li>Built-in modules:\n<ul>\n<li>Education related\n<ul>\n<li><a href=\"/en/guide/mods/quiz/\">Quiz Player Challenge Mod - Admin Mod</a>\n<ul>\n<li><img src=\"@source/en/guide/mods/quiz/quizzes.jpg\" alt=\"quizzes\" /></li>\n</ul>\n</li>\n<li>🆕️️ <a href=\"/en/guide/mods/nickname/\">nickname module</a>: Chinese nickname support\n<ul>\n<li><img src=\"@source/imgs/nickname.jpg\" alt=\"Numeracy\" /></li>\n</ul>\n</li>\n<li><a href=\"./numeracy\">Module for Numeracy numbers</a>: Numbers and measurements\n<ul>\n<li><img src=\"@source/imgs/numerica.jpg\" alt=\"Numeracy\" /></li>\n</ul>\n</li>\n<li><a href=\"/en/guide/mods/vbots/\">VBots module</a>: Graphical programming (command command sea turtle robot)\n<ul>\n<li><img src=\"@source/en/guide/mods/vbots/screenshot.jpg\" alt=\"VBots\" /></li>\n</ul>\n</li>\n<li>lwscratch: graphical programming, suitable for young children who do not understand English\n<ul>\n<li><img src=\"@source/imgs/lwscratch.jpg\" alt=\"lwscratch\" /></li>\n</ul>\n</li>\n<li>scriptblocks2: graphical programming\n<ul>\n<li><img src=\"@source/imgs/scriptblocks2.jpg\" alt=\"scriptblocks2\" /></li>\n</ul>\n</li>\n<li>computertest: programming\n<ul>\n<li><img src=\"@source/imgs/computertest.jpg\" alt=\"computertest\" /></li>\n</ul>\n</li>\n<li><a href=\"/en/guide/mods/codeblock/\">CodeBlock</a>: programming (Lua language)\n<ul>\n<li><img src=\"@source/en/guide/mods/codeblock/screenshot.jpg\" alt=\"codeblock\" /></li>\n</ul>\n</li>\n<li>mathplot: draw function image\n<ul>\n<li><img src=\"@source/imgs/mathplot.jpg\" alt=\"mathplot\" /></li>\n</ul>\n</li>\n<li>mesecons: circuit module package (Modpack)\n<ul>\n<li><img src=\"@source/imgs/mesecons_lab.jpg\" alt=\"mesecons\" /></li>\n<li><a href=\"https://content.minetest.net/packages/Palige/moremeseconds/\" target=\"_blank\" rel=\"noopener noreferrer\">MoreMesecons</a>: More Mesecons circuits</li>\n<li><a href=\"https://content.minetest.net/packages/marek/mesecons_x/\" target=\"_blank\" rel=\"noopener noreferrer\">Mesecons Extended</a>: Mesecons circuit enhancement, automatic connection</li>\n</ul>\n</li>\n<li>pipeworks: pipeline support (automation)\n<ul>\n<li><img src=\"@source/imgs/pipeworks.jpg\" alt=\"pipeworks\" /></li>\n</ul>\n</li>\n<li>digilines: digital bus (automation)\n<ul>\n<li><img src=\"@source/imgs/digilines.jpg\" alt=\"digilines\" /></li>\n</ul>\n</li>\n<li>digistuff: digital bus device\n<ul>\n<li><img src=\"@source/imgs/digistuff.jpg\" alt=\"digistuff\" /></li>\n</ul>\n</li>\n<li>technic: Extended mechanics (electricity and ore)\n<ul>\n<li><img src=\"@source/imgs/technic.jpg\" alt=\"technic\" /></li>\n</ul>\n</li>\n<li>missions: mission (course) design\n<ul>\n<li>awards: Honor Roll\n<ul>\n<li><img src=\"@source/imgs/awards.jpg\" alt=\"awards\" /></li>\n</ul>\n</li>\n<li>xp_redo: experience value system\n<ul>\n<li><img src=\"@source/imgs/xp_redo.jpg\" alt=\"xp_redo\" /></li>\n</ul>\n</li>\n</ul>\n</li>\n<li><a href=\"https://content.minetest.net/packages/VanessaE/basic_signs/\" target=\"_blank\" rel=\"noopener noreferrer\">basic_signs</a>: In-game text signs\n<ul>\n<li><img src=\"@source/imgs/basic_signs.jpg\" alt=\"basic_signs\" /></li>\n<li>signs_lib: dependent library of <a href=\"https://content.minetest.net/packages/VanessaE/basic_signs/\" target=\"_blank\" rel=\"noopener noreferrer\">basic_signs</a></li>\n</ul>\n</li>\n<li>street_signs: various street signs\n<ul>\n<li><img src=\"@source/imgs/street_signs.jpg\" alt=\"street_signs\" /></li>\n</ul>\n</li>\n<li>worldedit: In-game world editor (needed by codeblock)\n<ul>\n<li><img src=\"@source/imgs/worldedit.jpg\" alt=\"worldedit\" /></li>\n</ul>\n</li>\n<li>classroom: manage students in the game\n<ul>\n<li><img src=\"@source/imgs/classroom.jpg\" alt=\"classroom\" /></li>\n</ul>\n</li>\n<li>accountmgr: game account management\n<ul>\n<li><img src=\"@source/imgs/accountmgr.jpg\" alt=\"accountmgr\" /></li>\n</ul>\n</li>\n<li>country_flags: national flags\n<ul>\n<li><img src=\"@source/imgs/country_flags.jpg\" alt=\"country_flags\" /></li>\n</ul>\n</li>\n<li>🆕️️ go: Go\n<ul>\n<li><img src=\"@source/imgs/go.jpg\" alt=\"go\" /></li>\n</ul>\n</li>\n<li>🆕️️ lwcomputer: Provides <code>programmable computers</code> and <code>robots</code>, <code>floppy disks</code>, <code>printers</code>, graphics screens, touch screens, <code>mesecons</code> controlled by <code>digilines</code> power switches, solid conductor blocks, vertically moving floors and <code>trash</code>Items.\n<ul>\n<li><img src=\"@source/imgs/lwcomputer.jpg\" alt=\"lwcomputer\" /></li>\n</ul>\n</li>\n<li>🆕️️ lwroad_tracks: car and road tracks (function similar to rail cars)\n<ul>\n<li><img src=\"@source/imgs/lwroad_tracks.jpg\" alt=\"lwroad_tracks\" /></li>\n</ul>\n</li>\n<li>🆕️️ lwcomponents: Various components for mesecons and digilines.\n<ul>\n<li><img src=\"@source/imgs/lwcomponents.jpg\" alt=\"lwcomponents\" /></li>\n</ul>\n</li>\n<li>🆕️️ lwwires: Various wires and bundle cables.\n<ul>\n<li><img src=\"@source/imgs/lwwires.jpg\" alt=\"lwwires\" /></li>\n</ul>\n</li>\n<li>🆕️️ led_marquee: Provides a simple LED marquee via <code>Digilines</code> that accepts single characters, strings, or fullscreen text.\n<ul>\n<li><img src=\"@source/imgs/led_marquee.jpg\" alt=\"led_marquee\" /></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Basic enhancement\n<ul>\n<li>unified_inventory: advanced inventory, enabling it will replace the default inventory, which has more functions (<strong>recommended</strong>)\n<ul>\n<li><img src=\"@source/imgs/unified_inventory.jpg\" alt=\"unified_inventory\" /></li>\n<li>unified_inventory_plus\n<ul>\n<li><img src=\"@source/imgs/unified_inventory_plus.jpg\" alt=\"unified_inventory_plus\" /></li>\n</ul>\n</li>\n<li>unified_inventory_themes\n<ul>\n<li><img src=\"@source/imgs/unified_inventory_themes.jpg\" alt=\"unified_inventory_themes\" /></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>3d_armor: Adds armor protection for players\n<ul>\n<li><img src=\"@source/imgs/3d_armor.jpg\" alt=\"3d_armor\" /></li>\n<li><s>3d_armor_flyswim: Provide animations for flying, swimming, and climbing</s>: Has been moved to an external module.</li>\n</ul>\n</li>\n<li>skinsdb: player skin (custom player image)\n<ul>\n<li><img src=\"@source/imgs/skinsdb.jpg\" alt=\"skinsdb\" /></li>\n</ul>\n</li>\n<li>🆕️️ bedrock2: bedrock mod, place a layer of indestructible bedrock at the bottom of the world, no matter in survival mode or creative mode in the game, this layer of bedrock cannot be destroyed or manipulated.\n<ul>\n<li><img src=\"@source/imgs/bedrock2.jpg\" alt=\"bedrock2\" /></li>\n<li>By default, the bedrock layer is at a Y coordinate of -30912. However, the location of the bedrock layer can be changed by modifying the mod's settings if desired.</li>\n</ul>\n</li>\n<li>bonemeal: Adds bones and bonemeal to enable fast growth of plants and saplings.\n<ul>\n<li><img src=\"@source/imgs/bonemeal.jpg\" alt=\"bonemeal\" /></li>\n</ul>\n</li>\n<li>unifieddyes: unified dyes expands the standard dye set from 15 colors to a maximum of 256 colors (depending on the object being colored)\n<ul>\n<li><img src=\"@source/imgs/unifieddyes.jpg\" alt=\"unifieddyes\" /></li>\n</ul>\n</li>\n<li>basic_materials: &quot;basic&quot; materials and items\n<ul>\n<li><img src=\"@source/imgs/basic_materials.jpg\" alt=\"basic_materials\" /></li>\n</ul>\n</li>\n<li>moreores: more ores\n<ul>\n<li><img src=\"@source/imgs/moreores.jpg\" alt=\"moreores\" /></li>\n</ul>\n</li>\n<li>moreblocks: more blocks\n<ul>\n<li><img src=\"@source/imgs/moreblocks.jpg\" alt=\"moreblocks\" /></li>\n</ul>\n</li>\n<li>more_chests: more chests\n<ul>\n<li><img src=\"@source/imgs/more_chests.jpg\" alt=\"more_chests\" /></li>\n</ul>\n</li>\n<li>biofuel: biofuel\n<ul>\n<li><img src=\"@source/imgs/biofuel.jpg\" alt=\"biofuel\" /></li>\n</ul>\n</li>\n<li>wielded_light: The torch (lamp) can also emit light when held in the hand\n<ul>\n<li><img src=\"@source/imgs/wielded_light.jpg\" alt=\"wielded_light\" /></li>\n</ul>\n</li>\n<li>handsholds_redo: Freehand rock climbing\n<ul>\n<li>Use the ⛏️ pickaxe (right button) to punch holes in the rock (note that holes cannot be drilled on soil or sand), and then you can climb: up and down keys.</li>\n<li><img src=\"@source/imgs/handholds_redo.jpg\" alt=\"handholds_redo\" /></li>\n</ul>\n</li>\n<li>elevator: elevator\n<ul>\n<li><img src=\"@source/imgs/elevator.jpg\" alt=\"elevator\" /></li>\n</ul>\n</li>\n<li>🆕️️ lwcolorable: A modifier block that can change color with the color sprayer\n<ul>\n<li><img src=\"@source/imgs/lwcolorable.jpg\" alt=\"lwcolorable\" /></li>\n</ul>\n</li>\n<li>🆕️️ petz: Very cute pet mods: kittens, puppies, ducklings, lambs... Take care of them!\n<ul>\n<li><img src=\"@source/imgs/petz.jpg\" alt=\"petz\" /></li>\n</ul>\n</li>\n<li>🆕️️ visible_wielditem: Show the item you are holding\n<ul>\n<li><img src=\"@source/imgs/visible_wielditem.jpg\" alt=\"visible_wielditem\" /></li>\n</ul>\n</li>\n<li>🆕️️ ccompass <img src=\"@source/imgs/ccompass.gif\" alt=\"ccompass\" width=\"32\" />: Adds a calibratable compass for minetest</li>\n<li>🆕️️ item_drop mod: Provides a pick/drop item mechanism similar to minecraft</li>\n<li>🆕️️ x_bows: Bows and arrows 🏹\n<ul>\n<li><img src=\"@source/imgs/x_bows.jpg\" alt=\"x_bows\" width=\"468\" /></li>\n</ul>\n</li>\n<li>🆕️️ x_bows_extras: more bows 🏹\n<ul>\n<li><img src=\"@source/imgs/x_bows_extras.jpg\" alt=\"x_bows_extras\" width=\"468\" /></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Basic library\n<ul>\n<li>formspecs: base library</li>\n<li>formspec_ast: base library</li>\n<li>flow: basic library</li>\n<li>vector3: basic library</li>\n<li>tubelib2: basic library</li>\n<li>🆕️️ fslib: base library</li>\n<li>🆕️️ modlib: basic library</li>\n<li>🆕️️ tt: Extended tooltip base library</li>\n<li>playerphysics: basic library (Player Physics API)</li>\n<li>🆕️️ <a href=\"https://github.com/fluxionary/minetest-futil.git\" target=\"_blank\" rel=\"noopener noreferrer\">futil</a></li>\n<li>🆕️️ <a href=\"https://github.com/fluxionary/minetest-fmod.git\" target=\"_blank\" rel=\"noopener noreferrer\">fmod</a></li>\n<li>🆕️️ player_monoids: is a library for managing global player state</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>external Mods: <a href=\"/en/download/#external-mods\">Download</a>\n<ul>\n<li>3d_armor_flyswim</li>\n<li>anvil</li>\n<li>calendar</li>\n<li>cloudlands</li>\n<li>currency</li>\n<li>doxy_mini_tram</li>\n<li>fire_plus</li>\n<li>hopper</li>\n<li>mob_horse</li>\n<li>mobs_sky</li>\n<li>nether: The nether mod adds an underground abyss that you can enter through obsidian portals. There are different map generation methods in the Abyss.\n<ul>\n<li>You can reach a huge lava sea by finding rare passages in nether rocks.</li>\n<li>Nether portals are vertical rectangular frames made of obsidian, 4 blocks wide and 5 blocks high. After the construction is complete, you can right-click and use the Mese crystal shard to activate the portal.</li>\n<li><img src=\"@source/imgs/nether.jpg\" alt=\"nether\" width=\"468\" /></li>\n</ul>\n</li>\n<li>power banks</li>\n<li>steampunk_blimp\n<ul>\n<li><img src=\"@source/imgs/steampunk_blimp.jpg\" alt=\"steampunk_blimp\" width=\"468\" /></li>\n<li>This mod implements a fantasy steampunk hot air balloon airship that can be used in the Minetest game. This mod was made for fun, but it tries to provide an immersive operating experience. It can carry 7 players.</li>\n<li>To fly, some items need to be provided, such as fuel and boiler water. Fuel can be coal, briquettes and wood. On the balloon, provide fuel and water by tapping on the desired item. There is another way to add water to the boiler: if the balloon lands on water, water can be loaded through the menu. But the current pressure will be lost.</li>\n<li>Activate the stove in the first option of the menu. Take control of the balloon by activating the option &quot;Take control&quot;.</li>\n<li>Information panels will be displayed on the left and bottom of the screen. Wait for the boiler to reach the proper operating pressure (green) before operating the power lever. Press the jump key (space bar) to fly upwards. Note that it takes some pressure out of the boiler. Hold down the sneak key (Shift key) to fly down.</li>\n<li>Increase propeller power forward, decrease backward. To reverse, press and hold the assist key (E key) and the back key at the same time. There is a power mode. When the lever is at its upper limit, hold E and the forward key to increase the acceleration. But be aware that the boiler will lose pressure.</li>\n<li>Balloon inventory can be accessed via Aux(E) + right click.</li>\n<li>Share owner:\n<ul>\n<li>This car is designed for group sharing. So the owner can set more users to operate it. Inside the balloon, just use the command <code>/blimp_share &lt;name&gt;</code> to share. To remove someone from a share, use <code>/blimp_remove &lt;name&gt;</code>. To list owners, use <code>/blimp_list</code>. Balloon access can be locked so that only the owner can enter: <code>/blimp_lock true</code>. Anyone can enter, <code>/blimp_lock false</code>. All shared owners have access to balloon inventory.</li>\n</ul>\n</li>\n<li>Airship appearance painting:\n<ul>\n<li>As with the plane, hit the hull with the dye and the main color will change.</li>\n<li>To change the secondary color, hold down the Modifier (E) key, then thrash with the dye.</li>\n<li>To set a logo on a balloon, enter the balloon and enter the command <code>/blimp_logo</code>.\n*Only original owner may paint.</li>\n</ul>\n</li>\n<li>hot key:\n<ul>\n<li>Right click to enter and access the menu</li>\n<li>Painted by thrashing with dye</li>\n<li>Forward and backward in the driving position: control the power lever</li>\n<li>left and right in the driving position: control the direction</li>\n<li>Jump and Sneak: Control to move up and down</li>\n<li>E + right click to enter: access inventory</li>\n<li>In driving position E+backwards: the machine drives backwards</li>\n<li>In driving position E+forward: extra power</li>\n</ul>\n</li>\n<li>hint:\n<ul>\n<li>Be careful driving it.</li>\n<li>The captain can leave the driving position to walk around.</li>\n<li>If a player times out or exits in flight, the balloon will &quot;rescue&quot; him if no other players enter the balloon, so it's best to wait for a friend in a safe place away from anyone trying to enter the balloon.</li>\n</ul>\n</li>\n<li>Known issues:\n<ul>\n<li>Walking inside a boat is affected by server latency, because the add-on function does not have an interpolation method.</li>\n<li>The rubber band bug issue is inherently a problem with Minetest and can be fixed by simply closing and reopening Minetest. Or try to live Michael Jackson's life and learn the proper Moonwalk XD</li>\n<li>Some older versions of Minetest may have weird issues with the camera being set to the center of the map. If this happens, type <code>/blimp_eject</code> to move freely again.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>tone_bells: Added a new type of block called &quot;tone bells&quot;. Tone Clocks can play musical notes like musical note blocks. Unlike note blocks, you can select notes by stacking tone bells of different colors.\n<ul>\n<li><img src=\"@source/imgs/tone_bells.jpg\" alt=\"tone_bells\" width=\"468\" /></li>\n<li>The tone clock has 4 colors. There is an initial note in it. Each pitch bell raises the pitch of the resulting note by a certain amount.</li>\n<li>Gray tone bells do not change the pitch of the resulting note. They can be used to play starting notes and to make tone bells in the other three colors.</li>\n<li>The red tone bell slightly raises the pitch of the resulting note.</li>\n<li>Blue tone bells will dramatically raise the pitch of the resulting note.</li>\n<li>The yellow tone bell will raise the pitch of the resulting note very slightly.</li>\n<li>Stacking tone bells together can create different notes. To play a note, just tap the stacked bell. You can also use mesecons to activate tonal bells, allowing you to play multiple notes simultaneously to form chords.</li>\n<li>Try to explore what kind of melodies you can make!</li>\n</ul>\n</li>\n<li>wine allows players to ferment different foods into delicious drinking wine, depending on other mods you have enabled. For example, if the Farming Redo mod is enabled, you can ferment grapes into wine, etc., if the Mobs Animals mod is enabled, you can ferment honey into mead, and if the MineClone2 mod is enabled, you can ferment wheat into Beer and more.\n<ul>\n<li><img src=\"@source/imgs/wine.jpg\" alt=\"wine\" width=\"468\" /></li>\n<li>By placing 9 drink cups in the crafting slot, they can be crafted into wine bottles. Drink glasses and wine bottles can be placed as decorations. A Wine Barrel can be crafted by adding a row of Wood and two Steel Ingots to the crafting bar.</li>\n<li>Hover over a keg to see progress info, or hover over the keg icon inside a keg to see what's brewing.\n*Many other foods can also be used to ferment different kinds of alcoholic beverages. If used with the author's Stamina mod, the player will appear drunk when you drink too much.</li>\n</ul>\n</li>\n<li>advtrains: Advanced Trains (Advanced Train) is a module for train simulation. Its main feature is to provide realistic trains and various railway equipment, with an emphasis on automatic train operation.\n<ul>\n<li><img src=\"@source/imgs/advtrains.jpg\" alt=\"advtrains\" width=\"468\" /></li>\n<li>Almost realistic track system, including curves and switches.</li>\n<li>Railway signaling system, which can be controlled in various ways.</li>\n<li>ATC (Automatic Train Control) System: Simple command-based automatic train control.</li>\n<li>LuaATC (Lua script-based automatic train control) system: a powerful automatic train operating system (needs certain programming knowledge).</li>\n<li>Interlocking (interlocking) system, including track segmentation, routing and automatic stop before the signal and other functions.</li>\n</ul>\n</li>\n<li>advtrains_portable_remote_control: Provides a rebindable remote controller for the advtrains train mod.\n<ul>\n<li><img src=\"@source/imgs/advtrains_portable_remote_control.jpg\" alt=\"advtrains_portable_remote_control\" width=\"468\" /></li>\n<li>Bind the train\n<ul>\n<li>Use the controller to left-click on the locomotive to bind the controller to the locomotive. Controllers will only be bound to specific locomotives, not the entire train, allowing control of the locomotive to be maintained while shunting, even though the train ID may change.</li>\n<li>Please note: this controller can only be bound to locomotives, i.e. entities that have <code>is_locomotive = true</code> in the advtrains registration definition.</li>\n</ul>\n</li>\n<li>Rebind the train\n<ul>\n<li>To rebind the controller to another locomotive, just click the &quot;Bind to New Train&quot; button. Saved locomotives are wiped from memory in preparation for rebinding.</li>\n</ul>\n</li>\n<li>train information\n<ul>\n<li>When the user uses the controller, the <code>External Display</code>, <code>Internal Display</code>, <code>Routing Code</code> and <code>Line</code> fields will be read from the bound train. If these fields are changed between the time these fields are read from the train and the user clicks &quot;Update Train Info&quot;, the changes will be written to the train, overwriting any changes the train may have accumulated in the meantime (e.g. via station tracks Changed internal display text).</li>\n</ul>\n</li>\n<li>Train control\n<ul>\n<li>When the user uses the controller, the <code>Set Speed</code> field will also read from the train, but it will read the actual speed of the train at that moment. The speed is sent to the train only when the &quot;Confirm&quot; button is clicked.</li>\n<li>The <code>Send ATC</code> field does exactly the same thing as a train traveling on an ATC track and following the direction of the arrow. Users can use this feature to pre-program maneuvers without having to keep returning to the controller. For the commands and syntax of the ATC controller, see the <a href=\"https://advtrains.de/wiki/doku.php?id=usage:nodes:atc_controller\" target=\"_blank\" rel=\"noopener noreferrer\">ATC controller's documentation</a>. When you click send, the command is sent to the train immediately and is not held in memory during controller use.</li>\n<li><code>Disable ARS</code> and <code>Autocouple</code> checkboxes will also be read from the train when the user is using the controller. If the train has been set to couple via the <code>Cpl</code> ATC command or the <code>set_autocouple()</code> LuaATC command, the <code>Autocouple</code> checkbox will appear checked. Manually checking the checkbox has the same effect as <code>set_autocouple()</code>. <code>Disable ARS</code> needs to enable <code>advtrains_interlocking</code> sub-module to take effect, its effect is equivalent to <code>A</code> ATC command and <code>atc_set_ars_disable()</code> LuaATC command.</li>\n</ul>\n</li>\n<li>Permission requirements\n<ul>\n<li>Since the train can be controlled from anywhere on the server, <code>train_admin</code> permission is required to use this tool.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>advtrains_custom: Added <code>advtrains_custom.max_range</code> parameter for advtrains module\n<ul>\n<li>It allows the player to control the maximum range of the train. Specifically, this parameter controls in which zones trains can be activated and run.</li>\n<li>By default, trains will only be activated and run within a certain radius around the player. This is to avoid too many trains occupying server resources, so as to maintain the smoothness of the game. In the advtrains mod, this range is usually 500 nodes. This means that if the player is more than 500 nodes away from the train, the train will be suspended until the player gets closer again.</li>\n<li>Players can increase or decrease this range by adjusting the advtrains_custom.max_range parameter. For example, setting this parameter to 1000 will make the train run in a larger area, while setting this parameter to 250 will make the train run only in a smaller area. However, please note that if the range is set too large, it may cause excessive occupation of server resources, thereby affecting the fluency of the game.</li>\n</ul>\n</li>\n<li>appliances</li>\n<li>calendar_node</li>\n<li>compactor</li>\n<li>decoshelves</li>\n<li>draconis: Added huge and terrifying dragons and powerful dragon scale steel equipment.\n<ul>\n<li><img src=\"@source/imgs/draconis.jpg\" alt=\"draconis\" width=\"468\" /></li>\n<li>Dragons are huge flying beasts with powerful breaths capable of destroying almost anything.</li>\n<li>Dragon eggs are rare and valuable drops from old dragons. Place a dragon egg in a 3x3 bonepile nest and the dragon egg will &quot;wake up&quot; and you can set it on fire or drown it to start hatching.</li>\n<li>Dragonscale steel can be used to craft tools and armor (if the 3d armor mod is enabled), they far outperform diamonds. Dragonscale steel is expensive, time-consuming, and cannot be stacked. Each ingot is directly tied to the dragon that forged it, and ingots forged by different individual dragons cannot be mixed for crafting. Dragonscale steel tools gain power from the dragon they are attached to, with attack power and speed increasing the closer the tool is to the dragon. Instead, if the dragon dies, the tool will shatter when used.</li>\n</ul>\n</li>\n<li>fireworkz</li>\n<li>item_replicator</li>\n<li>mobkit</li>\n<li>mobs_water</li>\n<li>nextgen_bows</li>\n<li>power_generators</li>\n<li>technic_cnc_improve</li>\n<li>toolranks</li>\n<li>area_containers</li>\n<li>castle_gates</li>\n<li>cool_trees</li>\n<li>digtron</li>\n<li>ethereal</li>\n<li>footprints</li>\n<li>jonez</li>\n<li>mobs</li>\n<li>mobs_xenomorph</li>\n<li>nixie_tubes</li>\n<li>protector</li>\n<li>technic_diamond</li>\n<li>tpr</li>\n<li>areas</li>\n<li>character_anim</li>\n<li>cracked_castle</li>\n<li>display_modpack</li>\n<li>exchange</li>\n<li>futil</li>\n<li>lucky_block</li>\n<li>mobs_animal</li>\n<li>moretrains</li>\n<li>nssm</li>\n<li>redef</li>\n<li>technic_hv_extend</li>\n<li>trike</li>\n<li>airutils</li>\n<li>atm</li>\n<li>city_commoditymarket</li>\n<li>creatura</li>\n<li>dlxtrains_modpack</li>\n<li>extra_doors</li>\n<li>goops_rings</li>\n<li>maidroid_ng</li>\n<li>mobs_monster</li>\n<li>moretrees</li>\n<li>pdisc</li>\n<li>school_furniture</li>\n<li>technictrain</li>\n<li>upgrade_packs</li>\n<li>alchemy</li>\n<li>basic_trains</li>\n<li>climate</li>\n<li>creeper</li>\n<li>doc_modpack</li>\n<li>farming: Farming Redo mod, which comes with many new crops that spawn throughout the map. New food only needs to be planted on top of plowed soil, so no seeds are needed. Primitive wheat and cotton require seeds, which can be found in normal and jungle grass. Crops can even grow while the player is away, or if you want quick access to food, the Bonemeal mod can help speed up the growth of your favorite dishes.\n<ul>\n<li><img src=\"@source/imgs/farming_redo.jpg\" alt=\"farming_redo\" width=\"468\" /></li>\n</ul>\n</li>\n<li>hidroplane</li>\n<li>mob_core</li>\n<li>mobs_npc</li>\n<li>more_up_packs</li>\n<li>playerfactions</li>\n<li>sling</li>\n<li>throwing</li>\n<li>vines</li>\n<li>animalia</li>\n<li>biome_lib</li>\n<li>clothing</li>\n<li>cucina_vegana</li>\n<li>doors</li>\n<li>farming_nextgen</li>\n<li>homedecor_modpack</li>\n<li>mob_crab</li>\n<li>mobs_skeletons</li>\n<li>nautilus</li>\n<li>smartshop</li>\n<li>throwing_arrows</li>\n<li>void_chest</li>\n<li>🆕️️ i3 advanced inventory module: Note that it conflicts with <code>unified_inventory</code> advanced inventory, only any one can be selected at the same time\n<ul>\n<li><img src=\"@source/imgs/i3.jpg\" alt=\"i3\" /></li>\n<li>Note: some mods do not support i3</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-28T09:25:32.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "🎮 Game Guide",
      "url": "https://edu.ihom.app/en/guide/play/",
      "id": "https://edu.ihom.app/en/guide/play/",
      "content_html": "<div>\n<p>Tips</p>\n<p>If you are not clear about the operation of the game, please read the <a href=\"/en/guide/get-started/\">Get Started</a>.</p>\n</div>\n<h2 id=\"give-yourself-a-name-in-the-game-world\" tabindex=\"-1\"> Give yourself a name in the game world</h2>\n<p>Run the application, after entering, you will see the following interface, just enter your name under &quot;Name&quot;, if it is a multiplayer game, you can click the <code>Password</code> button and enter your own password (the password will be encrypted and saved, no need to re-enter).</p>\n<div>\n<p>Note</p>\n<p>The name can only be English characters, not unicode or special chars.\nThe nickname can be unicode chars. but you must enable the <a href=\"/en/guide/mods/nickname/\">nickname mod</a> first to play.</p>\n</div>\n<div>\n<p>Note</p>\n<ul>\n<li><strong>Known Issues</strong>: Versions released before <a href=\"/en/download/\">minetest-5.6.1-edu-2d4c67fd6(2022-10-15)</a> input text on Windows systems, only Can use pure English input method, can not use any <strong>Unicode IME input method</strong> input, otherwise no text can be input. The latest version must be installed to use <strong>Unicode IME Input Method</strong>.</li>\n<li>If occasionally the IME input method cannot be called out, please click the window outside the input box (let the input box lose focus), and then switch back to the input box (click the input box again)</li>\n<li>BTW: It is normal to input unicode chars under <code>Android</code> and <code>Linux</code>(<code>Ubuntu</code>).</li>\n</ul>\n</div>\n<h3 id=\"android-phone-tablet-touch-screen-cannot-close-the-open-window-inventory-bar-in-the-game\" tabindex=\"-1\"> Android phone/tablet (touch screen) cannot close the open window (inventory bar) in the game</h3>\n<p><img src=\"/imgs/play-cn.jpg\" alt=\"play-cn\" /></p>\n<h2 id=\"start-the-game\" tabindex=\"-1\"> Start the game</h2>\n<p>Then click the &quot;<code>Start (Single Player) Game</code>&quot; button to start the game.\nIf you want to play <code>multiplayer game</code>, you must enter [teacher mode configuration](../teacher/outgame-man/#teacher mode).</p>\n<div>\n<p>Tips</p>\n<p>If there is no configuration, the system defaults to running the game with damage enabled [Creative Mode] (./creative/).</p>\n</div>\n<p>If the child is relatively young (&lt;10 years old), it is recommended to start with [creative mode] (./creative/) and do not enable damage. If your child is adventurous, try <a href=\"/en/guide/play/survival/\">Survival Mode</a>.</p>\n<p><a href=\"/en/guide/play/survival/\">Survival Mode</a> can help younger children understand why houses, torches and myths and legends were needed in the Stone Age.</p>\n<div>\n<p>Tips</p>\n<p>How to enable <a href=\"/en/guide/play/survival/\">Survival Mode</a> and disable damage, please refer to &quot;<a href=\"/en/guide/teacher/\">Parent/Teacher Guide</a>&quot;.</p>\n</div>\n",
      "image": "https://edu.ihom.app/imgs/play-cn.jpg",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": [
        "Guide",
        "Game"
      ]
    },
    {
      "title": "🧑‍🏫 Parent/Teacher Guide",
      "url": "https://edu.ihom.app/en/guide/teacher/",
      "id": "https://edu.ihom.app/en/guide/teacher/",
      "content_html": "<p>Management can be divided into <a href=\"./outgame-man\">out-of-game management</a> and <a href=\"./ingame-man\">in-game management</a>, and <a href=\"./outgame-man\">out-of-game management</a> is performed by entering <code>teacher mode</code> Yes, in <code>teacher mode</code>, you can manage the content of your child's game lessons and host multiplayer games.</p>\n<p>And [in-game management] (./ingame-man) refers to the management when running the game, such as granting/taking back the player's permissions (flight, chat, and the unique permissions of various modules...), for Game time management and interspersed exercises between playthroughs are also implemented in-game through the <a href=\"../mods/quiz\">Quiz Player Challenge</a> mod.</p>\n<h2 id=\"basic-concept\" tabindex=\"-1\"> Basic concept</h2>\n<ul>\n<li>\n<p>Mod: Mod is short for <code>modifications</code> or <code>modules</code>, used to add or change gameplay</p>\n<div>\n<p>Please use mods with caution</p>\n<ol>\n<li>Poorly written mods can crash the game/server</li>\n<li>The more modules are enabled, the more computer resources will be occupied and the startup will be slower</li>\n</ol>\n</div>\n</li>\n<li>\n<p>Sub Game (Sub Game): To put it simply, it is a combination of a series of functional <code>modules</code>, plus some customized rules, so that Minetest has different game types such as sandbox, puzzle solving, and action .</p>\n<ul>\n<li>The educational version is based on the official <a href=\"https://github.com/minetest/minetest_game\" target=\"_blank\" rel=\"noopener noreferrer\">minetest_game</a> basic game. This is a completely peaceful world without any animals. It is a nature composed of many ecosystems, but No matter how old the device is, it can run, so it is used for educational courses.</li>\n</ul>\n</li>\n<li>\n<p>Modpack (Modpack): A modpack (abbreviation: &quot;MP&quot;) is a combination of multiple modules (mod). Basically, modpacks are just special directories that contain the actual mod directory.</p>\n</li>\n<li>\n<p>Texture Pack: Used to change the appearance of blocks, items and creatures in the game</p>\n</li>\n<li>\n<p>Privileges: Refers to the user's privileges in the game world (that is, the course), such as: interact, chat, fly, pass through walls, etc.</p>\n<ul>\n<li>Ordinary users (students) only have permission to interact, chat, and change nicknames by default</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"out-of-game-management\" tabindex=\"-1\"> <a href=\"./outgame-man\">Out-of-game management</a></h2>\n<div>\n<p>Tips</p>\n<p>After running, click &quot;teacher mode&quot;, enter the password and enter the management interface.\n<a href=\"./outgame-man\"><img src=\"@source/imgs/pc-stu.gif\" alt=\"pc\" /></a></p>\n</div>\n<div>\n<p>Initial Admin Password</p>\n<ul>\n<li>The default initial admin password is six numbers: <code>double seven, double eight and double nine</code></li>\n<li>Please change it at once.</li>\n</ul>\n</div>\n<p>For more detailed instructions (including modifying the management password, etc.), please click: <a href=\"./outgame-man\">Out-of-game management</a></p>\n<h2 id=\"in-game-management\" tabindex=\"-1\"> <a href=\"./ingame-man\">In-game management</a></h2>\n<div>\n<p>Tips</p>\n<p>In game:</p>\n<ul>\n<li>Can manage players and player permissions;</li>\n<li>Many mods can also be managed in-game by providing chat commands\n<a href=\"./ingame-man\"><img src=\"/imgs/pc-light.gif\" alt=\"pc\" /></a></li>\n</ul>\n</div>\n<p>For more detailed instructions (including how to authorize), please click: <a href=\"./ingame-man\">In-Game Management</a></p>\n<h2 id=\"introduction-to-app-folder\" tabindex=\"-1\"> Introduction to App Folder</h2>\n<Tabs :data='[{\"title\":\"Windows\",\"value\":\"windows\"},{\"title\":\"Linux\",\"value\":\"linux\"}]' tab-id=\"operator\">\n<template #tab0=\"{ title, value, isActive }\">\n<div><pre><code>|-bin\\               # The directory where the application is located\n   |- minetest.exe   # minetest application execution program under Windows, server program is also it\n|-mods\\              # The directory where the function module is located\n    |-quiz\\          # Quiz Challenge Practice Mod Directory\n        |-config.yml # Initial configuration file for the challenge exercise\n|-mod_data\\          # Data directory of function modules\n    |-quiz\\          # Data directory for the Quiz challenge practice mod\n        |-config.yml # Configuration file for challenge exercises: all exercises and prizes can be set here\n        |-students\\  # Answer Logging for Challenge Exercises\n|-games\\             # Subgame directory\n   |-minetest_game\\  # Minetest Official Base Subgame\n   |-MineClone2\\     # minecraft remake subgame\n   |-tutorial\\       # A Simple Tutorial for Minetest Subgames\n|-worlds\\            # The directory where the game world (course) is located\n   |-default\\        # Default world (course), created automatically when first started\n       |-world.mt    # Configuration file for the default world (course)\n       |-quiz_config.yml # Configuration files for challenge exercises: different topics and rewards for different courses\n</code></pre><div aria-hidden=\"true\"><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div></div></div></template>\n<template #tab1=\"{ title, value, isActive }\">\n<div><pre><code>|-bin\\               # The directory where the application is located\n   |- minetest       # minetest application execution program under Linux\n   |- minetestserver # minetest Independent Server Execution Program under Linux\n|-mods\\              # The directory where the function module is located\n    |-quiz\\          # Quiz Challenge Practice Mod Directory\n        |-config.yml # Initial configuration file for the challenge exercise\n|-mod_data\\          # Data directory of function modules\n    |-quiz\\          # Data directory for the Quiz challenge practice mod\n        |-config.yml # Configuration file for challenge exercises: all exercises and prizes can be set here\n        |-students\\  # Answer Logging for Challenge Exercises\n|-games\\             # Subgame directory\n   |-minetest_game\\  # Minetest Official Base Subgame\n   |-MineClone2\\     # minecraft remake subgame\n   |-tutorial\\       # A Simple Tutorial for Minetest Subgames\n|-worlds\\            # The directory where the game world (course) is located\n   |-default\\        # Default world (course), created automatically when first started\n       |-world.mt    # Configuration file for the default world (course)\n       |-quiz_config.yml # Configuration files for challenge exercises: different topics and rewards for different courses\n</code></pre><div aria-hidden=\"true\"><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div></div></div></template>\n</Tabs>\n<h2 id=\"start-the-server-directly-without-entering-the-graphical-interface\" tabindex=\"-1\"> Start the server directly (without entering the graphical interface)</h2>\n<div>\n<p>Tips</p>\n<p><strong>Note</strong>: You must have entered the graphical interface of &quot;minetest Education Edition&quot; at least once, otherwise, the default world will not be created</p>\n</div>\n<p>Execute on the command line:</p>\n<Tabs :data='[{\"title\":\"Windows\",\"value\":\"windows\"},{\"title\":\"Linux\",\"value\":\"linux\"}]' tab-id=\"operator\">\n<template #tab0=\"{ title, value, isActive }\">\n<div><pre><code><span># Enter the minetest application directory</span>\n> cd minetest-edu\n<span># Start the server with the specified game world (course): default</span>\n> bin\\minetest<span>.</span>exe <span>--</span>server <span>--</span>worldname default\n</code></pre><div aria-hidden=\"true\"><div></div><div></div><div></div><div></div></div></div><p><img src=\"@source/en/guide/teacher/imgs/win_minetestsrv_run.gif\" alt=\"win minetest server run\" /></p>\n</template>\n<template #tab1=\"{ title, value, isActive }\">\n<div><pre><code><span># Enter the minetest application directory</span>\n$ <span>cd</span> minetest-edu\n<span># Start the server with the specified game world (course): default</span>\n$ bin/minetestserver --worldname default\n</code></pre><div aria-hidden=\"true\"><div></div><div></div><div></div><div></div></div></div></template>\n</Tabs>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "List of chat (server) commands",
      "url": "https://edu.ihom.app/en/guide/teacher/commands.html",
      "id": "https://edu.ihom.app/en/guide/teacher/commands.html",
      "content_html": "<h2 id=\"built-in-commands\" tabindex=\"-1\"> Built-in commands</h2>\n<p>Whether you have mods or games installed, builtin commands are always available.</p>\n<h3 id=\"help\" tabindex=\"-1\"> <code>/help</code></h3>\n<p>A short document showing the list of chat commands or privileges; it will also appear in the chat history, if the help document is too long and cannot be displayed in the chat history, you can press the <code>F10</code> key to open the terminal to view.</p>\n<div>\n<p>Tips</p>\n<p>You can display historical commands through the up and down arrows</p>\n</div>\n<ul>\n<li><code>/help</code>: display a list of available commands according to the permissions on the server</li>\n<li><code>/help &lt;command&gt;</code>: Display a short description about the given command. View help for a command even if you don't have permission to execute it</li>\n<li><code>/help all</code>: list the commands available on the server according to your permissions, with a short description and syntax reference for each command</li>\n<li><code>/help privs</code>: List all privileges that may be granted to the player on the server, and display a short description about each</li>\n</ul>\n<h3 id=\"grant-revoke-permission-command\" tabindex=\"-1\"> grant/revoke permission command</h3>\n<p>All of these commands require you to have &quot;<code>privs</code>&quot; (manipulate all privileges) or &quot;<code>basic_privs</code>&quot; (manipulate &quot;<code>interact</code>&quot; and &quot;<code>shout</code>&quot; privileges) privileges.</p>\n<ul>\n<li><code>/grant &lt;player&gt; &lt;privilege&gt;</code> - grant <code>&lt;privilege&gt;</code> to <code>&lt;player&gt;</code></li>\n<li><code>/grant &lt;player&gt; all</code> — grant all available privileges to <code>&lt;player&gt;</code></li>\n<li><code>/grantme &lt;privilege&gt;</code> - Grant yourself <code>&lt;privilege&gt;</code></li>\n<li><code>/grantme all</code> — Grant all privileges to yourself</li>\n<li><code>/revoke &lt;player&gt; &lt;privilege&gt;</code> — remove from</li>\n<li><code>/revoke &lt;player&gt; all</code> - remove all permissions from <code>&lt;player&gt;</code></li>\n<li><code>/revokeme &lt;privilege&gt;</code> - remove own <code>&lt;privilege&gt;</code> permission</li>\n<li><code>/revokeme all</code> - remove all permissions from self</li>\n</ul>\n<h3 id=\"privs-view-player-permissions-command\" tabindex=\"-1\"> <code>/privs</code> View player permissions command</h3>\n<ul>\n<li><code>/privs [&lt;player&gt;]</code>: Display a list of privileges for a player (<code>&lt;player&gt;</code>), or your own if no player is specified</li>\n</ul>\n<h3 id=\"haspriv-list-online-players-with-specified-permissions\" tabindex=\"-1\"> <code>/haspriv</code> list online players with specified permissions</h3>\n<ul>\n<li><code>/haspriv &lt;privilege&gt;</code>: List all online players with the specified privilege (<code>&lt;privilege&gt;</code>)</li>\n</ul>\n<h3 id=\"last-login-date-and-time-of-last-login-to-this-server\" tabindex=\"-1\"> <code>/last-login</code> Date and time of last login to this server</h3>\n<ul>\n<li><code>/last-login [&lt;player&gt;]</code>: Displays the date and time when player <code>&lt;player&gt;</code> last logged in to this server timezone (<a href=\"https://en.wikipedia.org/wiki/Coordinated_Universal_Time\" target=\"_blank\" rel=\"noopener noreferrer\">UTC timezone</a> , <a href=\"https://en.wikipedia.org/wiki/ISO_8601\" target=\"_blank\" rel=\"noopener noreferrer\">ISO 8601</a> format). If no player is specified, displays your own last login time</li>\n</ul>\n<h3 id=\"chat\" tabindex=\"-1\"> Chat</h3>\n<p>These commands require the &quot;<code>shout</code>&quot; privilege to work.</p>\n<h4 id=\"msg-private-chat-command\" tabindex=\"-1\"> <code>/msg</code> private chat command</h4>\n<ul>\n<li><code>/msg &lt;player&gt; &lt;message&gt;</code>: Send a direct message <code>&lt;message&gt;</code> to the specified player <code>&lt;player&gt;</code>; other players cannot see it.</li>\n</ul>\n<div>\n<p>Note</p>\n<p>The message sent by <code>/msg</code> isn't really a secret. Anyone intercepting network traffic, server operators can in principle still read</p>\n</div>\n<h4 id=\"me\" tabindex=\"-1\"> <code>/me</code></h4>\n<ul>\n<li><code>/me &lt;action&gt;</code> - Make text in the format &quot;<code>* &lt;your name&gt; &lt;action&gt;</code>&quot; to appear in the chat log. For example, &quot;<code>/me eats pizza.</code>&quot; will become &quot;<code>* Alfred eats pizza.</code>&quot; (if your player name is &quot;Alfred&quot;), and this conversion is done for you.</li>\n</ul>\n<h3 id=\"items\" tabindex=\"-1\"> Items</h3>\n<h4 id=\"give-和-giveme-give-item-command\" tabindex=\"-1\"> <code>/give</code> 和 <code>/giveme</code> give item command</h4>\n<ul>\n<li><code>/give &lt;player&gt; &lt;itemstring&gt; [&lt;count&gt; [&lt;wear&gt;]]</code>: Give the player <code>&lt;player&gt;</code> the specified number of <code>&lt;count&gt;</code> (default is 1) items <code>&lt;itemstring&gt;</code>( Refer to <a href=\"./item-string\">ItemStrings</a>). The <code>&lt;wear&gt;</code> parameter is the damage degree of the specified tool (0-65535, the larger the value, the greater the damage, the default value is 0), if it is other items, this value is useless , requires the &quot;give&quot; privilege.</li>\n<li><code>/giveme &lt;itemstring&gt; [&lt;count&gt; [&lt;wear&gt;]]</code>: Give me something. <code>&lt;count&gt;</code> and <code>&lt;wear&gt;</code> have the same meaning as <code>/give</code>. The &quot;give&quot; privilege is required.</li>\n</ul>\n<div>\n<p>Note</p>\n<p>Executing this command requires the &quot;<code>give</code>&quot; privilege</p>\n</div>\n<p>example</p>\n<ul>\n<li><code>/giveme default:torch</code>: give you a torch</li>\n<li><code>/give Peter default:cobble 50</code>: Give player: <code>Peter</code> 50 cobblestones</li>\n<li><code>/giveme default:pick_steel 1 16383</code>: Gives you an iron pickaxe with about 25% wear</li>\n</ul>\n<div>\n<p>Tips</p>\n<p>Negative numbers for <code>&lt;count&gt;</code> and <code>&lt;wear&gt;</code> will count down from 65536, so you can use -1 as a shorthand for 65535 (the maximum possible value).</p>\n</div>\n<h4 id=\"pulverize-destroy-items\" tabindex=\"-1\"> <code>/pulverize</code> destroy items</h4>\n<ul>\n<li><code>/pulverize</code>: Destroy the held item. Can be used by any player</li>\n</ul>\n<h4 id=\"clearinv-destroy-all-items-in-inventory\" tabindex=\"-1\"> <code>/clearinv</code> Destroy all items in inventory</h4>\n<ul>\n<li><code>/clearinv [&lt;name&gt;]</code>: Destroys all items in inventory (no arguments supplied) or in someone else's inventory (<code>name</code> supplied). To clear someone else's inventory, you need &quot;<code>Server</code>&quot; permission</li>\n</ul>\n<h3 id=\"teleport-command\" tabindex=\"-1\"> Teleport command</h3>\n<p>Teleportation is the immediate movement of any player to a given location. All of the following commands require the &quot;<code>teleport</code>&quot; privilege</p>\n<ul>\n<li><code>/teleport &lt;x&gt;,&lt;y&gt;,&lt;z&gt;</code>: Teleport yourself to the given <a href=\"/en/guide/teacher/coordinates/\">coordinates</a></li>\n<li><code>/teleport &lt;target_player&gt;</code>: Teleport yourself to the player named <code>&lt;target_player&gt;</code></li>\n<li><code>/teleport &lt;player&gt; &lt;x&gt;,&lt;y&gt;,&lt;z&gt;</code>: Teleport <code>&lt;player&gt;</code> to the given coordinates. Also requires the &quot;<code>bring</code>&quot; privilege</li>\n<li><code>/teleport &lt;player1&gt; &lt;player2&gt;</code>: Teleport player <code>&lt;player1&gt;</code> to <code>&lt;player2&gt;</code>. Also requires the &quot;<code>bring</code>&quot; privilege</li>\n</ul>\n<h3 id=\"kill-kill-player-or-self\" tabindex=\"-1\"> <code>/kill</code> kill player or self</h3>\n<ul>\n<li><code>/kill [&lt;name&gt;]</code> : kill player or self. Requires &quot;<code>server</code>&quot; privilege</li>\n</ul>\n<h3 id=\"password\" tabindex=\"-1\"> Password</h3>\n<p>These commands allow setting and resetting any player's password and require the &quot;<code>password</code>&quot; privilege to use</p>\n<ul>\n<li><code>/setpassword &lt;player&gt; &lt;password&gt;</code>: set the password of the player <code>&lt;player&gt;</code> to <code>&lt;password&gt;</code></li>\n<li><code>/clearpassword &lt;player&gt;</code>: set the password of the player <code>&lt;player&gt;</code> to empty</li>\n</ul>\n<h3 id=\"banned-or-kicked-player-from-server\" tabindex=\"-1\"> Banned or kicked player from server</h3>\n<p>These commands allow the user to kick, ban and unban players. Kicking a player means removing a connected player from the server. This requires the &quot;<code>kick</code>&quot; privilege. Banning a player prevents him/her from connecting to the server again. Players do not need to connect at this time. Unban means to unban a player, allowing him/her to connect to the server again. The <code>ban</code> and <code>unban</code> commands require the &quot;<code>ban</code>&quot; privilege.</p>\n<ul>\n<li><code>/kick &lt;player name&gt; [&lt;reason&gt;]</code>: kick player <code>&lt;player name&gt;</code>. The reason <code>&lt;reason&gt;</code> can optionally be provided in text form, this text will also be displayed to the kicked player.</li>\n<li><code>/ban</code>: show list of banned players</li>\n<li><code>/ban &lt;player name&gt;</code>: Ban bans the IP of the player <code>&lt;player name&gt;</code></li>\n<li><code>/unban &lt;player name&gt;</code>: unban player</li>\n<li><code>/unban &lt;IP address&gt;</code>: Unban the player IP</li>\n</ul>\n<h3 id=\"server-information\" tabindex=\"-1\"> Server information</h3>\n<p>Request some information from the server; the response information from the server will also be written to the chat history.</p>\n<ul>\n<li><code>/admin</code>: View the player name of the admin/server operator of the server you are connected to.</li>\n<li><code>/status</code>: View the server's Minetest version, how long in seconds the server has been running (called &quot;uptime&quot;), the list of connected players and <code>[messages]</code> for <code>[day]</code> (if exist).</li>\n<li><code>/mods</code>: View the list of mods installed on the server.</li>\n<li><code>/days</code>: View the current game date (counting from 0)</li>\n<li><code>/time</code>: View the current game time (24-hour format)</li>\n</ul>\n<h3 id=\"world-operation\" tabindex=\"-1\"> World operation</h3>\n<ul>\n<li><code>/time &lt;hours&gt;:&lt;minutes&gt;</code>: Set the &quot;time&quot; of the &quot;day&quot; in the game in 24-hour format (0:00-23:59). Requires &quot;<code>settime</code>&quot; privilege</li>\n<li><code>/time &lt;time_of_day&gt;</code>: Set the time of day to a number between 0 and 24000. Requires &quot;<code>settime</code>&quot; privilege</li>\n<li><code>/set -n time_speed &lt;speed&gt;</code>: Set the speed at which the game world time runs [day/night cycle], where <code>&lt;speed&gt;</code> is the speed of time (&quot;<code>&lt;speed&gt;</code> time is faster than in real life quick&quot;). The default value is <code>72</code>, which means that by default, the day and night cycle lasts 20 minutes. Requires &quot;<code>server</code>&quot; privilege</li>\n<li><code>/spawnentity &lt;entity&gt; [&lt;X&gt;,&lt;Y&gt;,&lt;Z&gt;]</code>: Spawn the name of an entity <code>&lt;entity&gt;</code> (see <a href=\"https://wiki.minetest.net/List_of_entity_names\" target=\"_blank\" rel=\"noopener noreferrer\">list of entity names</a>) near the location or in X, Y, Z coordinates, if specified. Requires &quot;give&quot; and &quot;interact&quot; privilege.</li>\n</ul>\n<h3 id=\"killme-suicide\" tabindex=\"-1\"> <code>/killme</code> suicide</h3>\n<ul>\n<li><code>/killme</code> suicide</li>\n</ul>\n<h3 id=\"settings-return-home-spawn-point\" tabindex=\"-1\"> Settings/Return home (spawn point)</h3>\n<ul>\n<li><code>/sethome</code> — Set current location as home location (&quot;spawn&quot;). Requires &quot;<code>home</code>&quot; privilege</li>\n<li><code>/home</code> - Teleport yourself to the &quot;home&quot; location. If the home point has not been set, this command will not work, please execute <code>/sethome</code> to set the birth point first. Requires &quot;<code>sethome</code>&quot; privilege.</li>\n</ul>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "Coordinate",
      "url": "https://edu.ihom.app/en/guide/teacher/coordinates.html",
      "id": "https://edu.ihom.app/en/guide/teacher/coordinates.html",
      "content_html": "<p>The minetest game world is a giant cube. Because of this, a location in the world can easily be represented in Cartesian coordinates. That is, for every location in the world, it can be represented by: X, Y, and Z.</p>\n<h2 id=\"expression\" tabindex=\"-1\"> Expression</h2>\n<p>The coordinates are represented as follows: <code>(5, 45, -12)</code></p>\n<p>This refers to the position of X=5, Y=45, Z=-12. These three letters are called &quot;axis&quot;: Y stands for height. X and Z are for horizontal position.</p>\n<div>\n<p>World borders</p>\n<p><a href=\"./coordinates\">X,Y,Z</a> maximum <a href=\"./coordinates\">coordinates</a> values are: −30912 to 30927 = 61840</p>\n<p>The space size is <code>61840x61840x61840</code>, if a square is 1 cubic meter, then it is 2.36487637504×10<sup>14</sup> cubic meters.\nMaximum area: 61840x61840 = 3,824,185,600 m<sup>2</sup> ≈ 3824 square kilometers (about half the size of Shanghai).</p>\n</div>\n<h2 id=\"direction\" tabindex=\"-1\"> Direction</h2>\n<p>The X, Y, and Z values are as follows:</p>\n<ul>\n<li>If you go up, Y increases (Up)</li>\n<li>If you go down, Y decreases (Down)</li>\n<li>If you follow the sun, X will increase (East)</li>\n<li>If you go in the opposite direction, X will decrease (West)</li>\n<li>Look in the direction of the sun, then turn 90° left and walk forward: Z increases (North)</li>\n<li>Look in the direction of the sun, then turn right 90° and walk forward: Z decreases (South)</li>\n<li>The side length of a complete square is: 1</li>\n</ul>\n<p><img src=\"@source/en/guide/teacher/imgs/xyz.gif\" alt=\"XYZ\" /></p>\n<h2 id=\"view-your-coordinates-debug-screen\" tabindex=\"-1\"> View your coordinates (debug screen)</h2>\n<p>You can view your coordinates by opening the debug screen (press <code>F5</code> to open), the top of the screen displays the debug information, and the number after <code>Pos:</code> on the second line is your coordinates.</p>\n<p><img src=\"@source/en/guide/teacher/imgs/your_coordinate.jpg\" alt=\"your_coordinate\" /></p>\n<p><img src=\"@source/en/guide/teacher/imgs/debug_screen.jpg\" alt=\"debug screen\" /></p>\n<p>Normally the game/server allows this, or you have &quot;<code>debug</code>&quot; permissions.</p>\n<p>By default the game does give you access to the coordinates in the debug screen, so that works most of the time.</p>\n<p>But some games may choose to hide the coordinates in the debug screen from normal players. Maybe you should &quot;earn&quot; the right to see the coordinates (like using a special item), or maybe the coordinates are hidden entirely to make the game more difficult. However, if you have &quot;debug&quot; privilege, you are guaranteed access.</p>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "In-game management",
      "url": "https://edu.ihom.app/en/guide/teacher/ingame-man.html",
      "id": "https://edu.ihom.app/en/guide/teacher/ingame-man.html",
      "content_html": "<p>In-game via chat commands:</p>\n<ul>\n<li>Can manage players and player permissions;</li>\n<li>Many mods can also be managed in-game by providing new chat commands and new permissions</li>\n</ul>\n<p>To use chat commands for management, you must first obtain the corresponding permissions</p>\n<h2 id=\"chat-command\" tabindex=\"-1\"> Chat command</h2>\n<p>In-game management is carried out through <code>chat commands</code> (also known as <code>server commands</code>). As the name implies, <code>chat commands</code> are entered in the chat window, for example, you can use the <code>/privs</code> command to view your own permissions.</p>\n<p>Unless otherwise noted, the commands in this article assume that no privileges are required.</p>\n<h3 id=\"send-command\" tabindex=\"-1\"> Send command</h3>\n<p>To send commands in the game, you only need to open the chat window and type commands like other chat messages. Any player can enter commands through chat to perform certain operations.</p>\n<div>\n<p>Note</p>\n<p>Some commands only work if you have granted the user <code>privileges</code> on the server.</p>\n</div>\n<div>\n<p>How to open the chat form</p>\n<Tabs :data='[{\"title\":\"PC/Computer\",\"value\":\"pc\"},{\"title\":\"Android Phone/Tablet\",\"value\":\"mobile\"}]' tab-id=\"operator\">\n<template #tab0=\"{ title, value, isActive }\">\n<ul>\n<li>Press <code>T</code> : Open the chat window, finish typing, press <code>Enter</code> key to send, <code>ESC</code> to cancel.</li>\n<li>Press <code>/</code> : Open the chat window, where the <code>/</code> character has been typed for you, you can directly enter the chat command, press the <code>Enter</code> key to send, <code>ESC</code> to cancel.</li>\n</ul>\n</template>\n<template #tab1=\"{ title, value, isActive }\">\n<ul>\n<li>Click on the <strong>Function Menu</strong> on the left (three vertical dots) <img src=\"@source/en/guide/get-started/imgs/three-dot.png\" alt=\"three dot\" />:\n<ul>\n<li>Click on the <code>Chat Bubble</code> icon <img src=\"@source/en/guide/get-started/imgs/chat.png\" alt=\"chat\" /> - open the chat window, then when finished typing, press <code>Enter</code> to send.</li>\n</ul>\n</li>\n</ul>\n<p><img src=\"@source/en/guide/get-started/imgs/minetest_android_keys.webp\" alt=\"minetest_android\" /></p>\n</template>\n</Tabs>\n</div>\n<p>All commands start with &quot;<code>/</code>&quot;. After that, a word (command) follows, followed by parameters. The number of parameters depends on the specific command, but there are conventions: the parameters in <code>&lt;&gt;</code> indicate necessary parameters, and the parameters in <code>[]</code> indicate that they can be omitted.</p>\n<div>\n<p>All commands start with \"`/`\" character</p>\n<p>So normal chat messages cannot start with &quot;<code>/</code>&quot;, they will be interpreted as commands even if such commands don't exist.</p>\n<p>You can tell whether the command was successful by the server's response. If you see <code>Invalid command: /blargh</code> in chat, you may have misspelled the command.\nIf the command is executed successfully, the command will return the result in the chat history or display the form.</p>\n</div>\n<p>As an administrator, you also have no special permissions at the beginning, but you can obtain all permissions at any time by executing the <code>/grantme all</code> command to facilitate subsequent operations.</p>\n<h2 id=\"built-in-privileges\" tabindex=\"-1\"> built-in privileges</h2>\n<div>\n<p>show all privileges</p>\n<p>All privileges (including those added by the mod) can be obtained through the chat command <code>/help privs</code></p>\n</div>\n<p>Listed below is the <code>Minetest_Game</code> sub-game, the list of built-in permissions</p>\n<table>\n<thead>\n<tr>\n<th>Permissions</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>interact</code></td>\n<td>Whether to allow interaction with game items (digging, placing, opening/closing...), the default is allowed</td>\n</tr>\n<tr>\n<td><code>shout</code></td>\n<td>Whether to allow to chat with other people, the default is to allow</td>\n</tr>\n<tr>\n<td><code>fly</code></td>\n<td>Whether to allow the player to activate airplane mode</td>\n</tr>\n<tr>\n<td><code>fast</code></td>\n<td>Whether to allow players to activate fast mode</td>\n</tr>\n<tr>\n<td><code>noclip</code></td>\n<td>Whether to allow the player to activate the wall mode</td>\n</tr>\n<tr>\n<td><code>settime</code></td>\n<td>Whether to allow the player to set the time in the game world</td>\n</tr>\n<tr>\n<td><code>home</code></td>\n<td>Whether to allow the player to set a home location</td>\n</tr>\n<tr>\n<td><code>settime</code></td>\n<td>Whether to allow the player to change the time</td>\n</tr>\n<tr>\n<td><code>teleport</code></td>\n<td>You can use the <code>/teleport</code> command to teleport yourself to the specified <a href=\"/en/guide/teacher/coordinates.html\">coordinates</a> or to another player</td>\n</tr>\n<tr>\n<td><code>bring</code></td>\n<td>When enabled together with the <code>teleport</code> permission, it is possible to use the <code>/teleport</code> command to teleport any player to a specific coordinate or to another player</td>\n</tr>\n<tr>\n<td><code>give</code></td>\n<td>Whether to allow to get items, the default is allowed in creative mode, and the default is not allowed in survival mode</td>\n</tr>\n<tr>\n<td><code>protection_bypass</code></td>\n<td>Whether to allow bypassing the block's protection (e.g. can open locked chests or doors for everyone)</td>\n</tr>\n<tr>\n<td><code>privs</code></td>\n<td><code>admin permissions</code>, if allowed you can use <code>/grant</code> and <code>/revoke</code> to set any privileges for the player</td>\n</tr>\n<tr>\n<td><code>basic_privs</code></td>\n<td><code>Administrative Privileges</code>, whether <code>/grant</code> and <code>/revoke</code> are allowed to set the list of basic privileges defined in the <code>minetest.conf</code> configuration file (default: &quot;<code>interact</code>&quot; and &quot;<code>shout </code>&quot; permissions)</td>\n</tr>\n<tr>\n<td><code>kick</code></td>\n<td><code>administrative authority</code>, is it allowed to kick players</td>\n</tr>\n<tr>\n<td><code>ban</code></td>\n<td><code>administrative authority</code>, whether to allow banning/unblocking players or IPs</td>\n</tr>\n<tr>\n<td><code>password</code></td>\n<td><code>Admin Authority</code>, whether to allow modifying or resetting player passwords</td>\n</tr>\n<tr>\n<td><code>server</code></td>\n<td><code>administrative authority</code>, perform a series of server maintenance operations</td>\n</tr>\n</tbody>\n</table>\n<div>\n<p>Notice</p>\n<p>If there is no special description in the list, the default is not allowed</p>\n</div>\n<h2 id=\"mod-privileges-and-commands\" tabindex=\"-1\"> Mod privileges and Commands</h2>\n<p>Each module will add privileges and commands according to its own functions</p>\n<h3 id=\"quiz-mod\" tabindex=\"-1\"> Quiz Mod</h3>\n<p>The game time management and interspersed practice in the game are also realized through the function module [Quiz player challenge] (../mods/quiz).</p>\n<p><a href=\"../mods/quiz\">Quiz player challenge mod</a> permissions (the following permissions exist when the <code>quiz</code> module is enabled)</p>\n<ul>\n<li><code>quiz</code>: Whether to allow quiz management: add, delete, modify questions</li>\n<li><code>noquiz</code>: whether to allow no quiz</li>\n</ul>\n<p>For more detailed management instructions, please read the mod description: <a href=\"../mods/quiz\">Quiz Player Challenge Mod</a></p>\n<h2 id=\"internal-commands\" tabindex=\"-1\"> Internal Commands</h2>\n<p>Common commands are as follows, for a more complete list of commands, please refer to: <a href=\"/en/guide/teacher/commands.html\">Chat (Server) Command List</a></p>\n<h3 id=\"help\" tabindex=\"-1\"> <code>/help</code></h3>\n<ul>\n<li><code>/help</code>: Display a list of available commands according to permissions on the server</li>\n</ul>\n<div>\n<p>Commands added by the mod will also appear in this list</p>\n</div>\n<h3 id=\"grant-revoke-privileges-command\" tabindex=\"-1\"> Grant/revoke privileges command</h3>\n<p>All of these commands require you to have &quot;<code>privs</code>&quot; (manipulate all privileges) or &quot;<code>basic_privs</code>&quot; (manipulate &quot;<code>interact</code>&quot; and &quot;<code>shout</code>&quot; privileges) privileges.</p>\n<ul>\n<li><code>/grant &lt;player&gt; &lt;privilege&gt;</code> - grant <code>&lt;privilege&gt;</code> to <code>&lt;player&gt;</code></li>\n<li><code>/grant &lt;player&gt; all</code> — grant all available privileges to <code>&lt;player&gt;</code></li>\n<li><code>/grantme &lt;privilege&gt;</code> - Grant yourself <code>&lt;privilege&gt;</code></li>\n<li><code>/grantme all</code> — Grant all privileges to yourself</li>\n<li><code>/revoke &lt;player&gt; &lt;privilege&gt;</code> — remove from</li>\n<li><code>/revoke &lt;player&gt; all</code> - remove all permissions from <code>&lt;player&gt;</code></li>\n<li><code>/revokeme &lt;privilege&gt;</code> - remove own <code>&lt;privilege&gt;</code> permission</li>\n<li><code>/revokeme all</code> - remove all permissions from self</li>\n</ul>\n<h3 id=\"privs-view-player-privileges-command\" tabindex=\"-1\"> <code>/privs</code> View player privileges command</h3>\n<ul>\n<li><code>/privs [&lt;player&gt;]</code>: Displays a list of privileges for a player (<code>&lt;player&gt;</code>), or your own if no player is specified</li>\n</ul>\n<h3 id=\"chat\" tabindex=\"-1\"> Chat</h3>\n<p>These commands require the &quot;<code>shout</code>&quot; privilege to work.</p>\n<h4 id=\"msg-private-chat-command\" tabindex=\"-1\"> <code>/msg</code> private chat command</h4>\n<ul>\n<li><code>/msg &lt;player&gt; &lt;message&gt;</code>: Send a direct message <code>&lt;message&gt;</code> to the specified player <code>&lt;player&gt;</code>; other players cannot see it.</li>\n</ul>\n<div>\n<p>Note</p>\n<p>The message sent by <code>/msg</code> isn't really a secret. Anyone intercepting network traffic, server operators can in principle still read</p>\n</div>\n<h3 id=\"items\" tabindex=\"-1\"> Items</h3>\n<h4 id=\"give-和-giveme-give-item-command\" tabindex=\"-1\"> <code>/give</code> 和 <code>/giveme</code> give item command</h4>\n<ul>\n<li><code>/give &lt;player&gt; &lt;itemstring&gt; [&lt;count&gt; [&lt;wear&gt;]]</code>: Give the player <code>&lt;player&gt;</code> the specified number of <code>&lt;count&gt;</code> (default is 1) items <code>&lt;itemstring&gt;</code>( Refer to <a href=\"./item-string\">ItemStrings</a>). The <code>&lt;wear&gt;</code> parameter is the damage degree of the specified tool (0-65535, the larger the value, the greater the damage, the default value is 0), if it is other items, this value is useless , requires the &quot;give&quot; privilege.</li>\n<li><code>/giveme &lt;itemstring&gt; [&lt;count&gt; [&lt;wear&gt;]]</code>: Give me something. <code>&lt;count&gt;</code> and <code>&lt;wear&gt;</code> have the same meaning as <code>/give</code>. The &quot;give&quot; privilege is required.</li>\n</ul>\n<div>\n<p>Note</p>\n<p>Executing this command requires the &quot;<code>give</code>&quot; privilege</p>\n</div>\n<p>example</p>\n<ul>\n<li><code>/giveme default:torch</code>: give you a torch</li>\n<li><code>/give Peter default:cobble 50</code>: Give player: <code>Peter</code> 50 cobblestones</li>\n<li><code>/giveme default:pick_steel 1 16383</code>: Gives you an iron pickaxe with about 25% wear</li>\n</ul>\n<div>\n<p>Tips</p>\n<p>Negative numbers for <code>&lt;count&gt;</code> and <code>&lt;wear&gt;</code> will count down from 65536, so you can use -1 as a shorthand for 65535 (the maximum possible value).</p>\n</div>\n<h3 id=\"teleport-command\" tabindex=\"-1\"> Teleport command</h3>\n<p>Teleportation is the immediate movement of any player to a given location. All of the following commands require the &quot;<code>teleport</code>&quot; privilege</p>\n<ul>\n<li><code>/teleport &lt;x&gt;,&lt;y&gt;,&lt;z&gt;</code>: Teleport yourself to the given <a href=\"/en/guide/teacher/coordinates/\">coordinates</a></li>\n<li><code>/teleport &lt;target_player&gt;</code>: Teleport yourself to the player named <code>&lt;target_player&gt;</code></li>\n<li><code>/teleport &lt;player&gt; &lt;x&gt;,&lt;y&gt;,&lt;z&gt;</code>: Teleport <code>&lt;player&gt;</code> to the given coordinates. Also requires the &quot;<code>bring</code>&quot; privilege</li>\n<li><code>/teleport &lt;player1&gt; &lt;player2&gt;</code>: Teleport player <code>&lt;player1&gt;</code> to <code>&lt;player2&gt;</code>. Also requires the &quot;<code>bring</code>&quot; privilege</li>\n</ul>\n<h3 id=\"kill-kill-player-or-self\" tabindex=\"-1\"> <code>/kill</code> kill player or self</h3>\n<ul>\n<li><code>/kill [&lt;name&gt;]</code> : kill player or self. Requires &quot;<code>server</code>&quot; privilege</li>\n</ul>\n<h3 id=\"password\" tabindex=\"-1\"> Password</h3>\n<p>These commands allow setting and resetting any player's password and require the &quot;<code>password</code>&quot; privilege to use</p>\n<ul>\n<li><code>/setpassword &lt;player&gt; &lt;password&gt;</code>: set the password of the player <code>&lt;player&gt;</code> to <code>&lt;password&gt;</code></li>\n<li><code>/clearpassword &lt;player&gt;</code>: set the password of the player <code>&lt;player&gt;</code> to empty</li>\n</ul>\n<h3 id=\"banned-or-kicked-player-from-server\" tabindex=\"-1\"> Banned or kicked player from server</h3>\n<p>These commands allow the user to kick, ban and unban players. Kicking a player means removing a connected player from the server. This requires the &quot;<code>kick</code>&quot; privilege. Banning a player prevents him/her from connecting to the server again. Players do not need to connect at this time. Unban means to unban a player, allowing him/her to connect to the server again. The <code>ban</code> and <code>unban</code> commands require the &quot;<code>ban</code>&quot; privilege.</p>\n<ul>\n<li><code>/kick &lt;player name&gt; [&lt;reason&gt;]</code>: kick player <code>&lt;player name&gt;</code>. The reason <code>&lt;reason&gt;</code> can optionally be provided in text form, this text will also be displayed to the kicked player.</li>\n<li><code>/ban</code>: show list of banned players</li>\n<li><code>/ban &lt;player name&gt;</code>: Ban bans the IP of the player <code>&lt;player name&gt;</code></li>\n<li><code>/unban &lt;player name&gt;</code>: unban player</li>\n<li><code>/unban &lt;IP address&gt;</code>: Unban the player IP</li>\n</ul>\n<h3 id=\"game-world-date-and-time\" tabindex=\"-1\"> Game world date and time</h3>\n<ul>\n<li><code>/days</code>: View the number of days of the current game (counting from 0)</li>\n<li><code>/time</code>: View the current game time (24-hour format)</li>\n</ul>\n<h3 id=\"adjust-the-time-and-speed-of-the-game-world\" tabindex=\"-1\"> Adjust the time and speed of the game world</h3>\n<ul>\n<li><code>/time &lt;hours&gt;:&lt;minutes&gt;</code>: Set the &quot;time&quot; of the &quot;day&quot; in the game in 24-hour format (0:00-23:59). Requires &quot;<code>settime</code>&quot; privilege</li>\n<li><code>/set -n time_speed &lt;speed&gt;</code>: Set the speed of the game world time running [day/night cycle], where <code>&lt;speed&gt;</code> is the speed multiple of time (<code>&lt;speed&gt;</code> time is faster than in real life quick). The default value is <code>72</code>, which means that by default, the world time in the game is 72 times faster than the real time, that is, 20 minutes is a day (24 hours). Requires &quot;<code>server</code>&quot; privilege</li>\n</ul>\n<h3 id=\"killme-kill-command\" tabindex=\"-1\"> <code>/killme</code> kill command</h3>\n<ul>\n<li><code>/killme</code> kill command</li>\n</ul>\n<h3 id=\"set-return-home-spawn-point\" tabindex=\"-1\"> Set / return home (spawn point)</h3>\n<ul>\n<li><code>/sethome</code> : Set current location as home location (&quot;spawn&quot;). Requires &quot;<code>home</code>&quot; privilege</li>\n<li><code>/home</code> : Teleport yourself to the &quot;home&quot; location. If the home point has not been set, this command will not work, please execute <code>/sethome</code> to set the birth point first. Requires &quot;<code>sethome</code>&quot; privilege.</li>\n</ul>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "Item Internal Name (ItemStrings)",
      "url": "https://edu.ihom.app/en/guide/teacher/item-string.html",
      "id": "https://edu.ihom.app/en/guide/teacher/item-string.html",
      "content_html": "<p><code>Itemstrings</code> are the internal names of items.</p>\n<h2 id=\"grammar\" tabindex=\"-1\"> Grammar</h2>\n<p>The general item internal name string is composed of the mod name of the item source + &quot;:&quot; + the actual name of the item.</p>\n<div>\n<p>Note</p>\n<p>All item names are case sensitive.</p>\n</div>\n<div><pre><code>&lt;mod_name>:&lt;item_name>\n</code></pre><div aria-hidden=\"true\"><div></div></div></div><p>example:</p>\n<ul>\n<li><code>default:torch</code> — a torch (from mod “default”)</li>\n<li><code>default:dirt</code> — dirt (from mod “default”)</li>\n<li><code>farming:bread</code> — bread (from mod “farming”)</li>\n<li><code>wool:orange</code> — orange wool (from mod “wool”)</li>\n<li><code>screwdriver:screwdriver</code> — screwdriver (from mod “screwdriver”)</li>\n</ul>\n<p>There are also some special item names that don't follow the above rules.</p>\n<h2 id=\"special-item-name\" tabindex=\"-1\"> Special item name</h2>\n<ul>\n<li>air</li>\n<li>ignore: Used internally to indicate invisible, not yet loaded(unloaded).</li>\n</ul>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "Out-of-game management",
      "url": "https://edu.ihom.app/en/guide/teacher/outgame-man.html",
      "id": "https://edu.ihom.app/en/guide/teacher/outgame-man.html",
      "content_html": "<p>Here parents or teachers can manage the content of children's game courses and host multiplayer games.</p>\n<p>After running, click &quot;teacher mode&quot;, enter the password and enter the management interface.</p>\n<p><img src=\"@source/imgs/pc-stu.png\" alt=\"pc\" /></p>\n<p>The management interface has 6 tabs.</p>\n<ol>\n<li>Teacher mode</li>\n<li>Start the game/host the game: manage the game world (course) and enable mods here</li>\n<li>Join the game</li>\n<li>Contents (installed mod management)</li>\n<li>Settings</li>\n<li>about</li>\n</ol>\n<h3 id=\"teacher-model\" tabindex=\"-1\"> teacher model</h3>\n<p>Click on the first tab page is &quot;Teacher Mode&quot;.</p>\n<p><img src=\"@source/en/guide/teacher/imgs/teacher-mode.jpg\" alt=\"teacher-mode\" /></p>\n<ul>\n<li><code>Teacher login name</code>: Add/modify teacher login name, only English (half-width) characters</li>\n<li><code>Password</code>: Modify the teacher's login password.</li>\n<li><code>Server Address</code>: To play a multiplayer game, you must enter the IP address of the server you want to connect to. For details on setting up the server, see the following: [Start the game/host the game](#Start the game-host the game)</li>\n<li><code>Port</code>: multiplayer game server port (default port, generally do not need to be changed)</li>\n<li><code>Allow single-player games</code>: Check the button that appears on the student game interface: <code>Start (single-player) game</code></li>\n<li><code>Allow Remote Game</code>: Check it to appear on the student game interface: <code>Start (multiplayer) game</code> button, you must first configure <code>Server Address</code>.</li>\n<li><code>Language</code>: Quickly set the language to use, leave blank by default to use the system language, and it will take effect after restarting.</li>\n<li><code>Save</code> button: After modifying the above teacher configuration, you must click Save to take effect.</li>\n<li><code>Student Mode</code> button: click to return to student mode.</li>\n</ul>\n<h3 id=\"start-game-host-game\" tabindex=\"-1\"> Start Game/Host Game</h3>\n<p>Click on the second tab is &quot;Launch Game&quot;. Here you can manage the game world (course) and enable mods.</p>\n<p>At the bottom is the <code>sub-game icon list</code>, click on the icon to switch the used sub-game</p>\n<p><img src=\"@source/en/guide/teacher/imgs/teacher-start-game.jpg\" alt=\"teacher start game\" /></p>\n<ul>\n<li><code>Creative Mode</code>: Check it to enable <code>Creative Mode</code> for the selected world, otherwise it is <code>Survival Mode</code></li>\n<li><code>Enable damage</code>: whether to enable damage</li>\n<li><code>Build Server</code>: After checking, the machine will run as a server at the same time, and the &quot;Start Game&quot; button on the right will change to &quot;Host Game&quot;.</li>\n<li><code>Public Server</code>: Whether to publish the server address to the Internet, only when <code>Build Server</code> is selected, it will appear</li>\n<li><code>Select World</code>: On the right side, you can choose the game world you want to run, here you can think that each world is a course.\n<ul>\n<li>[New](#New World): Create a new game world (course)</li>\n<li>[Select Mod](#Select mod): Select the appropriate function module (Mod) for the current game world (course)</li>\n<li><code>delete</code>: delete the currently selected game world (lesson)</li>\n</ul>\n</li>\n</ul>\n<p><img src=\"@source/en/guide/teacher/imgs/teacher-host-game.jpg\" alt=\"teacher-host-game\" /></p>\n<div>\n<p>Note</p>\n<p>If the <code>host game</code> exits the game, then the native game service will also stop.</p>\n</div>\n<p>After creating the server, you can tell the server's local IP address to the client who wants to connect.\nThen the client enters the local IP address in the <code>Server Address</code> under the <code>Teacher Mode</code> tab page.\nRemember that the client and the machine that created the server must be on the same network (with a WIFI router)!</p>\n<div>\n<p>Check the local IP address</p>\n<p>Generally, we can use the <code>IP address</code> of <code>IPv4</code>.</p>\n<Tabs :data='[{\"title\":\"Windows 10\",\"value\":\"windows\"},{\"title\":\"Android Phone/Tablet\",\"value\":\"android\"},{\"title\":\"Linux\",\"value\":\"linux\"}]' tab-id=\"operator\">\n<template #tab0=\"{ title, value, isActive }\">\n<ul>\n<li>Wireless (<code>WLAN</code>) connections\n<ol>\n<li>Click on the Wifi icon on the far right of the taskbar, select <code>WLAN Network</code> &gt; and then click on &quot;Properties&quot; under the connected <code>Wi-Fi Network</code></li>\n<li>Under Properties, look for the IP address listed next to <code>IPv4 Address</code>.</li>\n</ol>\n</li>\n<li>Wired network connection\n<ol>\n<li>On the taskbar, select the Ethernet Network icon &gt; Ethernet Network Connections</li>\n<li>Under &quot;Ethernet&quot; select the Ethernet network connection</li>\n<li>Under Properties, look for the IP address listed next to IPv4 Address</li>\n</ol>\n</li>\n</ul>\n\n<p><img src=\"@source/en/guide/win10_ip_addr.gif\" alt=\"Win10 IP\" /></p>\n</template>\n<template #tab1=\"{ title, value, isActive }\">\n<ol>\n<li>Pull down from the top status bar and click on the 'configuration button' icon in the upper right corner</li>\n<li>Click Wireless Network (<code>WLAN</code>)</li>\n<li>Click the <code>exclamation mark</code> icon on the right of the current wireless network (connected): open the detailed information of the network</li>\n<li>You can see the <code>IPv4 address</code> of the machine</li>\n</ol>\n\n<p><img src=\"@source/en/guide/android_ip_addr.gif\" alt=\"Android IP\" /></p>\n</template>\n<template #tab2=\"{ title, value, isActive }\">\n<p>Press the <code>Ctrl+Alt+T</code> three keys at the same time to open the terminal window, enter <code>ip a</code>, and press the <code>Enter</code> key.</p>\n<div><pre><code><span>$ip</span> a\n<span>1</span>: lo: <span>&lt;</span>LOOPBACK,UP,LOWER_UP<span>></span> mtu <span>65536</span> qdisc noqueue state UNKNOWN group default qlen <span>1000</span>\n    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\n    inet <span>127.0</span>.0.1/8 scope <span>host</span> lo\n       valid_lft forever preferred_lft forever\n    inet6 ::1/128 scope <span>host</span>\n       valid_lft forever preferred_lft forever\n<span>2</span>: enp7s0: <span>&lt;</span>BROADCAST,MULTICAST,UP,LOWER_UP<span>></span> mtu <span>1500</span> qdisc mq state UP group default qlen <span>1000</span>\n    link/ether 00:02:00:1d:a8:a2 brd ff:ff:ff:ff:ff:ff\n    inet <span>192.168</span>.0.3/24 brd <span>192.168</span>.0.255 scope global dynamic noprefixroute enp7s0\n       valid_lft 456sec preferred_lft 456sec\n    inet6 fe80::f903:6672:206e:1f83/64 scope <span>link</span> noprefixroute\n       valid_lft forever preferred_lft forever\n<span>3</span>: wlp8s0: <span>&lt;</span>BROADCAST,MULTICAST<span>></span> mtu <span>1500</span> qdisc noop state DOWN group default qlen <span>1000</span>\n    link/ether <span>10</span>:10:18:17:51:0f brd ff:ff:ff:ff:ff:ff\n</code></pre><div aria-hidden=\"true\"><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div></div></div><ul>\n<li>&quot;en&quot; starts with a wired network, and &quot;wlp&quot; starts with a wireless network.</li>\n<li><code>state DOWN</code> means the network is disabled. <code>state UP</code> means the network is enabled.</li>\n<li><code>inet</code> is <code>IP address</code> of <code>IPv4</code>, <code>inet6</code> is <code>IP address</code> of <code>IPv6</code></li>\n</ul>\n</template>\n</Tabs>\n</div>\n<p>:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::</p>\n<h4 id=\"new-world\" tabindex=\"-1\"> New World</h4>\n<p>Click the <code>New</code> button to create a new game world (course). A game world (course) is a large map generated by a specific map generator using an algorithm.</p>\n<ul>\n<li><code>World Name</code>: <strong>required</strong>, give the newly created world a name, it will be used as the folder name of the world, and placed in the <code>worlds</code> directory.</li>\n<li><code>Seed</code>: <strong>Optional</strong>, if not filled in, a seed value will be randomly generated automatically, the same seed and the same map generator will generate the same world.</li>\n<li><code>Map Generator</code>: <strong>required</strong>, in addition to controlling the appearance of the map terrain and generating building structures, the map generator (Map Generator) will also have an ecosystem (biological community). In addition to <code>v6</code> In all map generators except , these ecosystems (biomes) can be defined by mods using the <code>Biome API</code>, in other words, enabled features mods may drastically alter them. The <code>v6</code> map generator is special in that its biomes are completely predefined and cannot be easily changed.</li>\n</ul>\n<p><img src=\"@source/en/guide/teacher/imgs/v7mapgen.jpg\" alt=\"v7 map generator\" /></p>\n<div>\n<p>Create a new world for a subgame</p>\n<p>Click the sub-game icon list at the bottom, select the sub-game first, and then click the &quot;New&quot; world button</p>\n</div>\n<h5 id=\"map-world-generator\" tabindex=\"-1\"> Map(World) generator</h5>\n<div>\n<p>Important Hint</p>\n<p><code>v5</code> and <code>v6</code> are not legacy map generators. &quot;<code>v5</code>&quot;, &quot;<code>v6</code>&quot;, and &quot;<code>v7</code>&quot; are names, not version numbers. All map generators (mapgen) included in Minetest are officially supported and updated.</p>\n</div>\n<ul>\n<li><code>v5</code> map generator: Although it emphasizes authenticity, v5 sometimes runs out of extreme terrain, such as super deep sea and super deep caves. unrealistic but interesting landscapes, often with floating specks and extreme terrain overhangs,\n<ul>\n<li><img src=\"@source/en/guide/teacher/imgs/mapgen_v5.jpg\" alt=\"mapgen_v5\" /></li>\n</ul>\n</li>\n<li><code>v6</code> map generator: simple hills, cliffs and plateaus, fairly flat and small-scale map generator, no terrain overhangs, pre-defined biomes, cannot be changed easily\n<ul>\n<li><img src=\"@source/en/guide/teacher/imgs/mapgen_v6.jpg\" alt=\"mapgen_v6\" /></li>\n</ul>\n</li>\n<li><code>v7</code> map generator: It is the latest map generator of <code>Minetest 5.6</code>, with rich terrain, often with vast ecosystem terrain, very wide landscape, overhanging mountains and distant plains . Rivers appear at near sea level, can be customized by mods using the <code>Biome API</code>\n<ul>\n<li><img src=\"@source/en/guide/teacher/imgs/v7map.jpg\" alt=\"v7 map\" /></li>\n</ul>\n</li>\n<li><code>carpathian</code> Carpathian Mountains map generator: complex and realistic mountains with many variants, sometimes reaching extremely high heights, separated by oceans and deep low plains\n<ul>\n<li><img src=\"@source/en/guide/teacher/imgs/mapgen_carpathian.jpg\" alt=\"mapgen_carpathian\" /></li>\n</ul>\n</li>\n<li><code>valleys</code> valley map generator: In addition to generating general ecosystems and caves, it will also generate valleys and rivers. The shape of the mountain is more natural and tends to have different ecosystems depending on the altitude. Maps will often see high mountains and winding rivers. Interestingly, these rivers have height differences, and they will go down like real-world rivers. The special water block <code>river water</code> was also introduced for this purpose.\n<ul>\n<li><img src=\"@source/en/guide/teacher/imgs/mapgen_valleys2.jpg\" alt=\"mapgen_valleys\" /></li>\n</ul>\n</li>\n<li><code>flat</code> map generator: a completely flat world, mainly flat terrain, you can check the options to generate caves, cellars, decorations, hills and lakes. have biomes\n<ul>\n<li><img src=\"@source/en/guide/teacher/imgs/flatmapgen.jpg\" alt=\"flatmapgen\" /></li>\n<li><img src=\"@source/en/guide/teacher/imgs/flatmap.jpg\" alt=\"flat map\" /></li>\n</ul>\n</li>\n<li><code>fractal</code> fractal map generator: maps are based on a fractal of your choice; highly configurable\n<ul>\n<li><img src=\"@source/en/guide/teacher/imgs/apgen_fractals.jpg\" alt=\"apgen_fractals\" /></li>\n</ul>\n</li>\n<li><code>singlenode</code>Single node map generator: generate a blank world, nothing, only air, use <a href=\"/en/guide/mods/\">mod</a> or subgame to determine the appearance of terrain generation</li>\n</ul>\n<h6 id=\"build-structures-map-generator\" tabindex=\"-1\"> Build Structures (Map Generator)</h6>\n<ul>\n<li>\n<p><code>caves</code>: Caves can be found underground</p>\n<ul>\n<li>Caves can range from very small to very complex systems of interconnected tunnels</li>\n<li>Cave entrances can usually be found on the surface.</li>\n<li>Cave styles produced by different map generators vary widely.</li>\n</ul>\n<Tabs :data='[{\"title\":\"Cave\"},{\"title\":\"Underground Lake\"},{\"title\":\"Underground Lava Lake\"}]' tab-id=\"construct\">\n<template #tab0=\"{ title, value, isActive }\">\n<p><img src=\"@source/en/guide/teacher/imgs/cave.jpg\" alt=\"cave\" /></p>\n</template>\n<template #tab1=\"{ title, value, isActive }\">\n<p><img src=\"@source/en/guide/teacher/imgs/cave_water.jpg\" alt=\"cave_water\" /></p>\n</template>\n<template #tab2=\"{ title, value, isActive }\">\n<p><img src=\"@source/en/guide/teacher/imgs/cave_lava.jpg\" alt=\"cave_lava\" /></p>\n</template>\n</Tabs>\n</li>\n<li>\n<p><code>Dungeons</code> are the most common building structures that contain treasure chests. There are currently cobblestone cellars, desert cellars, sandstone cellars, and sometimes the entrances are exposed to the surface.</p>\n<Tabs :data='[{\"title\":\"Cobblestone dungeon\",\"value\":\"Cobblestone\"},{\"title\":\"Desert stone dungeon\",\"value\":\"Desert\"},{\"title\":\"Sandstone dungeon\",\"value\":\"Sandstone\"}]' tab-id=\"construct\">\n<template #tab0=\"{ title, value, isActive }\">\n<p><img src=\"@source/en/guide/teacher/imgs/cobbles-dungeon.jpg\" alt=\"cobbles-dungeon\" /></p>\n</template>\n<template #tab1=\"{ title, value, isActive }\">\n<p><img src=\"@source/en/guide/teacher/imgs/desertstone_dungeon.jpg\" alt=\"desert stone dungeon\" /></p>\n</template>\n<template #tab2=\"{ title, value, isActive }\">\n<p><img src=\"@source/en/guide/teacher/imgs/sandstone_dungeon.jpg\" alt=\"sandstone_dungeon\" /></p>\n</template>\n</Tabs>\n</li>\n<li>\n<p>Decorations: Decorations are additional structures that modules place on top of surfaces. Ornaments can be small plants such as grass, flowers, cacti, or even entire trees or buildings.\nThe <code>v6 map generator</code> is an exception here, as normal trees, apple trees, jungle trees, pine trees, and jungle grass are generated by the map generator itself and are not considered decorations and thus are not affected by this setting. But <a href=\"/en/guide/mods/\">mods</a> can still add extra decorations on top of this.</p>\n</li>\n<li>\n<p><code>large caverns</code>: This enables the creation of caverns with very large spaces. They usually have no lava or water in or near them.</p>\n<ul>\n<li><img src=\"@source/en/guide/teacher/imgs/caverns.jpg\" alt=\"caverns\" /></li>\n</ul>\n</li>\n<li>\n<p><code>Rivers (ridges)</code>: Rivers split terrain, sometimes forming canyon-like terrain. Sometimes it may make sense to disable these rivers since they can make the resulting terrain very difficult to navigate.</p>\n<ul>\n<li><img src=\"@source/en/guide/teacher/imgs/river.jpg\" alt=\"river\" /></li>\n</ul>\n</li>\n<li>\n<p><code>mountains(mountains)</code>: mountains</p>\n<ul>\n<li><img src=\"@source/en/guide/teacher/imgs/mountain.jpg\" alt=\"mountain\" /></li>\n</ul>\n</li>\n<li>\n<p><code>floatlands</code>: If <code>floatlands</code> is turned on, it will start to generate at <a href=\"./coordinates\">height (Y)</a>&gt;1280.</p>\n<ul>\n<li><img src=\"@source/en/guide/teacher/imgs/floatland2.jpg\" alt=\"floatland\" /></li>\n</ul>\n</li>\n</ul>\n<div>\n<p>World borders</p>\n<p><a href=\"./coordinates\">X,Y,Z</a> maximum <a href=\"./coordinates\">coordinates</a> values are: −30912 to 30927 = 61840</p>\n<p>The space size is <code>61840x61840x61840</code>, if a square is 1 cubic meter, then it is 2.36487637504×10<sup>14</sup> cubic meters.\nMaximum area: 61840x61840 = 3,824,185,600 m<sup>2</sup> ≈ 3824 square kilometers (about half the size of Shanghai).</p>\n</div>\n<h4 id=\"select-mod\" tabindex=\"-1\"> Select Mod</h4>\n<p>Click the &quot;Select Mod&quot; button to open the mod list dialog</p>\n<p>The right side of the module list dialog box is the module list, and the left side is the detailed description of the selected module</p>\n<p><img src=\"@source/en/guide/teacher/imgs/teacher-select-mod.jpg\" alt=\"teacher-select-mod\" /></p>\n<div>\n<p>Tips</p>\n<ul>\n<li>If you are on an Android phone or tablet, you need to drag the scroll bar on the right side of the list to scroll the list items.</li>\n<li>Tick the module item that turns green, which means it is enabled, and the item in white font means it is not enabled</li>\n<li>Mod items with a plus sign (<code>+</code>) in front of them are represented as ModPacks, click the plus sign (<code>+</code>) to expand and view the mod items</li>\n<li>Directly double-click on the module item to switch whether to enable it, or click to select a module item, click the <code>Enable</code> selection box above to switch</li>\n<li>Generally do not click <code>Enable All</code>, because there will be conflicts between some modules</li>\n<li>After selecting the module, remember to click the <code>Save button</code> to exit; click the <code>Cancel button</code> to give up changing the module.</li>\n</ul>\n</div>\n<h3 id=\"join-game\" tabindex=\"-1\"> Join Game</h3>\n<p>Here you can join a multiplayer game as a teacher.</p>\n<div>\n<p>Joining the server for the first time</p>\n<p>After entering the server address and account name, you must click the Register button to register the account first.</p>\n</div>\n<p><img src=\"@source/en/guide/teacher/imgs/teacher-join-game.jpg\" alt=\"teacher-join-game\" /></p>\n<div>\n<p>Note</p>\n<p>In the future there should be a public course world server dedicated to education</p>\n</div>\n<h3 id=\"content\" tabindex=\"-1\"> Content</h3>\n<p>Installed content is managed here.</p>\n<div>\n<p>content font color meaning</p>\n<ul>\n<li>🫐The blue font is the sub-game content</li>\n<li>💚The green font is the content of the texture pack</li>\n<li>🤍The gray font is the content of [Mod Pack](./README.md#Basic Concept)</li>\n<li><span style=\"color:white\">■</span> The white font is the mod content</li>\n</ul>\n</div>\n<p><img src=\"@source/en/guide/teacher/imgs/teacher-content.jpg\" alt=\"teacher-content\" /></p>\n<ul>\n<li><code>Browse Online Content</code> button: You can browse and install online content</li>\n<li><code>Delete package</code> button: delete the selected local installation content</li>\n<li><code>Use texture pack</code> button: After selecting the content of the texture pack in green font on the left, click this button</li>\n</ul>\n<h3 id=\"configuration\" tabindex=\"-1\"> Configuration</h3>\n<p>Set according to the capabilities of the computer/mobile phone/tablet.</p>\n<p><img src=\"@source/en/guide/teacher/imgs/teacher-config.jpg\" alt=\"teacher-config\" /></p>\n<ul>\n<li>If the machine configuration is very low, you can turn off <code>3D Clouds</code> and <code>Smooth Lighting</code>, select <code>Simple Leaves</code> for leaves, disable all material options in the middle, and only keep <code>Shader</code> for the options on the right, and disable all others;</li>\n<li>If it is a medium machine configuration, you can turn on the rightmost option, and the middle material option can turn on &quot;<code>Mip map</code>&quot; to try it out, and the right option can be tried by yourself;</li>\n<li>If the machine configuration is high, it can be set casually;</li>\n<li>Note: After enabling <code>Dynamic Shadows</code> option, sub-game support is also required</li>\n</ul>\n<p>Click the &quot;All Settings&quot; button to modify all advanced configurations including sub-games and mods</p>\n<p><img src=\"@source/en/guide/teacher/imgs/all_settings.jpg\" alt=\"all settings\" /></p>\n<p>Click the &quot;Change key settings&quot; button to modify the keyboard binding control settings</p>\n<p><a href=\"/en/guide/get-started/pc.html#Change_keys_binding\"><img src=\"@source/en/guide/get-started/imgs/keys.jpg\" alt=\"keys\" /></a></p>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": [
        "Guide",
        "Parent/Teacher"
      ]
    },
    {
      "title": "CodeBlock - Programming",
      "url": "https://edu.ihom.app/en/guide/mods/codeblock/",
      "id": "https://edu.ihom.app/en/guide/mods/codeblock/",
      "content_html": "<ul>\n<li><strong>Author</strong>: gigaturbo <a href=\"mailto:gigaturbo@protonmail.com\">gigaturbo@protonmail.com</a>\n<strong>Credits:</strong> inspired by <a href=\"http://gnancraft.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Gnancraft</a>, <a href=\"http://www.computercraft.info/\" target=\"_blank\" rel=\"noopener noreferrer\">ComputerCraft</a>, <a href=\"https://content.minetest.net/packages/Nigel/vbots/\" target=\"_blank\" rel=\"noopener noreferrer\">Visual Bots</a>, <a href=\"https://content.minetest.net/packages/BirgitLachner/turtleminer/\" target=\"_blank\" rel=\"noopener noreferrer\">TurtleMiner</a>, <a href=\"https://github.com/ac-minetest/basic_robot\" target=\"_blank\" rel=\"noopener noreferrer\">basic_robot</a></li>\n</ul>\n<div>\n<p>Tips</p>\n<p>Before using this mod, remember to confirm that the mod has been enabled.</p>\n</div>\n<p>CodeBlock allows in-game lua code to build anything you want.</p>\n<p><img src=\"@source/en/guide/mods/codeblock/screenshot.jpg\" alt=\"screenshot\" /></p>\n<div>\n<p>Tips</p>\n<p>Search for <code>code</code> in the item bar, you can find the <img src=\"@source/en/guide/mods/codeblock/dp.png\" alt=\"run\" /> block and <img src=\"@source/en/guide/mods/codeblock/ds.png\" alt=\"write\" /> block in creative mode (or have <code>give</code> permission) Click on the square to get it.\nCurrently, since there is no formula for making blocks, they can only be given by parents in survival mode.</p>\n</div>\n<p><img src=\"@source/en/guide/mods/codeblock/ds.png\" alt=\"Writing\" /> is the box for writing code, and the code editor can be opened by right-clicking on the mouse (double-clicking on the right operating area for Android).</p>\n<p>For first time use, you can use the chat command <code>/codegenerate</code> to get some example code.</p>\n<div>\n<p>Tips</p>\n<p>How to send chat commands, please refer to &quot;<a href=\"/en/teacher/ingame-man/\">In-Game Management: Send Commands</a>&quot;.</p>\n</div>\n<p><img src=\"@source/en/guide/mods/codeblock/code-new.jpg\" alt=\"code-new\" /></p>\n<p>Double-click on the file to open the corresponding code.</p>\n<p><img src=\"@source/en/guide/mods/codeblock/code-edit.jpg\" alt=\"code-edit\" /></p>\n<p>The last line added is to call the <code>line</code> function to draw a straight line with a length of 12 &quot;meters&quot; (the length of a block is agreed to be one meter in the game world). The material of the line is not specified and is random.</p>\n<p>Then click <code>Save</code> to save the code, then click <code>Load and Close</code> to load and close the editor.</p>\n<p>The <img src=\"@source/en/guide/mods/codeblock/dp.png\" alt=\"Run\" /> block is the run block, select the <img src=\"@source/en/guide/mods/codeblock/dp.png\" alt=\"Run\" /> block, then go to the place you want to build and place (right mouse button) to run![Run](. /dp.png) box, and then hit (the left mouse button) the run! <a href=\"./dp.png\">Run</a> box, you can.</p>\n<div>\n<p>Note</p>\n<p>When placing the Run<img src=\"@source/en/guide/mods/codeblock/dp.png\" alt=\"Run\" /> block, the direction you are facing is the direction in which to run.</p>\n</div>\n<p><img src=\"@source/en/guide/mods/codeblock/code-run-place.jpg\" alt=\"code-run-place\" /></p>\n<p><img src=\"@source/en/guide/mods/codeblock/code-run.jpg\" alt=\"code-run\" /></p>\n<p>Finally, after modifying this sentence, execute it again:</p>\n<div><pre><code><span>line</span><span>(</span>forward<span>,</span> <span>12</span><span>,</span> blocks<span>.</span>air<span>)</span>\n</code></pre><div aria-hidden=\"true\"><div></div></div></div>",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": [
        "Mod",
        "Builtin"
      ]
    },
    {
      "title": "Nickname",
      "url": "https://edu.ihom.app/en/guide/mods/nickname/",
      "id": "https://edu.ihom.app/en/guide/mods/nickname/",
      "content_html": "<ul>\n<li><strong>Author</strong>: Minetest:Education(Riceball LEE)</li>\n</ul>\n<div>\n<p>Tips</p>\n<p>Before using this mod, remember to confirm that the mod has been enabled.</p>\n</div>\n<p>Nickname mod allows to add a nickname (support unicode char) and nickname color to player in the game.</p>\n<p>You can set your nickname outside the gameplay:</p>\n<p><img src=\"@source/en/guide/mods/nickname/screenshot2.jpg\" alt=\"Nickname\" /></p>\n<p>Others can see your nickname and the name within parentheses in multi-player world:</p>\n<p><img src=\"@source/en/guide/mods/nickname/screenshot.jpg\" alt=\"Nickname in game\" /></p>\n<div>\n<p>Tips</p>\n<p>Specifying (modifying) a nickname requires the <code>nickname</code> permission, which can be granted to oneself through the chat command: <code>/grantme nickname</code>.\nOr authorize to a specific player: <code>/grant [player_login_name] nickname</code></p>\n</div>\n<div>\n<p>Tips</p>\n<p>How to send chat commands, please refer to &quot;<a href=\"/en/guide/teacher/ingame-man/\">In-Game Management: Send Commands</a>&quot;.</p>\n</div>\n<h2 id=\"chat-command\" tabindex=\"-1\"> Chat Command</h2>\n<p>After getting <code>nickname</code> permission, you can set nickname and color by sending chat commands.</p>\n<h3 id=\"set-or-get-nickname\" tabindex=\"-1\"> Set or get nickname</h3>\n<p><code>/nickname[ your_nickname[, player_name]]</code></p>\n<ul>\n<li>If you have <code>server</code> permissions, then you can specify nickname for other players (<code>player_name</code>)</li>\n<li>If you don't specify a nickname, your current nickname (if any) will be displayed.</li>\n<li>If a nickname is specified: <code>your_nickname</code>, then it is to set the nickname.</li>\n</ul>\n<h3 id=\"set-or-get-nickname-color\" tabindex=\"-1\"> Set or get nickname color</h3>\n<p><code>/nickname_color[ color[, player_name]]</code></p>\n<ul>\n<li>If you have <code>server</code> permissions, then you can specify nickname colors for other players (<code>player_name</code>)</li>\n<li>If no color is specified, then your current nickname color (if any) will be displayed.</li>\n<li>If the color: <code>color</code> is specified, then the nickname color is set.\n<ul>\n<li>For example, specify the nickname color red: <code>/nickname_color red</code></li>\n</ul>\n</li>\n</ul>\n<h3 id=\"set-or-get-nickname-background-color\" tabindex=\"-1\"> Set or get nickname background color</h3>\n<p><code>/nickname_bgcolor[ color[, player_name]]</code></p>\n<ul>\n<li>If you have <code>server</code> permissions, then you can specify nickname colors for other players (<code>player_name</code>)</li>\n<li>If you don't specify a background color, your current nickname background color (if any) will be displayed.</li>\n<li>If the background color: <code>color</code> is specified, then it is to set the nickname background color.</li>\n</ul>\n<h3 id=\"color-specification\" tabindex=\"-1\"> Color specification</h3>\n<ul>\n<li>Specify in the form of <code>RGB</code>red, green, and blue three-component. R: Red component; G: Green component; B: Blue component; A: Alpha transparency value\n<ul>\n<li><code>#RGB</code> Defines a color in hexadecimal format.</li>\n<li><code>#RGBA</code> Defines a color in hexadecimal format and alpha channel.</li>\n<li><code>#RRGGBB</code> Defines a color in hexadecimal format.</li>\n<li><code>#RRGGBBAA</code> Defines a color in hexadecimal format and alpha channel.</li>\n</ul>\n</li>\n<li>Specify by color name (see the table below for the name)\n<ul>\n<li>Support for named colors from <a href=\"https://www.w3.org/TR/css-color-4/#named-color\" target=\"_blank\" rel=\"noopener noreferrer\">CSS Color Module Level 4</a>.</li>\n<li>To specify a value for the <code>alpha channel</code>, append <code>#A</code> or <code>#AA</code> to the end of the color name (e.g. <code>red#08</code>).</li>\n</ul>\n</li>\n</ul>\n<table>\n<tbody><tr>\n<th align=\"left\" width=\"25%\">Color name</th>\n<th align=\"left\" width=\"15%\">HEX</th>\n<th align=\"left\" width=\"43%\">Color</th>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:AliceBlue\" bgcolor=\"grey\">AliceBlue&nbsp;</td>\n<td align=\"left\">#F0F8FF</td>\n<td bgcolor=\"#F0F8FF\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:AntiqueWhite\" bgcolor=\"grey\">AntiqueWhite&nbsp;</td>\n<td align=\"left\">#FAEBD7</td>\n<td bgcolor=\"#FAEBD7\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Aqua\" bgcolor=\"grey\">Aqua&nbsp;</td>\n<td align=\"left\">#00FFFF</td>\n<td bgcolor=\"#00FFFF\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Aquamarine\" bgcolor=\"grey\">Aquamarine&nbsp;</td>\n<td align=\"left\">#7FFFD4</td>\n<td bgcolor=\"#7FFFD4\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Azure\" bgcolor=\"grey\">Azure&nbsp;</td>\n<td align=\"left\">#F0FFFF</td>\n<td bgcolor=\"#F0FFFF\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Beige\" bgcolor=\"grey\">Beige&nbsp;</td>\n<td align=\"left\">#F5F5DC</td>\n<td bgcolor=\"#F5F5DC\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Bisque\" bgcolor=\"grey\">Bisque&nbsp;</td>\n<td align=\"left\">#FFE4C4</td>\n<td bgcolor=\"#FFE4C4\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Black\">Black&nbsp;</td>\n<td align=\"left\">#000000</td>\n<td bgcolor=\"#000000\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:BlanchedAlmond\" bgcolor=\"grey\">BlanchedAlmond&nbsp;</td>\n<td align=\"left\">#FFEBCD</td>\n<td bgcolor=\"#FFEBCD\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Blue\">Blue&nbsp;</td>\n<td align=\"left\">#0000FF</td>\n<td bgcolor=\"#0000FF\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:BlueViolet\">BlueViolet&nbsp;</td>\n<td align=\"left\">#8A2BE2</td>\n<td bgcolor=\"#8A2BE2\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Brown\">Brown&nbsp;</td>\n<td align=\"left\">#A52A2A</td>\n<td bgcolor=\"#A52A2A\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:BurlyWood\">BurlyWood&nbsp;</td>\n<td align=\"left\">#DEB887</td>\n<td bgcolor=\"#DEB887\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:CadetBlue\">CadetBlue&nbsp;</td>\n<td align=\"left\">#5F9EA0</td>\n<td bgcolor=\"#5F9EA0\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Chartreuse\">Chartreuse&nbsp;</td>\n<td align=\"left\">#7FFF00</td>\n<td bgcolor=\"#7FFF00\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Chocolate\">Chocolate&nbsp;</td>\n<td align=\"left\">#D2691E</td>\n<td bgcolor=\"#D2691E\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Coral\">Coral&nbsp;</td>\n<td align=\"left\">#FF7F50</td>\n<td bgcolor=\"#FF7F50\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:CornflowerBlue\">CornflowerBlue&nbsp;</td>\n<td align=\"left\">#6495ED</td>\n<td bgcolor=\"#6495ED\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Cornsilk\" bgcolor=\"grey\">Cornsilk&nbsp;</td>\n<td align=\"left\">#FFF8DC</td>\n<td bgcolor=\"#FFF8DC\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Crimson\">Crimson&nbsp;</td>\n<td align=\"left\">#DC143C</td>\n<td bgcolor=\"#DC143C\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Cyan\">Cyan&nbsp;</td>\n<td align=\"left\">#00FFFF</td>\n<td bgcolor=\"#00FFFF\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkBlue\">DarkBlue&nbsp;</td>\n<td align=\"left\">#00008B</td>\n<td bgcolor=\"#00008B\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkCyan\">DarkCyan&nbsp;</td>\n<td align=\"left\">#008B8B</td>\n<td bgcolor=\"#008B8B\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkGoldenRod\">DarkGoldenRod&nbsp;</td>\n<td align=\"left\">#B8860B</td>\n<td bgcolor=\"#B8860B\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkGray\">DarkGray&nbsp;</td>\n<td align=\"left\">#A9A9A9</td>\n<td bgcolor=\"#A9A9A9\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkGreen\">DarkGreen&nbsp;</td>\n<td align=\"left\">#006400</td>\n<td bgcolor=\"#006400\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkKhaki\">DarkKhaki&nbsp;</td>\n<td align=\"left\">#BDB76B</td>\n<td bgcolor=\"#BDB76B\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkMagenta\">DarkMagenta&nbsp;</td>\n<td align=\"left\">#8B008B</td>\n<td bgcolor=\"#8B008B\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkOliveGreen\">DarkOliveGreen&nbsp;</td>\n<td align=\"left\">#556B2F</td>\n<td bgcolor=\"#556B2F\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkOrange\">DarkOrange&nbsp;</td>\n<td align=\"left\">#FF8C00</td>\n<td bgcolor=\"#FF8C00\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkOrchid\">DarkOrchid&nbsp;</td>\n<td align=\"left\">#9932CC</td>\n<td bgcolor=\"#9932CC\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkRed\">DarkRed&nbsp;</td>\n<td align=\"left\">#8B0000</td>\n<td bgcolor=\"#8B0000\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkSalmon\">DarkSalmon&nbsp;</td>\n<td align=\"left\">#E9967A</td>\n<td bgcolor=\"#E9967A\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkSeaGreen\">DarkSeaGreen&nbsp;</td>\n<td align=\"left\">#8FBC8F</td>\n<td bgcolor=\"#8FBC8F\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkSlateBlue\">DarkSlateBlue&nbsp;</td>\n<td align=\"left\">#483D8B</td>\n<td bgcolor=\"#483D8B\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkSlateGray\">DarkSlateGray&nbsp;</td>\n<td align=\"left\">#2F4F4F</td>\n<td bgcolor=\"#2F4F4F\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkTurquoise\">DarkTurquoise&nbsp;</td>\n<td align=\"left\">#00CED1</td>\n<td bgcolor=\"#00CED1\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DarkViolet\">DarkViolet&nbsp;</td>\n<td align=\"left\">#9400D3</td>\n<td bgcolor=\"#9400D3\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DeepPink\">DeepPink&nbsp;</td>\n<td align=\"left\">#FF1493</td>\n<td bgcolor=\"#FF1493\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DeepSkyBlue\">DeepSkyBlue&nbsp;</td>\n<td align=\"left\">#00BFFF</td>\n<td bgcolor=\"#00BFFF\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DimGray\">DimGray&nbsp;</td>\n<td align=\"left\">#696969</td>\n<td bgcolor=\"#696969\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:DodgerBlue\">DodgerBlue&nbsp;</td>\n<td align=\"left\">#1E90FF</td>\n<td bgcolor=\"#1E90FF\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:FireBrick\">FireBrick&nbsp;</td>\n<td align=\"left\">#B22222</td>\n<td bgcolor=\"#B22222\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:FloralWhite\" bgcolor=\"grey\">FloralWhite&nbsp;</td>\n<td align=\"left\">#FFFAF0</td>\n<td bgcolor=\"#FFFAF0\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:ForestGreen\">ForestGreen&nbsp;</td>\n<td align=\"left\">#228B22</td>\n<td bgcolor=\"#228B22\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Fuchsia\">Fuchsia&nbsp;</td>\n<td align=\"left\">#FF00FF</td>\n<td bgcolor=\"#FF00FF\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Gainsboro\" bgcolor=\"grey\">Gainsboro&nbsp;</td>\n<td align=\"left\">#DCDCDC</td>\n<td bgcolor=\"#DCDCDC\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:GhostWhite\" bgcolor=\"grey\">GhostWhite&nbsp;</td>\n<td align=\"left\">#F8F8FF</td>\n<td bgcolor=\"#F8F8FF\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Gold\">Gold&nbsp;</td>\n<td align=\"left\">#FFD700</td>\n<td bgcolor=\"#FFD700\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:GoldenRod\">GoldenRod&nbsp;</td>\n<td align=\"left\">#DAA520</td>\n<td bgcolor=\"#DAA520\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Gray\">Gray&nbsp;</td>\n<td align=\"left\">#808080</td>\n<td bgcolor=\"#808080\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Green\">Green&nbsp;</td>\n<td align=\"left\">#008000</td>\n<td bgcolor=\"#008000\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:GreenYellow\">GreenYellow&nbsp;</td>\n<td align=\"left\">#ADFF2F</td>\n<td bgcolor=\"#ADFF2F\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:HoneyDew\" bgcolor=\"grey\">HoneyDew&nbsp;</td>\n<td align=\"left\">#F0FFF0</td>\n<td bgcolor=\"#F0FFF0\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:HotPink\">HotPink&nbsp;</td>\n<td align=\"left\">#FF69B4</td>\n<td bgcolor=\"#FF69B4\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:IndianRed \">IndianRed &nbsp;</td>\n<td align=\"left\">#CD5C5C</td>\n<td bgcolor=\"#CD5C5C\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Indigo  \">Indigo  &nbsp;</td>\n<td align=\"left\">#4B0082</td>\n<td bgcolor=\"#4B0082\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Ivory\" bgcolor=\"grey\">Ivory&nbsp;</td>\n<td align=\"left\">#FFFFF0</td>\n<td bgcolor=\"#FFFFF0\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Khaki\">Khaki&nbsp;</td>\n<td align=\"left\">#F0E68C</td>\n<td bgcolor=\"#F0E68C\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Lavender\" bgcolor=\"grey\">Lavender&nbsp;</td>\n<td align=\"left\">#E6E6FA</td>\n<td bgcolor=\"#E6E6FA\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LavenderBlush\" bgcolor=\"grey\">LavenderBlush&nbsp;</td>\n<td align=\"left\">#FFF0F5</td>\n<td bgcolor=\"#FFF0F5\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LawnGreen\">LawnGreen&nbsp;</td>\n<td align=\"left\">#7CFC00</td>\n<td bgcolor=\"#7CFC00\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LemonChiffon\" bgcolor=\"grey\">LemonChiffon&nbsp;</td>\n<td align=\"left\">#FFFACD</td>\n<td bgcolor=\"#FFFACD\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightBlue\">LightBlue&nbsp;</td>\n<td align=\"left\">#ADD8E6</td>\n<td bgcolor=\"#ADD8E6\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightCoral\">LightCoral&nbsp;</td>\n<td align=\"left\">#F08080</td>\n<td bgcolor=\"#F08080\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightCyan\" bgcolor=\"grey\">LightCyan&nbsp;</td>\n<td align=\"left\">#E0FFFF</td>\n<td bgcolor=\"#E0FFFF\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightGoldenRodYellow\" bgcolor=\"grey\">LightGoldenRodYellow&nbsp;</td>\n<td align=\"left\">#FAFAD2</td>\n<td bgcolor=\"#FAFAD2\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightGray\">LightGray&nbsp;</td>\n<td align=\"left\">#D3D3D3</td>\n<td bgcolor=\"#D3D3D3\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightGreen\">LightGreen&nbsp;</td>\n<td align=\"left\">#90EE90</td>\n<td bgcolor=\"#90EE90\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightPink\">LightPink&nbsp;</td>\n<td align=\"left\">#FFB6C1</td>\n<td bgcolor=\"#FFB6C1\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightSalmon\">LightSalmon&nbsp;</td>\n<td align=\"left\">#FFA07A</td>\n<td bgcolor=\"#FFA07A\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightSeaGreen\">LightSeaGreen&nbsp;</td>\n<td align=\"left\">#20B2AA</td>\n<td bgcolor=\"#20B2AA\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightSkyBlue\">LightSkyBlue&nbsp;</td>\n<td align=\"left\">#87CEFA</td>\n<td bgcolor=\"#87CEFA\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightSlateGray\">LightSlateGray&nbsp;</td>\n<td align=\"left\">#778899</td>\n<td bgcolor=\"#778899\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightSteelBlue\">LightSteelBlue&nbsp;</td>\n<td align=\"left\">#B0C4DE</td>\n<td bgcolor=\"#B0C4DE\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LightYellow\" bgcolor=\"grey\">LightYellow&nbsp;</td>\n<td align=\"left\">#FFFFE0</td>\n<td bgcolor=\"#FFFFE0\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Lime\">Lime&nbsp;</td>\n<td align=\"left\">#00FF00</td>\n<td bgcolor=\"#00FF00\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:LimeGreen\">LimeGreen&nbsp;</td>\n<td align=\"left\">#32CD32</td>\n<td bgcolor=\"#32CD32\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Linen\" bgcolor=\"grey\">Linen&nbsp;</td>\n<td align=\"left\">#FAF0E6</td>\n<td bgcolor=\"#FAF0E6\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Magenta\">Magenta&nbsp;</td>\n<td align=\"left\">#FF00FF</td>\n<td bgcolor=\"#FF00FF\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Maroon\">Maroon&nbsp;</td>\n<td align=\"left\">#800000</td>\n<td bgcolor=\"#800000\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:MediumAquaMarine\">MediumAquaMarine&nbsp;</td>\n<td align=\"left\">#66CDAA</td>\n<td bgcolor=\"#66CDAA\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:MediumBlue\">MediumBlue&nbsp;</td>\n<td align=\"left\">#0000CD</td>\n<td bgcolor=\"#0000CD\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:MediumOrchid\">MediumOrchid&nbsp;</td>\n<td align=\"left\">#BA55D3</td>\n<td bgcolor=\"#BA55D3\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:MediumPurple\">MediumPurple&nbsp;</td>\n<td align=\"left\">#9370DB</td>\n<td bgcolor=\"#9370DB\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:MediumSeaGreen\">MediumSeaGreen&nbsp;</td>\n<td align=\"left\">#3CB371</td>\n<td bgcolor=\"#3CB371\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:MediumSlateBlue\">MediumSlateBlue&nbsp;</td>\n<td align=\"left\">#7B68EE</td>\n<td bgcolor=\"#7B68EE\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:MediumSpringGreen\">MediumSpringGreen&nbsp;</td>\n<td align=\"left\">#00FA9A</td>\n<td bgcolor=\"#00FA9A\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:MediumTurquoise\">MediumTurquoise&nbsp;</td>\n<td align=\"left\">#48D1CC</td>\n<td bgcolor=\"#48D1CC\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:MediumVioletRed\">MediumVioletRed&nbsp;</td>\n<td align=\"left\">#C71585</td>\n<td bgcolor=\"#C71585\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:MidnightBlue\">MidnightBlue&nbsp;</td>\n<td align=\"left\">#191970</td>\n<td bgcolor=\"#191970\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:MintCream\" bgcolor=\"grey\">MintCream&nbsp;</td>\n<td align=\"left\">#F5FFFA</td>\n<td bgcolor=\"#F5FFFA\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:MistyRose\" bgcolor=\"grey\">MistyRose&nbsp;</td>\n<td align=\"left\">#FFE4E1</td>\n<td bgcolor=\"#FFE4E1\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Moccasin\" bgcolor=\"grey\">Moccasin&nbsp;</td>\n<td align=\"left\">#FFE4B5</td>\n<td bgcolor=\"#FFE4B5\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:NavajoWhite\" bgcolor=\"grey\">NavajoWhite&nbsp;</td>\n<td align=\"left\">#FFDEAD</td>\n<td bgcolor=\"#FFDEAD\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Navy\">Navy&nbsp;</td>\n<td align=\"left\">#000080</td>\n<td bgcolor=\"#000080\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:OldLace\" bgcolor=\"grey\">OldLace&nbsp;</td>\n<td align=\"left\">#FDF5E6</td>\n<td bgcolor=\"#FDF5E6\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Olive\">Olive&nbsp;</td>\n<td align=\"left\">#808000</td>\n<td bgcolor=\"#808000\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:OliveDrab\">OliveDrab&nbsp;</td>\n<td align=\"left\">#6B8E23</td>\n<td bgcolor=\"#6B8E23\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Orange\">Orange&nbsp;</td>\n<td align=\"left\">#FFA500</td>\n<td bgcolor=\"#FFA500\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:OrangeRed\">OrangeRed&nbsp;</td>\n<td align=\"left\">#FF4500</td>\n<td bgcolor=\"#FF4500\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Orchid\">Orchid&nbsp;</td>\n<td align=\"left\">#DA70D6</td>\n<td bgcolor=\"#DA70D6\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:PaleGoldenRod\" bgcolor=\"grey\">PaleGoldenRod&nbsp;</td>\n<td align=\"left\">#EEE8AA</td>\n<td bgcolor=\"#EEE8AA\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:PaleGreen\">PaleGreen&nbsp;</td>\n<td align=\"left\">#98FB98</td>\n<td bgcolor=\"#98FB98\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:PaleTurquoise\">PaleTurquoise&nbsp;</td>\n<td align=\"left\">#AFEEEE</td>\n<td bgcolor=\"#AFEEEE\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:PaleVioletRed\">PaleVioletRed&nbsp;</td>\n<td align=\"left\">#DB7093</td>\n<td bgcolor=\"#DB7093\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:PapayaWhip\" bgcolor=\"grey\">PapayaWhip&nbsp;</td>\n<td align=\"left\">#FFEFD5</td>\n<td bgcolor=\"#FFEFD5\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:PeachPuff\">PeachPuff&nbsp;</td>\n<td align=\"left\">#FFDAB9</td>\n<td bgcolor=\"#FFDAB9\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Peru\">Peru&nbsp;</td>\n<td align=\"left\">#CD853F</td>\n<td bgcolor=\"#CD853F\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Pink\">Pink&nbsp;</td>\n<td align=\"left\">#FFC0CB</td>\n<td bgcolor=\"#FFC0CB\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Plum\">Plum&nbsp;</td>\n<td align=\"left\">#DDA0DD</td>\n<td bgcolor=\"#DDA0DD\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:PowderBlue\">PowderBlue&nbsp;</td>\n<td align=\"left\">#B0E0E6</td>\n<td bgcolor=\"#B0E0E6\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Purple\">Purple&nbsp;</td>\n<td align=\"left\">#800080</td>\n<td bgcolor=\"#800080\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Red\">Red&nbsp;</td>\n<td align=\"left\">#FF0000</td>\n<td bgcolor=\"#FF0000\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:RosyBrown\">RosyBrown&nbsp;</td>\n<td align=\"left\">#BC8F8F</td>\n<td bgcolor=\"#BC8F8F\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:RoyalBlue\">RoyalBlue&nbsp;</td>\n<td align=\"left\">#4169E1</td>\n<td bgcolor=\"#4169E1\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:SaddleBrown\">SaddleBrown&nbsp;</td>\n<td align=\"left\">#8B4513</td>\n<td bgcolor=\"#8B4513\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Salmon\">Salmon&nbsp;</td>\n<td align=\"left\">#FA8072</td>\n<td bgcolor=\"#FA8072\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:SandyBrown\">SandyBrown&nbsp;</td>\n<td align=\"left\">#F4A460</td>\n<td bgcolor=\"#F4A460\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:SeaGreen\">SeaGreen&nbsp;</td>\n<td align=\"left\">#2E8B57</td>\n<td bgcolor=\"#2E8B57\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:SeaShell\" bgcolor=\"grey\">SeaShell&nbsp;</td>\n<td align=\"left\">#FFF5EE</td>\n<td bgcolor=\"#FFF5EE\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Sienna\">Sienna&nbsp;</td>\n<td align=\"left\">#A0522D</td>\n<td bgcolor=\"#A0522D\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Silver\">Silver&nbsp;</td>\n<td align=\"left\">#C0C0C0</td>\n<td bgcolor=\"#C0C0C0\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:SkyBlue\">SkyBlue&nbsp;</td>\n<td align=\"left\">#87CEEB</td>\n<td bgcolor=\"#87CEEB\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:SlateBlue\">SlateBlue&nbsp;</td>\n<td align=\"left\">#6A5ACD</td>\n<td bgcolor=\"#6A5ACD\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:SlateGray\">SlateGray&nbsp;</td>\n<td align=\"left\">#708090</td>\n<td bgcolor=\"#708090\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Snow\" bgcolor=\"grey\">Snow&nbsp;</td>\n<td align=\"left\">#FFFAFA</td>\n<td bgcolor=\"#FFFAFA\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:SpringGreen\">SpringGreen&nbsp;</td>\n<td align=\"left\">#00FF7F</td>\n<td bgcolor=\"#00FF7F\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:SteelBlue\">SteelBlue&nbsp;</td>\n<td align=\"left\">#4682B4</td>\n<td bgcolor=\"#4682B4\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Tan\">Tan&nbsp;</td>\n<td align=\"left\">#D2B48C</td>\n<td bgcolor=\"#D2B48C\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Teal\">Teal&nbsp;</td>\n<td align=\"left\">#008080</td>\n<td bgcolor=\"#008080\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Thistle\">Thistle&nbsp;</td>\n<td align=\"left\">#D8BFD8</td>\n<td bgcolor=\"#D8BFD8\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Tomato\">Tomato&nbsp;</td>\n<td align=\"left\">#FF6347</td>\n<td bgcolor=\"#FF6347\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Turquoise\">Turquoise&nbsp;</td>\n<td align=\"left\">#40E0D0</td>\n<td bgcolor=\"#40E0D0\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Violet\">Violet&nbsp;</td>\n<td align=\"left\">#EE82EE</td>\n<td bgcolor=\"#EE82EE\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Wheat\" bgcolor=\"grey\">Wheat&nbsp;</td>\n<td align=\"left\">#F5DEB3</td>\n<td bgcolor=\"#F5DEB3\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:White\" bgcolor=\"grey\">White&nbsp;</td>\n<td align=\"left\">#FFFFFF</td>\n<td bgcolor=\"#FFFFFF\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:WhiteSmoke\" bgcolor=\"grey\">WhiteSmoke&nbsp;</td>\n<td align=\"left\">#F5F5F5</td>\n<td bgcolor=\"#F5F5F5\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:Yellow\" bgcolor=\"grey\">Yellow&nbsp;</td>\n<td align=\"left\">#FFFF00</td>\n<td bgcolor=\"#FFFF00\">&nbsp;</td>\n</tr>\n<tr>\n<td align=\"left\" style=\"color:YellowGreen\">YellowGreen&nbsp;</td>\n<td align=\"left\">#9ACD32</td>\n<td bgcolor=\"#9ACD32\">&nbsp;</td>\n</tr>\n</tbody></table>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-07-07T22:57:16.000Z",
      "authors": [],
      "tags": [
        "Mod",
        "Builtin"
      ]
    },
    {
      "title": "Numeracy 数的模组",
      "url": "https://edu.ihom.app/en/guide/mods/numeracy/",
      "id": "https://edu.ihom.app/en/guide/mods/numeracy/",
      "content_html": "<ul>\n<li><strong>Author</strong>: James Hogan <a href=\"mailto:james@albanarts.com\">james@albanarts.com</a></li>\n</ul>\n<div>\n<p>Tips</p>\n<p>Before using this mod, remember to enable this mod first.</p>\n</div>\n<p>This mod adds a block for exploring arithmetic with kids that bond together and change appearance based on the number of blocks connected, the mod was developed with the inspiration of the children's TV show <a href=\"https://www.learningblocks.tv/\" target=\"_blank\" rel=\"noopener noreferrer\">Numberblocks</a>.</p>\n<p><img src=\"@source/en/guide/mods/numeracy/num-header.jpg\" alt=\"num-header\" /></p>\n<div>\n<p>Tips</p>\n<p>You can find the block by searching <code>numeracy</code> in the inventory, and you can get it by clicking on the block in creative mode (or with the <code>give</code> permission).\nCurrently, since there is no recipe for making this block, it can only be given by parents in survival mode.</p>\n</div>\n<p>Get &quot;Arithmetic Blocks&quot; from your inventory and start grouping them. Watch the appearance of the blocks change and the numbers above the blocks change.</p>\n<p><img src=\"@source/en/guide/mods/numeracy/numeracy-group.jpg\" alt=\"numeracy-group\" /></p>\n<p>Try to measure the distance between two places by placing a chain of blocks.</p>\n<p><img src=\"@source/en/guide/mods/numeracy/numeracy-length.jpg\" alt=\"numeracy-length\" /></p>\n<p>Measure the height.</p>\n<p><img src=\"@source/en/guide/mods/numeracy/numeracy-height.jpg\" alt=\"numeracy-height\" /></p>\n<p>Try to make as many different rectangles or other shapes as possible with the same number of blocks.</p>\n<p><img src=\"@source/en/guide/mods/numeracy/numeracy-shape.jpg\" alt=\"numeracy-shape\" /></p>\n<p>Try exploring natural number sequences, rectangles, squares, cubes, triangles (like stairs).</p>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": [
        "Mod",
        "Builtin"
      ]
    },
    {
      "title": "Quiz - Game Challenge",
      "url": "https://edu.ihom.app/en/guide/mods/quiz/",
      "id": "https://edu.ihom.app/en/guide/mods/quiz/",
      "content_html": "<ul>\n<li><strong>Author</strong>: Minetest:Education(Riceball LEE)</li>\n</ul>\n<p>In-game mods for game time management and interspersed practice between games.</p>\n<p>When the specified <code>game time (minutes)</code> is up, the players in the game will be kicked out of the game, and the game can only be continued after the <code>break time (minutes)</code> is reached.\nIn the game, a question will be raised every time the <code>question interval (minutes)</code> time is reached. Players must answer correctly to continue the game. Players who answer correctly will get reward items.</p>\n<p>To use this feature make sure the <code>quiz</code> and <code>quiz_ui</code> mods are enabled on the game world (course).</p>\n<div>\n<p>Tips</p>\n<p>The <code>quiz</code> permission is required to configure and manage the Quiz module, which can be given to oneself by the chat command: <code>/grantme quiz</code>.\nThen execute the <code>/quiz</code> chat command to enter the management interface (note that the <code>quiz_ui</code> module must be enabled at the same time for this course).</p>\n</div>\n<div>\n<p>Tips</p>\n<ul>\n<li>You can use the <code>noquiz</code> permission for the specified player, so that the player does not need to answer the question: <code>/grant &lt;player&gt; noquiz</code>.</li>\n<li>Revoke <code>noquiz</code> permission from player: <code>/revoke &lt;player&gt; noquiz</code></li>\n</ul>\n</div>\n<div>\n<p>Tips</p>\n<p>How to send chat commands, please refer to &quot;<a href=\"/en/guide/teacher/ingame-man/\">In-Game Management: Send Commands</a>&quot;.</p>\n</div>\n<h2 id=\"quiz-game-challenge-mod-players-answer-questions\" tabindex=\"-1\"> Quiz Game Challenge Mod: Players Answer Questions</h2>\n<p><img src=\"@source/en/guide/mods/quiz/quiz-start.jpg\" alt=\"Quiz Start\" /></p>\n<p>If the answer is wrong, the upper right corner of the screen will prompt:</p>\n<p><img src=\"@source/en/guide/mods/quiz/quiz-error.jpg\" alt=\"Quiz Error\" /></p>\n<p>If you answer the question correctly, you will get a award:</p>\n<p><img src=\"@source/en/guide/mods/quiz/quiz-award.jpg\" alt=\"quiz-award\" /></p>\n<h2 id=\"quiz-game-challenge-mod-management\" tabindex=\"-1\"> Quiz Game Challenge Mod Management</h2>\n<p>Then you can enter the chat command <code>/quiz</code>:</p>\n<p><img src=\"@source/en/guide/mods/quiz/quiz-cmd.jpg\" alt=\"type quiz cmd\" /></p>\n<p>Open the management interface, you can see that there are 4 tab pages</p>\n<p>The first tabbed page is <code>Challenge Questions List</code>:</p>\n<h3 id=\"quizzes\" tabindex=\"-1\"> Quizzes</h3>\n<p><img src=\"@source/en/guide/mods/quiz/quizzes.jpg\" alt=\"Quizzes\" /></p>\n<p>Here you can manage the test questions</p>\n<ul>\n<li>New: add a test</li>\n<li>Edit: Edit an existing test (need to select a test question first)</li>\n<li>Delete: delete the selected test</li>\n</ul>\n<div>\n<p>Note</p>\n<ul>\n<li><strong>Known Issues</strong>: Versions released before <a href=\"/en/download/\">minetest-5.6.1-edu-2d4c67fd6(2022-10-15)</a> input text on Windows systems, only Can use pure English input method, can not use any <strong>Unicode IME input method</strong> input, otherwise no text can be input. The latest version must be installed to use <strong>Unicode IME Input Method</strong>.</li>\n<li>If occasionally the IME input method cannot be called out, please click the window outside the input box (let the input box lose focus), and then switch back to the input box (click the input box again)</li>\n<li>BTW: It is normal to input unicode chars under <code>Android</code> and <code>Linux</code>(<code>Ubuntu</code>).</li>\n</ul>\n</div>\n<div>\n<p>Tips</p>\n<ul>\n<li>If you are using the Windows system, please directly edit the configuration file of the <code>quiz</code> mod in <code>mod_data</code> folder.</li>\n<li>The default configuration file is under <code>mods/quiz/config.yml</code>,</li>\n<li>In order to avoid the configuration file being overwritten when the component is updated, please copy the configuration file to the <code>mod_data/quiz/</code> directory for modification.</li>\n</ul>\n</div>\n<p><img src=\"@source/en/guide/mods/quiz/quiz-edit.jpg\" alt=\"Quiz\" /></p>\n<p>Question types are:</p>\n<ul>\n<li>Four operations: random four operations, the rules are in the answer\n<ul>\n<li>Title: <code>$calc</code> will be replaced by the four arithmetic problems</li>\n<li>Answer: It is the rules for making questions, and the rules are defined as follows:\n<ul>\n<li><code>n</code>: lowercase n means a random one-digit number (0-9)</li>\n<li><code>N</code>: capital N means a random non-zero one-digit number (1-9)</li>\n<li><code>[1-3]</code>: A single digit with a randomly specified range of numbers</li>\n<li><code>[+-]</code>: Randomly specify an arithmetic operator</li>\n<li><code>Note</code>, division can only be the last operation. The remainder is separated from the quotient by at least three dots<code>...</code>.</li>\n</ul>\n</li>\n<li>Force Integer (forceInt): For division, whether to force the result to be an integer.</li>\n</ul>\n</li>\n<li>Text: The answer is a question of text type\n<ul>\n<li>The answer supports <a href=\"https://www.lua.org/pil/20.2.html\" target=\"_blank\" rel=\"noopener noreferrer\">Lua character pattern matching</a>, if the answer is <code>pattern matching</code> string, then the answer must be wrapped with two <code>/</code>.</li>\n</ul>\n</li>\n<li>Numerical values: Answers to questions of numerical type</li>\n<li>Yes/No: Answers to <code>true</code>/<code>false</code> questions</li>\n<li>Multiple choice questions:\n<ul>\n<li>Options: Each line has an option</li>\n<li>Answer: It is the serial number of the option (starting from 1), if it is a multiple choice, the serial numbers are separated by commas, and there are no spaces in between.</li>\n</ul>\n</li>\n</ul>\n<p><img src=\"@source/en/guide/mods/quiz/quiz-select.jpg\" alt=\"quiz-select\" /></p>\n<div>\n<p>Tips</p>\n<p>Remember, you must click the <code>Confirm</code> button to save at the end. Click <code>Cancel</code> to abandon the modification and not save it to the file.</p>\n</div>\n<p>The second tab page is <code>Prize List</code>:</p>\n<h3 id=\"awards\" tabindex=\"-1\"> Awards</h3>\n<p><img src=\"@source/en/guide/mods/quiz/awards.jpg\" alt=\"awards\" /></p>\n<p>Here you can manage the prizes after the correct answer, and each time you answer correctly, the prizes in the list will be randomly selected.</p>\n<ul>\n<li>New: add a prize</li>\n<li>Edit: edit an existing prize (need to select one first)</li>\n<li>Delete: delete the selected prize</li>\n</ul>\n<p><img src=\"@source/en/guide/mods/quiz/award.jpg\" alt=\"award\" /></p>\n<p>The third tab page is <code>Advance Config</code>:</p>\n<h3 id=\"advance-config\" tabindex=\"-1\"> Advance Config</h3>\n<p><img src=\"@source/en/guide/mods/quiz/config.jpg\" alt=\"config\" /></p>\n<ul>\n<li>Game time (minutes): the longest single game time</li>\n<li>Rest time (minutes): It is mandatory to rest for at least this number of minutes before entering the game</li>\n<li>Interval between questions (minutes): After every minutes of playing in the game, you must answer the questions</li>\n<li>Check interval (seconds): The interval for checking the answer internally, if the answer is wrong, the answer dialog box will pop up again</li>\n<li>Answer immediately after entering: whether to answer the question immediately after entering the game</li>\n<li>Mandatory admin breaks: Whether admins also follow game time and breaks</li>\n</ul>\n<h2 id=\"the-config-file\" tabindex=\"-1\"> The Config File</h2>\n<p>All parameter configuration information of the Quiz game challenge module is stored in its configuration file.</p>\n<div>\n<p>Tips</p>\n<p>Configuration files are plain text in <a href=\"https://www.ruanyifeng.com/blog/2016/07/yaml.html\" target=\"_blank\" rel=\"noopener noreferrer\">YAML format</a>.\nYou can open it directly with Notepad.</p>\n</div>\n<h3 id=\"the-location-of-the-config-file\" tabindex=\"-1\"> The location of the config file</h3>\n<p>The location of the default configuration file of the Quiz game challenge module is in <code>mods/quiz/config.yml</code> under the module directory.</p>\n<p>When you save the answer configuration in the game, the configuration file of the game world (course) is stored in the <code>quiz_config.yml</code> file under the world (course) directory, and the configuration file is only valid for the game course (world) .</p>\n<div>\n<p>Tips</p>\n<p>For the location of the world (course) directory, please refer to: <a href=\"/en/guide/teacher/#Introduction_to_App_Folder\">Application Directory Introduction</a></p>\n</div>\n<h3 id=\"config-sample\" tabindex=\"-1\"> Config Sample</h3>\n<div><pre><code><span># quiz_config.yml 文件</span>\n\n<span># The permission given to the player after a successful answer, the default is \"interact,shout\"</span>\n<span>grant</span><span>:</span> interact<span>,</span>shout\n<span># The maximum gameplay time, the unit is minutes, 0 means disabled</span>\n<span>totalPlayTime</span><span>:</span> <span>30</span>\n<span># The minimum rest time after the gameplay, the unit is minutes, 0 means disabled</span>\n<span>restTime</span><span>:</span> <span>20</span>\n<span># Whether to skip questions that have already been answered correctly</span>\n<span># The number indicates the number of correct answers, 0 means disabled</span>\n<span>skipAnswered</span><span>:</span> <span>1</span>\n<span># Check interval, in seconds</span>\n<span>checkInterval</span><span>:</span> <span>5</span>\n<span># Interval between responses, in minutes</span>\n<span>idleInterval</span><span>:</span> <span>5</span>\n<span># When the gameplay time is up, the delay time for kicking out the player, the unit is second</span>\n<span>kickDelay</span><span>:</span> <span>2</span>\n<span># A random prize given for correct answers</span>\n<span>awards</span><span>:</span>\n  <span># the item name to give</span>\n  <span># Item name see： minetest_game/mods/default/nodes.lua</span>\n  <span>-</span> <span>id</span><span>:</span> coalblock\n    <span># optional, for translation</span>\n    <span>title</span><span>:</span> Coal Block\n    <span># optional, the defaults to default mod</span>\n    <span>mod</span><span>:</span> default\n    <span># the item count, optional the defaults to 1</span>\n    <span>count</span><span>:</span> <span>1</span>\n  <span>-</span> <span>id</span><span>:</span> wood\n    <span>title</span><span>:</span> Apple Wood Planks\n    <span>count</span><span>:</span> <span>3</span>\n  <span>-</span> <span>id</span><span>:</span> stone\n    <span>title</span><span>:</span> Stone\n    <span>count</span><span>:</span> <span>3</span>\n  <span>-</span> <span>id</span><span>:</span> torch\n    <span>title</span><span>:</span> Torch\n  <span>-</span> <span>id</span><span>:</span> steel_ingot\n    <span>title</span><span>:</span> Steel Ingot\n    <span>count</span><span>:</span> <span>3</span>\n<span># List of Quiz</span>\n<span>quiz</span><span>:</span>\n  <span># If there is no quiz type, the default type is \"text\"</span>\n  <span>-</span> <span>id</span><span>:</span> favorColor\n    <span>title</span><span>:</span> <span>\"What's my favor color?\"</span>\n    <span>answer</span><span>:</span> red\n  <span>-</span> <span>id</span><span>:</span> theYear\n    <span>title</span><span>:</span> <span>\"What's the year?\"</span>\n    <span>answer</span><span>:</span> <span>2021</span>\n  <span>-</span> <span>title</span><span>:</span> <span>\"18/7=?\"</span>\n    <span># LUA string pattern matching method</span>\n    <span>answer</span><span>:</span> <span>\"/^2%.%.%.+4/\"</span> <span># the lua string pattern: 2...4 (three dots and more)</span>\n  <span>-</span> <span>title</span><span>:</span> <span>\"$calc=?\"</span>\n    <span># Four Arithmetic Operation Types</span>\n    <span>type</span><span>:</span> calc\n    <span># The result of the forced division operation has no remainder and is an integer</span>\n    <span>forceInt</span><span>:</span> <span>true</span>\n    <span>answer</span><span>:</span> <span>\"(Nn*n+n)/(Nn-n)\"</span>\n  <span>-</span> <span>title</span><span>:</span> <span>\"What is the part of the plant that uses light to make food?\"</span>\n    <span># multiple choice</span>\n    <span>type</span><span>:</span> <span>\"select\"</span>\n    <span>options</span><span>:</span>\n      <span>-</span> leaves\n      <span>-</span> roots\n      <span>-</span> stem\n      <span>-</span> flowers\n    <span># The order number starts from 1. If it is a multiple choice, the order numbers are separated by commas, and there is no space in the middle</span>\n    <span>answer</span><span>:</span> <span>1</span>\n</code></pre><div aria-hidden=\"true\"><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div></div></div><div>\n<p>Note</p>\n<ul>\n<li><a href=\"https://www.ruanyifeng.com/blog/2016/07/yaml.html\" target=\"_blank\" rel=\"noopener noreferrer\">YAML格式</a> Use indentation to indicate hierarchical relationship, pay attention to indentation alignment.</li>\n<li>Must be indented with <code>space</code>, not <code>tab</code> key</li>\n</ul>\n</div>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-07-01T13:37:19.000Z",
      "authors": [],
      "tags": [
        "Mod",
        "Builtin"
      ]
    },
    {
      "title": "VBots Visual Turtle Programming",
      "url": "https://edu.ihom.app/en/guide/mods/vbots/",
      "id": "https://edu.ihom.app/en/guide/mods/vbots/",
      "content_html": "<ul>\n<li><strong>Author</strong>: Nigel Garnett(nigel.garnett@gmail.com)</li>\n</ul>\n<blockquote>\n<p>Nigel Garnett: VBots are single-block &quot;turtle&quot;-style robots that are completely visually programmed. They exist to entertain my 5 year old daughters and teach them the basics of computer programming without writing too much.</p>\n</blockquote>\n<p>Command the turtle robot with graphical commands.</p>\n<p><img src=\"@source/en/guide/mods/vbots/screenshot.jpg\" alt=\"screenshot\" /></p>\n<h2 id=\"basic-operation\" tabindex=\"-1\"> Basic operation</h2>\n<ul>\n<li>Run the program by tapping an idle VBot with your free hand (or click the run icon in the menu [see below]).</li>\n<li>Hit the running VBot (turtle robot) with bare hands to stop the program.</li>\n<li>Right-click (double-tap on Android phones) to open the <code>Action Menu</code> (see below).</li>\n<li>Hit it with anything other than an empty hand to dig a VBot (turtle robot), but remember that the robot can only be mined (returns the turtle to the inventory) when the VBot's inventory is empty.</li>\n</ul>\n<h2 id=\"action-menu\" tabindex=\"-1\"> Action menu</h2>\n<p><img src=\"@source/en/guide/mods/vbots/doc_menu1.png\" alt=\"menu1\" /></p>\n<p>The icons <code>commands</code><img src=\"@source/en/guide/mods/vbots/vbots_gui_commands.png\" alt=\"commands\" /> and <code>inventory</code><img src=\"@source/en/guide/mods/vbots/vbots_location_inventory.png\" alt=\"inventory\" /> are used to toggle between the 2 panels shown here.</p>\n<p>The command pane above contains commands for the robot, which can be added to the current subroutine by simply clicking on them (red area on the right).</p>\n<p>The lower panel shows the inventory list panel, with the bot's inventory list on top and the player's inventory list below. This panel is used to add things to the robot's inventory (so that it can build with them) or to remove things from the robot's inventory after digging.</p>\n<p><img src=\"@source/en/guide/mods/vbots/doc_menu2.png\" alt=\"menu2\" /></p>\n<p>When the Trash<img src=\"@source/en/guide/mods/vbots/vbots_gui_trash.png\" alt=\"trash\" /> icon is pressed, delete the last command on the current subroutine page. Next to this icon is another 1x1 trash can slot, which acts as a trash can, and anything that falls into it is destroyed.</p>\n<ul>\n<li>Run<img src=\"@source/en/guide/mods/vbots/vbots_gui_run.png\" alt=\"run\" /> icon, like hitting the robot with an open hand, it will start the program</li>\n<li>Save! The <a href=\"./vbots_gui_save.png\">save</a> icon saves the current program and subroutines under the robot's name.</li>\n<li>Load<img src=\"@source/en/guide/mods/vbots/vbots_gui_load.png\" alt=\"load\" /> icon allows you to select a program and load it into the robot. Also on this menu are icons that allow programs to be deleted and renamed.</li>\n<li>The reset<img src=\"@source/en/guide/mods/vbots/vbots_gui_nuke.png\" alt=\"reset\" /> icon will clear the main program and all subroutines, but will not clear the robot's inventory.</li>\n</ul>\n<p>The Subroutines panel (red on the right) has 7 pages. The <img src=\"@source/en/guide/mods/vbots/vbots_program_0.png\" alt=\"lion\" /> icon is the page of the &quot;main&quot; program, where execution starts when the robot is activated. The other 6 pages are subroutines, which can be invoked via the 6 &quot;run subroutine&quot; icons at the bottom of the command palette. <img src=\"@source/en/guide/mods/vbots/vbots_run_1.png\" alt=\"Dinosaur\" /> <img src=\"@source/en/guide/mods/vbots/vbots_run_2.png\" alt=\"Goat\" /> <img src=\"@source/en/guide/mods/vbots/vbots_run_3.png\" alt=\"Horse\" /> <img src=\"@source/en/guide/mods/vbots/vbots_run_4.png\" alt=\"Parrot\" /> ![Bear](. /vbots_run_5.png) <img src=\"@source/en/guide/mods/vbots/vbots_run_6.png\" alt=\"Rhino\" /></p>\n<h3 id=\"move\" tabindex=\"-1\"> Move</h3>\n<ul>\n<li><img src=\"@source/en/guide/mods/vbots/vbots_move_forward.png\" alt=\"forward\" /> <img src=\"@source/en/guide/mods/vbots/vbots_move_backward.png\" alt=\"backward\" /> <img src=\"@source/en/guide/mods/vbots/vbots_move_up.png\" alt=\"up\" /> <img src=\"@source/en/guide/mods/vbots/vbots_move_down.png\" alt=\"down\" /> forward , to move the robot backwards, up or down. If the new location is not empty, the move will fail.</li>\n<li><img src=\"@source/en/guide/mods/vbots/vbots_move_home.png\" alt=\"home\" /> moves the robot back to where it was placed. NOTE: The orientation of the robot will not return to its original orientation.</li>\n<li><img src=\"@source/en/guide/mods/vbots/vbots_turn_clockwise.png\" alt=\"clockwise\" /> <img src=\"@source/en/guide/mods/vbots/vbots_turn_anticlockwise.png\" alt=\"anticlockwise\" /> <img src=\"@source/en/guide/mods/vbots/vbots_turn_random.png\" alt=\"random\" /> These commands turn the robot in a clockwise, anticlockwise or random direction.</li>\n</ul>\n<h3 id=\"action\" tabindex=\"-1\"> Action</h3>\n<ul>\n<li><img src=\"@source/en/guide/mods/vbots/vbots_mode_dig_up.png\" alt=\"dig up\" /> <img src=\"@source/en/guide/mods/vbots/vbots_mode_dig_down.png\" alt=\"dig down\" /> <img src=\"@source/en/guide/mods/vbots/vbots_mode_dig.png\" alt=\"dig\" /> These commands make the robot dig nodes in that direction, then move to where it digs. NOTE: Mining will fail if the node being mined has protection that the bot owner cannot mine.</li>\n<li><img src=\"@source/en/guide/mods/vbots/vbots_mode_build_up.png\" alt=\"Build Up\" /> <img src=\"@source/en/guide/mods/vbots/vbots_mode_build_up.png\" alt=\"Build Down\" /> <img src=\"@source/en/guide/mods/vbots/vbots_mode_build.png\" alt=\"Build\" /> These commands make the robot place a block at the specified location (if protected allowed and the location is empty). The node placed by the robot is the first thing found in the robot's inventory, starting with the first slot.</li>\n</ul>\n<h3 id=\"special\" tabindex=\"-1\"> Special</h3>\n<p><img src=\"@source/en/guide/mods/vbots/vbots_mode_speed.png\" alt=\"speed\" /> This pseudo-command selects the speed at which the robot will run the program. When followed by a number multiplier, it makes the robot run many times faster. When there is no number after it, it resets the robot to normal speed.</p>\n<h3 id=\"multiplier\" tabindex=\"-1\"> Multiplier</h3>\n<p><img src=\"@source/en/guide/mods/vbots/vbots_number_2.png\" alt=\"x2\" /> <img src=\"@source/en/guide/mods/vbots/vbots_number_3.png\" alt=\"x3\" /> <img src=\"@source/en/guide/mods/vbots/vbots_number_4.png\" alt=\"x4\" /> <img src=\"@source/en/guide/mods/vbots/vbots_number_5.png\" alt=\"x5\" /> ![x6](. /vbots_number_6.png) <img src=\"@source/en/guide/mods/vbots/vbots_number_7.png\" alt=\"x7\" /> <img src=\"@source/en/guide/mods/vbots/vbots_number_8.png\" alt=\"x8\" /> <img src=\"@source/en/guide/mods/vbots/vbots_number_9.png\" alt=\"x9\" /> In addition to speed (as above), the multiplier Works the same for all commands. For all other commands (including call subroutine commands), they cause the command to run multiple times.</p>\n<h3 id=\"example-1\" tabindex=\"-1\"> Example 1</h3>\n<p><img src=\"@source/en/guide/mods/vbots/vbots_move_forward.png\" alt=\"forward\" /> <img src=\"@source/en/guide/mods/vbots/vbots_number_4.png\" alt=\"x4\" /> <img src=\"@source/en/guide/mods/vbots/vbots_turn_clockwise.png\" alt=\"clockwise\" /> <img src=\"@source/en/guide/mods/vbots/vbots_number_2.png\" alt=\"x2\" /> <img src=\"@source/en/guide/mods/vbots/vbots_move_forward.png\" alt=\"forward \" /> <img src=\"@source/en/guide/mods/vbots/vbots_number_4.png\" alt=\"x4\" /> <img src=\"@source/en/guide/mods/vbots/vbots_turn_clockwise.png\" alt=\"clockwise\" /> <img src=\"@source/en/guide/mods/vbots/vbots_number_2.png\" alt=\"x2\" /></p>\n<p>The program makes the robot move forward 4 spaces (if possible) then turn 180 degrees, move forward 4 spaces (i.e. back to the starting position) then turn 180 degrees again to face the original orientation.</p>\n<h3 id=\"example-2\" tabindex=\"-1\"> Example 2</h3>\n<p>Example 2 is actually Example 1 using subroutines.</p>\n<p>In the dinosaur<img src=\"@source/en/guide/mods/vbots/vbots_run_1.png\" alt=\"dinosaur\" /> subroutine put the following: <img src=\"@source/en/guide/mods/vbots/vbots_move_forward.png\" alt=\"forward\" /> <img src=\"@source/en/guide/mods/vbots/vbots_number_4.png\" alt=\"x4\" /> <img src=\"@source/en/guide/mods/vbots/vbots_turn_clockwise.png\" alt=\"clockwise\" /> <img src=\"@source/en/guide/mods/vbots/vbots_number_2.png\" alt=\"x2\" /></p>\n<p>Then, in the <img src=\"@source/en/guide/mods/vbots/vbots_program_0.png\" alt=\"lion\" /> main program (lion), call it twice like this: <img src=\"@source/en/guide/mods/vbots/vbots_run_1.png\" alt=\"dinosaur\" /> <img src=\"@source/en/guide/mods/vbots/vbots_number_2.png\" alt=\"x2\" /></p>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": [
        "Mod",
        "Builtin"
      ]
    },
    {
      "title": "Creative Mode",
      "url": "https://edu.ihom.app/en/guide/play/creative/",
      "id": "https://edu.ihom.app/en/guide/play/creative/",
      "content_html": "<div>\n<p>Tips</p>\n<p>If you are not clear about the operation of the game, please read the <a href=\"/en/guide/get-started/\">Get Started</a>.</p>\n</div>\n<p>All resources in creative mode are at your fingertips. And the blocks in the world can be dug by hand without tools (unless protection is set).</p>\n<h2 id=\"open-inventory\" tabindex=\"-1\"> Open inventory</h2>\n<Tabs :data='[{\"title\":\"PC/Computer\",\"value\":\"pc\"},{\"title\":\"Android Phone/Tablet\",\"value\":\"mobile\"}]' tab-id=\"operator\">\n<template #tab0=\"{ title, value, isActive }\">\n<p>Press the <code>I</code> key to open the inventory, press the <code>ESC</code> key to close the inventory.</p>\n</template>\n<template #tab1=\"{ title, value, isActive }\">\n<ul>\n<li>Click on the <strong>Function Menu</strong> on the right (three vertical dots) <img src=\"@source/en/guide/get-started/imgs/three-dot.png\" alt=\"three dot\" />:\n<ul>\n<li>Click on the nine-square icon <img src=\"@source/en/guide/get-started/imgs/inventory.png\" alt=\"Inventory\" /> - Open player item equipment (synthesis) tab</li>\n</ul>\n</li>\n</ul>\n<p>Click on other areas of the screen (non-inventory window) to close the inventory.</p>\n</template>\n</Tabs>\n<p>You can see that the inventory bar is divided into left and right parts:</p>\n<p><img src=\"@source/en/guide/play/imgs/inventory.jpg\" alt=\"inventory\" /></p>\n<div>\n<p>Tips</p>\n<p><strong>Note</strong>: The inventory here is the inventory interface after the <code>unified_inventory</code> mod is enabled, and the following inventory is explained with this advanced inventory module as an example.</p>\n</div>\n<ul>\n<li>left\n<ul>\n<li>The upper part is the player's item synthesis bar (not used in creative mode)</li>\n<li>The lower part is the player's belongings column</li>\n</ul>\n</li>\n<li>On the right is a list of all items (including equipment and animals) in the game:\n<ul>\n<li>In creative mode, click on any item to put it in the user's inventory.</li>\n<li>In survival mode, you can only view the synthesis method of the item.</li>\n</ul>\n</li>\n</ul>\n<p>Now, little God of Creation, start creating the world in your mind now.</p>\n<p><img src=\"@source/imgs/izzyscastle.webp\" alt=\"izzys castle\" /></p>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "Survival Mode",
      "url": "https://edu.ihom.app/en/guide/play/survival/",
      "id": "https://edu.ihom.app/en/guide/play/survival/",
      "content_html": "<div>\n<p>Tips</p>\n<p>If you are not clear about the operation of the game, please read the <a href=\"/en/guide/get-started/\">Get Started</a>.</p>\n</div>\n<p>You are born at a random location in the morning. This is when you need to look for trees. The sun will rise and set</p>\n<div>\n<p>Tips</p>\n<p>If the creature/monster mod is enabled in this world, creatures will appear randomly in this world, and some unique creatures/monsters will only appear during the day or night, which will have a great impact on your survival.</p>\n</div>\n<h2 id=\"dig-and-get-falling-blocks\" tabindex=\"-1\"> Dig and get falling blocks</h2>\n<p>The way to get resources in survival mode is by digging and getting dropped blocks.</p>\n<p><img src=\"@source/en/guide/play/imgs/tree.jpg\" alt=\"tree\" /></p>\n<p>A tree generally consists of a trunk and leaves. As shown, this is an apple tree, and the nearby lighter-colored trees are pine trees. The wood is all the same except for differences in color and grain.</p>\n<p>Since you don't have any tools, you need to get close and aim at the wood (with a small crosshair), and hit the wood continuously, and you will find a block crack in the wood, keep hitting the wood, when the crack is full of this A block, this block will be dug up, appear on the ground in the form of an item, and will be picked up if approached (the <code>ItemDrop</code> module is enabled by default). Most blocks require specific tools to break quickly and drop.</p>\n<div>\n<p>How to \"Hit Wood\"</p>\n<p>After approaching the tree:</p>\n<Tabs :data='[{\"title\":\"PC/Computer\",\"value\":\"pc\"},{\"title\":\"Android Phone/Tablet\",\"value\":\"mobile\"}]' tab-id=\"operator\">\n<template #tab0=\"{ title, value, isActive }\">\n<p>Continuous hit: press and hold the left mouse button\nSingle click: click the left mouse button</p>\n</template>\n<template #tab1=\"{ title, value, isActive }\">\n<p>Continuous hit: Press and hold the tree on the right side of the screen with your finger</p>\n<p><em>Note</em>: Please make sure that the trees are on the right side of the screen; the left side of the screen is the forward direction control area, and you cannot operate and hit.</p>\n</template>\n</Tabs>\n</div>\n<p>In a few seconds you have an extra piece of wood in your hand</p>\n<h2 id=\"combining-item-and-equipment\" tabindex=\"-1\"> Combining item and equipment</h2>\n<p>Changing items or creating new items is achieved by placing different items in different positions in the synthesis column, which is called an item synthesis recipe.</p>\n<p>Open the item bar, left-click the wood, and put it into any of the 6 (3x3) squares below the synthesis, and the synthesized item will appear in the small square on the right. Congratulations, you have decomposed the wood into 4 planks.\nThen you can drag the wood plank synthesized in the small square on the right to your own inventory.</p>\n<p><img src=\"@source/en/guide/play/imgs/inventory.jpg\" alt=\"inventory\" /></p>\n<div>\n<p>\"Open inventory\" operation method</p>\n<Tabs :data='[{\"title\":\"PC/Computer\",\"value\":\"pc\"},{\"title\":\"Android Phone/Tablet\",\"value\":\"mobile\"}]' tab-id=\"operator\">\n<template #tab0=\"{ title, value, isActive }\">\n<p>Press the <code>I</code> key to open the inventory, press the <code>ESC</code> key to close the inventory.</p>\n</template>\n<template #tab1=\"{ title, value, isActive }\">\n<ul>\n<li>Click on the <strong>Function Menu</strong> on the right (three vertical dots) <img src=\"@source/en/guide/get-started/imgs/three-dot.png\" alt=\"three dot\" />:\n<ul>\n<li>Click on the nine-square icon <img src=\"@source/en/guide/get-started/imgs/inventory.png\" alt=\"Inventory\" /> - Open player item equipment (synthesis) tab</li>\n</ul>\n</li>\n</ul>\n<p>Click on other areas of the screen (non-inventory window) to close the inventory.</p>\n</template>\n</Tabs>\n</div>\n<p><img src=\"@source/en/guide/play/imgs/tree_plank.jpg\" alt=\"plank\" /></p>\n<div>\n<p>How to \"Drag Items\"</p>\n<Tabs :data='[{\"title\":\"PC/Computer\",\"value\":\"pc\"},{\"title\":\"Android Phone/Tablet\",\"value\":\"mobile\"}]' tab-id=\"operator\">\n<template #tab0=\"{ title, value, isActive }\">\n<p>Move the mouse to the item, click the item with the left button, you can grab the item, then move the mouse to the target position, and finally click the left mouse button again to put it all down, and click the right mouse button to put down half of it.</p>\n</template>\n<template #tab1=\"{ title, value, isActive }\">\n<p>Press and hold the item on the screen with your finger, then move to the target, and finally leave the screen with your finger or press another finger to separate multiple items. It can also be operated in the same way as on the computer.</p>\n</template>\n</Tabs>\n</div>\n<div>\n<p>view item synthesis recipes</p>\n<Tabs :data='[{\"title\":\"unified_inventory\",\"value\":\"unified_inventory\"},{\"title\":\"Builtin Inventory\",\"value\":\"sfinv\"}]'>\n<template #tab0=\"{ title, value, isActive }\">\n<ul>\n<li>Click the synthesis guide (question mark &quot;?&quot;) icon at the bottom of the item bar, and then click the item on the right, you can see the formula of the item on the left.\n<ul>\n<li><img src=\"@source/en/guide/play/imgs/unified_inventory_guide.gif\" alt=\"unified_inventory_guide\" /></li>\n</ul>\n</li>\n</ul>\n</template>\n<template #tab1=\"{ title, value, isActive }\">\n<ul>\n<li>Click the &quot;Recipe&quot; tab above the item bar, and then click the corresponding item, you can see the formula of the item below.\n<ul>\n<li><img src=\"@source/en/guide/play/imgs/sfinv_guide.gif\" alt=\"sfinv_guide\" /></li>\n</ul>\n</li>\n</ul>\n</template>\n</Tabs>\n</div>\n<p>:::</p>\n<h3 id=\"stick\" tabindex=\"-1\"> Stick</h3>\n<p><img src=\"@source/en/guide/play/imgs/tree_stick.jpg\" alt=\"stick\" /></p>\n<p>Then put a piece of wood into the synthesis bar, you will get 4 sticks.</p>\n<h3 id=\"pickaxe\" tabindex=\"-1\"> Pickaxe</h3>\n<p><img src=\"@source/en/guide/play/imgs/pick_menu.jpg\" alt=\"pick\" /></p>\n<p>Make a pickaxe in this way (you can do without any tools, but you must have a pickaxe). You can replace the pickaxe (three blocks of wood/stone horizontally is the pickaxe) with stone or iron ingot.</p>\n<p><img src=\"@source/en/guide/play/imgs/dig_stone.jpg\" alt=\"dig stone\" /></p>\n<p>Then go to dig the stone, the gray one is the stone, collect it with a pickaxe, and get the rough stone.</p>\n<p><img src=\"@source/en/guide/play/imgs/stone_pick.jpg\" alt=\"stone pick\" /></p>\n<p>In this way, stone pickaxes can collect iron ore that wooden pickaxes cannot.</p>\n<p><img src=\"@source/en/guide/play/imgs/stone_with_coal.jpg\" alt=\"coal\" /></p>\n<p>The ones with black dots are coal mines, where coal can be dug out;</p>\n<p><img src=\"@source/en/guide/play/imgs/stone_with_iron.jpg\" alt=\"stone_with_iron.jpg\" /></p>\n<p>Iron ore is dotted with dark gold, and iron ore can be dug out.</p>\n<h3 id=\"torch\" tabindex=\"-1\"> Torch</h3>\n<p><img src=\"@source/en/guide/play/imgs/torch.jpg\" alt=\"torch\" /></p>\n<p>A piece of coal and a stick are used as a torch for lighting.</p>\n<h3 id=\"furnace\" tabindex=\"-1\"> Furnace</h3>\n<p><img src=\"@source/en/guide/play/imgs/furnace.jpg\" alt=\"furnace\" /></p>\n<p>Eight rough stones are used to build a furnace for cooking cooked food and minerals.</p>\n<p>Put fuel under the furnace: coal, wood, leaves..., and put materials that need to be heated on it.</p>\n<h3 id=\"iron-ingots\" tabindex=\"-1\"> Iron ingots</h3>\n<p><img src=\"@source/en/guide/play/imgs/furnace_iron.jpg\" alt=\"furnace iron\" /></p>\n<p>Coal, various leaves, and most wood products can be used as fuel, and fired items are placed on top, such as iron ore to obtain iron ingots.</p>\n<p>In the early stage, there was no coal, so you could put leaves, planks and wooden tools into it as fuel to burn. Of course, the fire will go out after a while, because it is not resistant to burning, so you need to put more fuel.</p>\n<h3 id=\"steel-pickaxe\" tabindex=\"-1\"> Steel Pickaxe</h3>\n<p><img src=\"@source/en/guide/play/imgs/steel_pick.jpg\" alt=\"steel_pick\" /></p>\n<p>If you make an iron pick as shown in the picture, you can collect more advanced minerals above iron ore.</p>\n<h3 id=\"axe\" tabindex=\"-1\"> Axe</h3>\n<p><img src=\"@source/en/guide/play/imgs/stone_axe.jpg\" alt=\"stone_axe\" /></p>\n<p>The method of an axe (stone can be replaced by wood, iron, etc., and other tools are the same) is mainly used for chopping wood products, and is also encouraged to be used as a weapon.</p>\n<h3 id=\"sword\" tabindex=\"-1\"> Sword</h3>\n<p><img src=\"@source/en/guide/play/imgs/stone_sword.jpg\" alt=\"stone_sword.jpg\" /></p>\n<p>The practice of the sword can cause a group injury effect of horizontal slashing on multiple targets.</p>\n<h3 id=\"shovel\" tabindex=\"-1\"> Shovel</h3>\n<p><img src=\"@source/en/guide/play/imgs/stone_shovel.jpg\" alt=\"stone_shovel.jpg\" /></p>\n<p>Shovels are used to dig dirt, sand, and gravel faster.</p>\n<h3 id=\"hoe\" tabindex=\"-1\"> Hoe</h3>\n<p><img src=\"@source/en/guide/play/imgs/stone_hoe.jpg\" alt=\"stone_hoe.jpg\" /></p>\n<p>Hoe, used for farming, right click on the soil to generate arable land.</p>\n<h3 id=\"bucket\" tabindex=\"-1\"> Bucket</h3>\n<p><img src=\"@source/en/guide/play/imgs/steel_bucket.jpg\" alt=\"steel_bucket.jpg\" /></p>\n<p>The iron bucket can lift water (press the left button to dig water where there is water). Use right button (place) to pour water.</p>\n<h3 id=\"plant\" tabindex=\"-1\"> Plant</h3>\n<p><img src=\"@source/en/guide/play/imgs/plant_water.jpg\" alt=\"plant\" /></p>\n<p>Sow seeds on cultivated land (wheat seeds can be obtained by rolling grass), and there must be a water source next to the cultivated land to grow well.</p>\n",
      "date_published": "2023-06-28T09:25:32.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "变更日志",
      "url": "https://edu.ihom.app/en/changelog.html",
      "id": "https://edu.ihom.app/en/changelog.html",
      "summary": "This file contains the version history of Minetest: Education.\n",
      "content_html": "<p>This file contains the version history of <code>Minetest: Education</code>.</p>\n\n<h2 id=\"public-release-version\" tabindex=\"-1\"> Public release version</h2>\n<h3 id=\"v5-7-0-663961b4b-2023-07-06\" tabindex=\"-1\"> v5.7.0-663961b4b(2023-07-06)</h3>\n<ul>\n<li>🪲 [YAML]: crash the server if minetestserver run with --world worlds/default</li>\n<li>🪲 [Nickname]: crash the server if set nickname to non-exists player</li>\n<li>🆕️️ feat(lua): add an unregister function that is returned by callback registration functions in Lua. <code>feature/add-unregister-function</code></li>\n<li>🆕️️ feat(csm): add register_on_client_ready, register_on_camera_ready and register_on_minimap_ready callback registration functions <code>feat/csm-client_ready_etc</code></li>\n<li>🆕️️ feat(csm): add is_single_player boolean field to get_server_info() <code>feat/csm-check_is_single_player</code></li>\n<li>🆕️️ feat(mod_data): add get_mod_data_path() to client</li>\n<li>🆕️️ [Quiz]: add immediateDelay option</li>\n<li>🪲 [Mainmenu]: The nickname configuration of the mainmenu interface can only be used in single-player games, and cannot be used in multiplayer games.</li>\n<li>🪲 [Mainmenu]: After modifying the game mode to Survival Mode, it will always be restored to Creative Mode next time enter.</li>\n<li>These 5.8-dev patches have been merged into 5.7.0-663961b4b\n<ul>\n<li>🪲 <a href=\"https://github.com/minetest/minetest/pull/13638\" target=\"_blank\" rel=\"noopener noreferrer\">Fix local animations not resetting</a></li>\n<li>🆕️️ <a href=\"https://github.com/minetest/minetest/pull/10100\" target=\"_blank\" rel=\"noopener noreferrer\">Additional texture modifiers</a></li>\n<li>🆕️️ <a href=\"https://github.com/minetest/minetest/pull/11377\" target=\"_blank\" rel=\"noopener noreferrer\">Add disable_descend group to disable active descend in climbable or liquid node</a></li>\n<li>🆕️️ <a href=\"https://github.com/minetest/minetest/pull/12614\" target=\"_blank\" rel=\"noopener noreferrer\">Add ability to override item images using meta</a></li>\n<li>🆕️️ <a href=\"https://github.com/minetest/minetest/pull/12768\" target=\"_blank\" rel=\"noopener noreferrer\">Bigfoot and footstep at feet</a></li>\n<li>🪲 <a href=\"https://github.com/minetest/minetest/pull/13187\" target=\"_blank\" rel=\"noopener noreferrer\">Place nodes with single tap on Android (+ bugfix)</a></li>\n<li>🆕️️ <a href=\"https://github.com/minetest/minetest/pull/13196\" target=\"_blank\" rel=\"noopener noreferrer\">Add node pos to node damage HP change reason</a></li>\n<li>🪲 fix(performance): <a href=\"https://github.com/minetest/minetest/pull/13234\" target=\"_blank\" rel=\"noopener noreferrer\">Throw Hopcroft-Karp at shapeless craft recipes</a></li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13253/\" target=\"_blank\" rel=\"noopener noreferrer\">Add antialiasing filters (FXAA, SSAA)</a></li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13336\" target=\"_blank\" rel=\"noopener noreferrer\">Simulate all keys being released when when game loses focus</a></li>\n<li>🆕️️ <a href=\"https://github.com/minetest/minetest/pull/13408\" target=\"_blank\" rel=\"noopener noreferrer\">Track server's maximum AsyncRunStep(profile)</a></li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13353\" target=\"_blank\" rel=\"noopener noreferrer\">Item Entity: Prevent moveresult assert when attached</a></li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13360\" target=\"_blank\" rel=\"noopener noreferrer\">InventoryManager: Disallow resizing or deleting inventory lists that are in use</a></li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13426\" target=\"_blank\" rel=\"noopener noreferrer\">Disable vertical movement in free_move when both jump and sneak keys are pressed</a>\n<ul>\n<li>jump+sneak to put</li>\n</ul>\n</li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13431\" target=\"_blank\" rel=\"noopener noreferrer\">Load blocks and objects behind player when in third-persion front-view</a></li>\n<li>🪲 <a href=\"https://github.com/minetest/minetest/pull/13432\" target=\"_blank\" rel=\"noopener noreferrer\">Fix rotation of 4dir in schematic placement</a></li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13470\" target=\"_blank\" rel=\"noopener noreferrer\">Release invlist resizelock while doing the recursive callback in move_somewhere mode</a></li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13472\" target=\"_blank\" rel=\"noopener noreferrer\">Cavegen y biome check</a></li>\n<li>🪲 <a href=\"https://github.com/minetest/minetest/pull/13484\" target=\"_blank\" rel=\"noopener noreferrer\">Fix Android segfault when game exits before TouchScreenGUI is initalized</a></li>\n<li>🪲 <a href=\"https://github.com/minetest/minetest/pull/13487\" target=\"_blank\" rel=\"noopener noreferrer\">Fix crash on handling wallmounted nodes with invalid param2</a></li>\n<li>🪲 <a href=\"https://github.com/minetest/minetest/pull/13497\" target=\"_blank\" rel=\"noopener noreferrer\">Inventory: Allow InvRef:set_list with new_size &gt;= old_size</a></li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13514\" target=\"_blank\" rel=\"noopener noreferrer\">Disable desynchronize_mapblock_texture_animation by default</a></li>\n<li>🪲 fix(android): <a href=\"https://github.com/minetest/minetest/pull/13521\" target=\"_blank\" rel=\"noopener noreferrer\">Reliably showing an IME for text input dialog</a></li>\n<li>🆕️️ <a href=\"https://github.com/minetest/minetest/pull/13523\" target=\"_blank\" rel=\"noopener noreferrer\">Implement check_offset for decorations</a></li>\n<li>🪲 <a href=\"https://github.com/minetest/minetest/pull/13532\" target=\"_blank\" rel=\"noopener noreferrer\">Remove a misleading MutexAutoLock in l_to_table</a></li>\n<li>🪲 <a href=\"https://github.com/minetest/minetest/pull/13564\" target=\"_blank\" rel=\"noopener noreferrer\">Fix some memleaks from GUIButtonImage</a></li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13594\" target=\"_blank\" rel=\"noopener noreferrer\">Cull liquid back face on liquid-glasslike interface</a></li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13615\" target=\"_blank\" rel=\"noopener noreferrer\">ActiveObjectMgr::getActiveSelectableObjects</a>\n<ul>\n<li>So you're essentially replacing the cuboid with a cylinder.</li>\n</ul>\n</li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13635\" target=\"_blank\" rel=\"noopener noreferrer\">Don't crash if a Lua error occurs inside get_staticdata</a></li>\n<li>🪲 fix: <a href=\"https://github.com/minetest/minetest/pull/13641\" target=\"_blank\" rel=\"noopener noreferrer\">texture paths for system-installed builds</a></li>\n</ul>\n</li>\n</ul>\n<h3 id=\"v5-7-0-dd18179a1-2023-07-02\" tabindex=\"-1\"> v5.7.0-dd18179a1(2023-07-02)</h3>\n<ul>\n<li>🪲 [Quiz_ui]: quizzes cannot be deleted and wrongly edited in the search list.</li>\n<li>🆕️️ [Quiz]: Read the configuration file in the mod_data directory, first try <code>config.yml</code>, then try <code>quiz_config.yml</code></li>\n<li>🆕️️ [Quiz]: When writing configuration, first try to write to the configuration file in the mod_data directory, and then try to write to the <code>world</code> directory: <code>quiz_config.yml</code></li>\n<li>🆕️️ [Yaml]: pcall error messages should be shown as warnings</li>\n<li>🪲 [Quiz_ui]: mod_data directory cannot be written, reports no permission</li>\n<li>🪲 [Security]: Unable to correctly get the mod where the caller is located</li>\n</ul>\n<h3 id=\"v5-7-0-b674de4d6-2023-06-28\" tabindex=\"-1\"> v5.7.0-b674de4d6 (2023-06-28)</h3>\n<ul>\n<li>️️🆕️️ Synchronized update to Minetest v5.7.0 game engine\n<ul>\n<li>🆕️️ New post-processing pipelines: Bloom and Dynamic Exposure\n<ul>\n<li>The post-processing pipeline refers to the process of performing some special effects on the entire picture after rendering the scene. These special effects can be to enhance the brightness, contrast, saturation, etc. of the picture, or to add some visual effects, such as floodlight, depth of field and more.</li>\n<li>Dynamic Exposure (Dynamic Exposure) can simulate the adaptive adjustment of the eyes when entering the cave from a bright area, so as to achieve a high dynamic range (HDR) effect.</li>\n<li><img src=\"@source/imgs/backroom_small.jpg\" alt=\"A screenshot of the Backrooms game with bloom shaders, taken by Extex (CC BY 4.0)\" /></li>\n</ul>\n</li>\n<li>Enhanced dynamic shadows</li>\n<li>🆕️️ Optimized (improved) field of view for modern GPUs\n<ul>\n<li>Currently, users with modern GPUs need to set &quot;Client Mesh Chunksize&quot; (<code>client_mesh_chunk</code>) to 4 or 8 to enable this optimization</li>\n<li>In the future, this optimization will likely be automatically enabled when Minetest detects hardware support</li>\n</ul>\n</li>\n<li>🆕️️Support rotation entity selection/hitbox\n<ul>\n<li><img src=\"@source/imgs/rotating_selection.jpg\" alt=\"Rotating selection boxes\" width=\"468\" /></li>\n</ul>\n</li>\n<li>🆕️️ Allows Android to display a fixed crosshair, which needs to be turned on in the configuration, search for &quot;crosshair&quot; in the configuration</li>\n</ul>\n</li>\n<li>🆕️️ Added new mods:\n<ul>\n<li>🎁 item_drop mod: Provides a pick/drop item mechanism similar to minecraft</li>\n<li>🎁 x_bows: Bows and arrows 🏹\n<ul>\n<li><img src=\"@source/imgs/x_bows.jpg\" alt=\"x_bows\" width=\"468\" /></li>\n</ul>\n</li>\n<li>🎁 x_bows_extras: more bows 🏹\n<ul>\n<li><img src=\"@source/imgs/x_bows_extras.jpg\" alt=\"x_bows_extras\" width=\"468\" /></li>\n</ul>\n</li>\n<li>🎁 player_monoids: is a library for managing global player state.</li>\n<li>🎁 bedrock2 mod: replaces old bedrock mod</li>\n<li>🎁 i3 advanced inventory module (in the external expansion pack): Note that it conflicts with the <code>unified_inventory</code> advanced inventory module, only one can be selected at a time\n<ul>\n<li><img src=\"@source/imgs/i3.jpg\" alt=\"i3\" width=\"468\" /></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>🆕️️ Although the creative mode is already defaulted, the &quot;Enable Creative Mode&quot; checkbox in the &quot;Start Game&quot; interface is not checked!</li>\n<li>🆕️️ Add the homepage of &quot;Minetest Education Edition&quot; in the About menu: https://edu.ihom.app</li>\n<li>🆕️️ Add nickname settings, nicknames allow Chinese\n<ul>\n<li>Added <code>nickname</code> input box directly on the student interface. (Hint: need to enable the nickname module in the game)</li>\n<li>The <code>Refresh</code> button behind the <code>Nickname</code> input box: It is used to load the nickname of the name after changing the name.</li>\n</ul>\n</li>\n<li>🆕️️ [nickname module] Added support for conf configuration format</li>\n<li>🪲 [nickname mod] By default, ordinary players are allowed to modify nicknames in the game</li>\n<li>⚡ Note [Android]: Doesn't work after upgrading from previous version. Must reinstall or clear all data in app details.</li>\n<li>🪲 Fix [Android]: Quiz report cannot be stored, no write permission. It is found that the security component cannot correctly obtain the module name under Android</li>\n<li>🪲 Fix [Security]: <code>src=(load)</code> causes the game to crash</li>\n</ul>\n<h3 id=\"v5-6-1-08cb5b125-2023-01-08\" tabindex=\"-1\"> v5.6.1-08cb5b125(2023-01-08)</h3>\n<ul>\n<li>temporarily disable <code>update_information_url</code></li>\n<li>🆕️️ Added nickname (nickname) module, nickname can be in Chinese.</li>\n<li>🪲 Fix: Nametags are reset when calling <code>set_nametag_attributes</code>, even if text param is not touched.</li>\n<li>🪲 FIXED: Chat should also use nickname <code>nametag</code>.\n<ul>\n<li><code>core. format_chat_message(name, message)</code></li>\n</ul>\n</li>\n<li>🆕️️ Add <code>mod_data</code> directory (<code>minetest.get_mod_data_path</code>) to save mod configuration data\n<ul>\n<li>It's useful for storing custom data <em>independently of worlds</em>.</li>\n</ul>\n</li>\n<li>🪲 FIXED: The trusted mod can not use <code>mkdir</code> etc functions.</li>\n<li>🪲 FIXED: Mod directory cannot write files\n<ul>\n<li>The directory where your mod is located should allow file writing.</li>\n<li>Background: Currently minetest only allows writing in the current world (course) directory, but I need to record students' learning in the same place, instead of dispersing the records in each world (course).</li>\n<li>[Security] The trusted mods are prohibited from using io functions. (branch: fix/trusted_mod_io)\n<ul>\n<li><code>ScriptApiSecurity::checkPath</code> can correctly get caller's mod name now.\n<ul>\n<li>Allow writing to the directory where the mod is located,</li>\n</ul>\n</li>\n<li><code>ScriptApiSecurity::checkWhitelisted</code> can correctly get caller's mod name now.</li>\n<li><code>ScriptApiSecurity::isSecure</code> uses <code>checkWhitelisted</code> now.\n<ul>\n<li>The trusted mods can use the io functions directly.</li>\n</ul>\n</li>\n<li>Add the static method <code>l_get_current_modname</code> and <code>get_current_modname</code> to <code>ScriptApiSecurity</code> class.</li>\n<li><code>ModApiClient::get_current_modname</code> and <code>ModApiServer::get_current_modname</code> can correctly get caller's mod name.</li>\n<li>Can analyze whether the call is injected or not.</li>\n<li>Fixed: #12857, #12948</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>🪲 Fix: The Chinese characters displayed in the prompt line of the chat window are squeezed together.</li>\n<li>Modify the initial default configuration world to creative mode (does not affect the existing default configuration).</li>\n<li>A little optimization of IME support under Linux and Windows systems</li>\n<li>Updated rendering engine: IrrlichtMt v1.9.0mt9</li>\n</ul>\n<h3 id=\"v5-6-1-2d4c67fd6-2022-10-15\" tabindex=\"-1\"> v5.6.1-2d4c67fd6(2022-10-15)</h3>\n<ul>\n<li>⛔️ Fix (Win32): enable basic IME support, able to input Chinese</li>\n<li>⛔️ classroom mod doesn't work on unified_inventory inventory mod\n<ul>\n<li>Preliminary Sinicization completed</li>\n</ul>\n</li>\n<li>🆕️️ Added <code>petz</code> pet mod (built-in some creatures, not enabled by default)</li>\n<li>Update the built-in mod version</li>\n<li>In prebuilt default worlds, all preinstalled mods are no longer enabled\n<ul>\n<li>Enabled mods\n<ul>\n<li><code>quiz</code>\n<ul>\n<li><code>quiz_ui</code></li>\n</ul>\n</li>\n<li><code>3d_armor</code></li>\n<li><code>basic_materials</code></li>\n<li><code>basic_signs</code></li>\n<li><code>bedrock</code></li>\n<li><code>flow</code></li>\n<li><code>formspec_ast</code></li>\n<li><code>formspecs</code></li>\n<li><code>fslib</code></li>\n<li><code>handholds_redo</code></li>\n<li><code>moblib</code></li>\n<li><code>modlib</code></li>\n<li><code>mesecons</code></li>\n<li><code>signs_lib</code></li>\n<li><code>skinsdb</code></li>\n<li><code>visible_wielditem</code></li>\n<li><code>wielded_light</code></li>\n<li><code>worldedit</code></li>\n</ul>\n</li>\n<li>List of disabled mods (requires manual activation)\n<ul>\n<li><code>accountmgr</code></li>\n<li><code>awards</code></li>\n<li><code>biofuel</code></li>\n<li><code>bonemeal</code></li>\n<li><code>ccompass</code></li>\n<li><code>classroom</code></li>\n<li><code>codeblock</code></li>\n<li><code>computertest</code></li>\n<li><code>digilines</code></li>\n<li><code>digistuff</code></li>\n<li><code>elevator</code></li>\n<li><code>go</code> Go module</li>\n<li><code>led_marquee</code></li>\n<li><code>lwcolorable</code></li>\n<li><code>lwcomponents</code></li>\n<li><code>lwcomponents_spawners</code></li>\n<li><code>lwcomputers</code></li>\n<li><code>lwroad_tracks</code></li>\n<li><code>lwscratch</code></li>\n<li><code>lwwires</code></li>\n<li><code>mathplot</code></li>\n<li><code>mesecons_x</code> automatic wiring module</li>\n<li><code>missions</code></li>\n<li><code>moreblocks</code></li>\n<li><code>more_chests</code></li>\n<li><code>moremesecons</code> mesecons extension tool module</li>\n<li><code>moreores</code></li>\n<li><code>numeracy</code></li>\n<li>🆕️️ <code>petz</code> add animal mod</li>\n<li><code>pipeworks</code></li>\n<li><code>pride_flags</code>\n<ul>\n<li><code>country_flags</code></li>\n</ul>\n</li>\n<li><code>scriptblocks2</code></li>\n<li><code>street_signs</code></li>\n<li><code>technic</code></li>\n<li><code>tt</code></li>\n<li><code>tubelib2</code></li>\n<li><code>unifieddyes</code></li>\n<li><code>unified_inventory</code> advanced inventory is no longer enabled by default\n<ul>\n<li><code>unified_inventory_plus</code></li>\n<li><code>unified_inventory_themes</code></li>\n</ul>\n</li>\n<li><code>vbots</code></li>\n<li><code>vector3</code></li>\n<li><code>xp_redo</code></li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"v5-6-1-c35575a00-2022-09-25\" tabindex=\"-1\"> v5.6.1-c35575a00(2022-09-25)</h3>\n<ul>\n<li>Upgrade to Minetest@5.6.1</li>\n<li>Upgrade Installed Mods</li>\n<li>🆕️️ Education Mods Added:\n<ul>\n<li>🆕️️ classroom</li>\n<li>🆕️️ accountmgr</li>\n<li>🆕️️ mathplot</li>\n<li>🆕️️ vbots</li>\n<li>🆕️️ scriptblocks2</li>\n<li>🆕️️ computertest</li>\n<li>🆕️️ country flags</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"v5-5-1-76bfbb601-2022-08-28\" tabindex=\"-1\"> v5.5.1-76bfbb601(2022-08-28)</h3>\n<ul>\n<li>First public release</li>\n<li>Upgrade to Minetest@5.6.1</li>\n<li>Many improvements and bugfixes</li>\n<li>Major improvements to the Quiz Player Challenge mod:\n<ul>\n<li>🆕️️ New four arithmetic operation answer type (type): <code>calc</code></li>\n<li>🆕️️ Text type answers now support <a href=\"https://www.lua.org/pil/20.2.html\" target=\"_blank\" rel=\"noopener noreferrer\">Lua character pattern matching</a>, if the answer is <code>pattern matching</code> string, then the answer must use two<code> /</code>Package.</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"internal-alpha-version\" tabindex=\"-1\"> Internal alpha version</h2>\n<h3 id=\"d104feadc-version-2021-09-06\" tabindex=\"-1\"> d104feadc Version(2021-09-06)</h3>\n<ul>\n<li>⛔️ Fix: After changing (switching) the username, the password cannot be changed.</li>\n<li>⛔️ Fix falling mesh nodes being half size</li>\n<li>🆕️️ Standalone games also require username and password\n<ul>\n<li>Consistent with the use of online games: let players who play stand-alone games on public computers have their own storage.</li>\n<li>Only when using singleplayer username (public username), no password required.</li>\n</ul>\n</li>\n<li>🆕️️ Enable new ZSTD real-time compression algorithm</li>\n<li>🆕️️ Joystick sensitivity for player movement</li>\n<li>Update unified_inventory mod</li>\n<li>Adjust user (student) interface</li>\n</ul>\n<h3 id=\"_74e57952f-version-2021-08-27\" tabindex=\"-1\"> 74e57952f Version(2021-08-27)</h3>\n<ul>\n<li>⛔️ Fix: <code>enable_damage</code> and <code>creative_mode</code> in the game world are invalid in headless server\n<ul>\n<li>Found that the code uses <code>g_settings</code> settings. It works in the client because it is saved to the configuration (<code>menu_worldmt_legacy</code>) every time you click the <code>enable_damage</code> setting.</li>\n<li>This is a dilemma. If you sometimes want to enable <code>enable_damage</code> and <code>creative_mode</code>, then the global will be invalid, and you can only rely on the world configuration.</li>\n<li>If there is a global configuration, follow the global configuration, otherwise see the world configuration</li>\n<li>The current idea (not yet implemented) is that if there are mandatory settings in the game configuration, then the settings in the game configuration shall prevail, followed by the mandatory settings in the game world, and finally the mandatory settings in the global configuration</li>\n<li>In principle, it is just a warning: if you enable mandatory settings upstream, problems may occur because the underlying game level does not support it, so it is best for ordinary users not to enable mandatory settings.</li>\n<li>The priority is system default configuration &lt; game configuration &lt; game world configuration &lt; global configuration (the same is true for the priority of mandatory settings)\n<ul>\n<li>Normal setting &lt; Mandatory setting</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>🆕️️ When creating a new game world in the <code>minetest-game</code> game, the default function mod is automatically enabled.</li>\n<li>Enhanced <code>quiz</code> function module:\n<ul>\n<li>⛔️ Fix settings: all configurations of <code>bool</code> type cannot be set</li>\n<li>⛔️ Fix settings: Chat command <code>/answer</code> doesn't work</li>\n<li>🆕️️ Added <code>forceAdminQuiz</code> setting: Whether to force the administrator to answer the challenge, the default is true.</li>\n<li>🆕️️ Added <code>immediateQuiz</code> setting: Whether to ask to answer the challenge immediately after entering the game. Defaults to true.</li>\n</ul>\n</li>\n<li>⛔️ Fix (Android): &quot;Allow remote game&quot;, &quot;Allow local game&quot;, teacher password, student password and other settings cannot be saved</li>\n<li>🆕️️ The game world can have its own static spawn-point.\n<ul>\n<li>Need to load world.mt somewhere and then merge into <code>g_settings</code>, that is to say, the configuration priority is world.mt &gt; minetest.conf</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"_8c8b82ec2-version-2021-08-20\" tabindex=\"-1\"> 8c8b82ec2 Version(2021-08-20)</h3>\n<ul>\n<li>⛔️ Fix: Forgot to save configuration</li>\n<li>⛔️ Fix (Critical): When the last game world item is not selected, the program crashes and cannot be run.</li>\n<li>⛔️ Fix (Critical): Does not work on old Android 5.1.1.</li>\n<li>🆕️️ Added (settings): readBinaryFile/updateBinaryFile can use compressed format</li>\n<li>🆕️️ New function module (minetest_game) unified inventory: unified_inventory\n<ul>\n<li><img src=\"@source/imgs/unified_inventory.jpg\" alt=\"unified_inventory\" /></li>\n<li>If you enable <code>minetest_game</code>, the original inventory will be replaced with the unified inventory (by default it will be enabled in the <code>default</code> world, and it must be manually enabled for the created <code>default</code> world)</li>\n</ul>\n</li>\n<li>🆕️️ New function mod (minetest_game) player skin: skinsdb\n<ul>\n<li><img src=\"@source/imgs/skinsdb.jpg\" alt=\"skinsdb\" /></li>\n</ul>\n</li>\n<li>🆕️️ Added new function module (minetest_game) player clothing and armor: 3d_armor\n<ul>\n<li><img src=\"@source/imgs/3d_armor.jpg\" alt=\"3D_ARMOR\" /></li>\n</ul>\n</li>\n<li>🆕️️ Added feature mod (minetest_game) &quot;basic&quot; materials and items: basic_materials\n<ul>\n<li>This mod provides a small set of &quot;basic&quot; materials and items that other mods should use where possible: such as steel bars and chains, wires, plastic strips and sheets, etc. The idea is to remove duplication from mod to mod and reduce recipe conflicts.</li>\n<li><img src=\"@source/imgs/basic_materials.jpg\" alt=\"basic_materials\" /></li>\n</ul>\n</li>\n<li>🆕️️ New function module (minetest_game) more ores: moreores\n<ul>\n<li>Added tin, silver and mithril ores<img src=\"@source/imgs/moreores.jpg\" alt=\"more ores\" /></li>\n</ul>\n</li>\n<li>🆕️️ New function module compass: ccompass Each compass can point to a specific coordinate. Such as home coordinates. <img src=\"@source/imgs/ccompass.gif\" alt=\"ccompass\" /></li>\n<li>🆕️️ Add interface background music and mute control (student interface)</li>\n</ul>\n<h3 id=\"_570d8a40d-version-2021-08-14\" tabindex=\"-1\"> 570d8a40d Version(2021-08-14)</h3>\n<ul>\n<li>By default, local games are still enabled, which is easier for ordinary users. Consider remote play for teachers and those wanting parent-child activities.</li>\n<li>⛔️️ Fix: should start sprite animation at the beginning #11510</li>\n<li>⛔️️ Fix: Can't start local game if no game world selected</li>\n<li>🆕️️Enhancement mods that are enabled by default can be turned off in the world configuration\n<ul>\n<li>If you have already installed the old version, you may need to manually enable the default functional modules in the world configuration after installing the new version.</li>\n<li>If you don't want to enable it manually, you can delete the existing <strong>default</strong> world, and then restart the software (it will automatically rebuild the <strong>default</strong> world).</li>\n</ul>\n</li>\n<li>The current default function modules are as follows:\n<ul>\n<li>quiz: player challenge mod\n<ul>\n<li>Required for yaml player challenge mods</li>\n<li>formspecs player challenge mod required</li>\n</ul>\n</li>\n<li>wielded_light: dynamic light source function module, fix the problem that the torch cannot be illuminated when held in the hand.</li>\n<li>handsholds_redo: Freehand rock climbing function module</li>\n<li>🆕️️ fireworkz: 🎆️ Fireworks function module</li>\n</ul>\n</li>\n<li>🆕️️ Add mod 🎆️ Fireworks (fireworkz), baby's birthday is approaching, add this firework function module to enliven the atmosphere</li>\n<li>🆕️️ Add game tutorial world: <strong>tutorial</strong></li>\n</ul>\n<h3 id=\"b42a46cde-version-2021-08-11\" tabindex=\"-1\"> b42a46cde Version(2021-08-11)</h3>\n<ul>\n<li>Fixed (Critical bug): Unable to enter remote game (report encoding error)</li>\n<li>Fixed (Critical bug): Unable to change student and teacher password errors (reports could not be written)</li>\n</ul>\n<h3 id=\"_94abd6a1c-version-2021-08-06\" tabindex=\"-1\"> 94abd6a1c Version(2021-08-06)</h3>\n<ul>\n<li>Fixed: should hide game bar when running game and switch back to student mode.</li>\n<li>Fixed: Unable to change teacher password</li>\n<li>🆕️️ Add cereal serialization library for serialization and deserialization.</li>\n</ul>\n<h3 id=\"_89f5dbc73-version-2021-07-31\" tabindex=\"-1\"> 89f5dbc73 Version(2021-07-31)</h3>\n<ul>\n<li>🆕️️ UI rework\n<ul>\n<li>🆕️️ Student UI and Teacher UI</li>\n<li>Simplify the main interface, the default is the student interface, when you click the teacher mode, enter the teacher password to restore the minetest interface.</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"_62686d9cc-version-2021-07-24\" tabindex=\"-1\"> 62686d9cc Version(2021-07-24)</h3>\n<ul>\n<li>Player challenge function module:\n<ul>\n<li>Fixed not being able to use the <code>/answer</code> command to manually call the answer dialog</li>\n<li>🆕️️ Support a small number of <code>MineClone2</code> items (no need to set mods to use these items)\n<ul>\n<li>coal block coalblock</li>\n<li>wood wood</li>\n<li>stone stone</li>\n<li>torch</li>\n<li>Iron Ingot steel_ingot</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><a href=\"https://github.com/minetest/minetest/pull/11466\" target=\"_blank\" rel=\"noopener noreferrer\">Use scoped app storage on Android</a>\n<ul>\n<li>Starting November 2021, the Play Store will no longer accept app updates that use the deprecated <code>getExternalStorageDirectory()</code> API.</li>\n<li>Therefore, this commit replaces the deprecated APIs with new <code>scoped APIs</code> (<code>getExternalFilesDir()</code> and <code>getExternalCacheDir()</code>). It also provides temporary migration, moving user data from a shared external directory to new storage.</li>\n</ul>\n</li>\n<li><a href=\"https://github.com/minetest/minetest/pull/11465\" target=\"_blank\" rel=\"noopener noreferrer\">Add new physics reload</a>\n<ul>\n<li>This PR adds the following new fields to <code>set_physics_override</code>:</li>\n<li><code>speed_climb</code>: Climbing speed multiplier (based on <code>movement_speed_climb</code> setting)</li>\n<li><code>Liquid_fluidity</code>: Liquid fluidity multiplier (based on <code>movement_liquid_fluidity</code> setting)</li>\n<li><code>Liquid_fluidity_smooth</code>: multiplier for liquid flow smoothing parameter settings</li>\n<li><code>Liquid_sink</code>: Liquid sink speed multiplier (based on <code>motion_liquid_sink</code>)</li>\n<li><code>acceleration_default</code>: the multiple of the default value of motion acceleration</li>\n<li><code>acceleration_air</code>: the multiplier of the motion acceleration in air</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"_6c83884b2-version-2021-07-18\" tabindex=\"-1\"> 6c83884b2 Version(2021-07-18)</h3>\n<ul>\n<li>🆕️️ The player challenge function mod adds settings:\n<ul>\n<li><code>totalPlayTime [&lt;minutes&gt;]</code>: display or modify the maximum game time</li>\n<li><code>restTime [&lt;min&gt;]</code>: display or modify the minimum rest time</li>\n<li><code>skipAnswered [true|false]</code>: Display or modify whether to skip answered questions</li>\n<li><code>idleInterval [&lt;minutes&gt;]</code>: Display or modify the interval between answering questions</li>\n<li><code>forceAdminRest [true|false]</code>: Display or modify whether to force the administrator to rest</li>\n<li><code>kickDelay [&lt;seconds&gt;]</code>: Display or modify the delay of kicking the game</li>\n<li><code>checkInterval [&lt;seconds&gt;]</code>: Display or modify the interval time for checking problems, generally do not need to modify</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"c583ca122-version-2021-07-17\" tabindex=\"-1\"> c583ca122 Version(2021-07-17)</h3>\n<ul>\n<li>🆕️️ Add Chinese for Android version</li>\n<li>🆕️️ Increase light and shadow effect</li>\n<li>🆕️️ Games MineClone2 and minetest_game freehand rock climbing function: Use the ⛏️ pickaxe (right button) to drill holes in the rock (note that holes cannot be drilled on soil or sand), and then you can climb: up and down keys.</li>\n<li>🆕️️ Added game time limit and player challenge to games MineClone2 and minetest_game:\n<ul>\n<li>The player challenge is to conduct a quiz in the game: a question will be asked every 5 minutes, and the correct answer can continue to play and get a prize. The quiz questions are to be added by yourself.</li>\n<li>Type <code>/quiz list</code> in the chat window to view the current list of quiz questions</li>\n<li>Type <code>/quiz del &lt;index|id&gt;</code> in the chat window to delete the specified question</li>\n<li><code>/quiz set &lt;Index|Id&gt; title=&quot;question&quot; answer=&quot;answer&quot; [desc=&quot;tip&quot;]</code> Add or modify the specified question</li>\n<li><code>/quiz reset [&lt;playerName&gt;]</code> reset player's game time</li>\n<li><code>/quizAward &lt;list&gt;</code> list all prizes</li>\n<li><code>/quizAward del &lt;index|id&gt;</code> delete the specified prize</li>\n<li><code>/quizAward set &lt;Id&gt; title=&quot;Title&quot; [mod=&quot;default&quot;] [count=&lt;Number&gt;]</code> Add or modify the specified prize\n<ul>\n<li>​Note: MineClone2 should use mod=&quot;mcl_core&quot; etc. (depending on the specific item, default is minetest_game item)</li>\n</ul>\n</li>\n<li><code>/saveQuiz</code> save player challenge config</li>\n</ul>\n</li>\n<li>Three games are packaged: (There may be adjustments in the future)\n<ul>\n<li>🆕️️tutorial is a game tutorial, teaching how to play</li>\n<li>🆕️️MineClone2 is a replica of Minecraft, the gameplay is basically the same as Minecraft (with game time limit and challenges)</li>\n<li>minetest_game is the base game (with game time limits and challenges)</li>\n</ul>\n</li>\n</ul>\n",
      "date_published": "2022-08-26T03:00:05.000Z",
      "date_modified": "2023-07-06T07:44:12.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "❓ Questions and Suggestions",
      "url": "https://edu.ihom.app/en/faq/",
      "id": "https://edu.ihom.app/en/faq/",
      "content_html": "<p>Common problems and corresponding solutions in the process of using the theme are included here.</p>\n<h2 id=\"faq\" tabindex=\"-1\"> FAQ</h2>\n<h3 id=\"unable-to-input-unicode-characters-under-windows\" tabindex=\"-1\"> Unable to input unicode characters under Windows</h3>\n<p>If you are still using the old version (v5.6.1-c35575a00(2022-09-25) and previous versions), please switch to the English input method or upgrade to the latest version (<a href=\"/en/download/\">minetest-5.6.1-edu-2d4c67fd6(2022- 10-15)</a> and later releases).</p>\n<div>\n<p>Note</p>\n<ul>\n<li><strong>Known Issues</strong>: Versions released before <a href=\"/en/download/\">minetest-5.6.1-edu-2d4c67fd6(2022-10-15)</a> input text on Windows systems, only Can use pure English input method, can not use any <strong>Unicode IME input method</strong> input, otherwise no text can be input. The latest version must be installed to use <strong>Unicode IME Input Method</strong>.</li>\n<li>If occasionally the IME input method cannot be called out, please click the window outside the input box (let the input box lose focus), and then switch back to the input box (click the input box again)</li>\n<li>BTW: It is normal to input unicode chars under <code>Android</code> and <code>Linux</code>(<code>Ubuntu</code>).</li>\n</ul>\n</div>\n<h3 id=\"android-phone-tablet-touch-screen-cannot-close-the-open-window-inventory-bar-in-the-game\" tabindex=\"-1\"> Android phone/tablet (touch screen) cannot close the open window (inventory bar) in the game</h3>\n<p>Clicking anywhere outside the window (inventory) should close the window, but it doesn't.</p>\n<p>Workaround: First click anywhere in the <strong>window (item bar)</strong> again, and then click outside the window to close the window.</p>\n<h3 id=\"forgot-the-admin-password\" tabindex=\"-1\"> Forgot the admin password</h3>\n<p>Delete the <code>teacher</code> file in the <code>client</code> directory. Or delete the entire directory directly, and unzip it again.</p>\n<p>This will restore the default admin password.</p>\n<h3 id=\"student-password-forgotten\" tabindex=\"-1\"> student password forgotten</h3>\n<p>If you don't need to keep the game world, just delete the entire directory and unzip it again.</p>\n<p>If you need to enter the previous game world, you need two steps:</p>\n<ol>\n<li>Delete the <code>teacher</code> file in the <code>client</code> directory, and reset the student password\n<ul>\n<li>Note: Teacher password will also be reset to default</li>\n</ul>\n</li>\n<li>Modify or delete the password in the game world\n<ol>\n<li>Method 1: Enter the game as a teacher (under the <code>Start Game</code> tab page in teacher mode)\n<ul>\n<li>After using <a href=\"./../guide/teacher/ingame-man\">chat command</a> to get all permissions (<code>/grantme all</code>)</li>\n<li>Use <code>/setpassword &lt;name&gt; &lt;new password&gt;</code> [change password chat command](../guide/teacher/ingame-man/#password operation) to change the student's password to the reset password</li>\n</ul>\n</li>\n<li>Method 2: Delete the <code>auth.sqlite</code> file in the <code>worlds/default</code> world directory, and clear all user passwords in this world\n<ul>\n<li>Note: This is to delete the user password of the <code>default</code> world, to delete the user password of other worlds, please do the same in other world directories under the <code>worlds</code> directory</li>\n</ul>\n</li>\n</ol>\n</li>\n</ol>\n<h2 id=\"contact-us\" tabindex=\"-1\"> Contact us</h2>\n<h3 id=\"report-a-problem-or-suggestion\" tabindex=\"-1\"> Report a problem or suggestion</h3>\n<p>If you have any questions or suggestions about &quot;Minetest: Education Edition&quot;, please click here and indicate the specific details.</p>\n<ul>\n<li><a href=\"https://github.com/edu-minetest/minetest/issues/new/choose\" target=\"_blank\" rel=\"noopener noreferrer\">New Issue</a></li>\n</ul>\n<p>If necessary, please provide a Minimal Reproduction Repo<sup></sup> link. And provide debug logs. If your problem is related to the display, please also provide relevant screenshots.</p>\n<h3 id=\"get-help\" tabindex=\"-1\"> Get help</h3>\n<div>\n<p>Only for \"Minetest: Education Edition\" itself</p>\n<ul>\n<li>If you have questions about learning and using Lua, CPP code, or you don't know how to write what you want, you may need to ask questions in related forums, Stack Overflow, etc.</li>\n<li>If you have questions about Minetest, please ask on the <a href=\"https://forum.minetest.net\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest Forum</a>.</li>\n</ul>\n<p>Please only initiate &quot;Minetest:Education Edition&quot; discussions in the repository and related discussions with the Quiz mod written by Riceball LEE.</p>\n</div>\n<ul>\n<li>\n<p>If you encounter usage problems but don't know how to solve them, we also welcome you to <a href=\"https://github.com/edu-minetest/minetest/discussions/new\" target=\"_blank\" rel=\"noopener noreferrer\">open a new discussion</a> on GitHub. Questions are always welcome, no matter if they are simple or not. You just need to make sure of three things:</p>\n<ol>\n<li>You have tried searching for relevant documentation.</li>\n<li>You provide a detailed description in your discussion.\nIf you don't know how to configure something, please describe what you want, what you search for, or what part of the guide you'd like to see (so we can improve our documentation).</li>\n<li>You are not asking a question unrelated to &quot;Minetest: Education Edition&quot;, nor are you seeking &quot;technical support&quot;.\nWe don't provide help on &quot;how to customize something&quot; (how to write your own code). Please don't ask for help for this part unless you donate to the project.\nThe author is currently very busy and doesn't want to &quot;become a documentation provider&quot;, and doesn't have much time to &quot;teach you how to write code&quot;.</li>\n</ol>\n</li>\n</ul>\n<hr />\n<section>\n<ol>\n<li id=\"footnote1\"><p>The basic idea of a minimal repro repo is to use the least amount of code and configuration to trigger missing or wrong behaviors. A minimal repo repo makes it easier for developers to see where bugs or missing functionality are, and to verify that new code meets requirements. </p>\n</li>\n</ol>\n</section>\n",
      "date_published": "2022-08-26T03:00:05.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": [
        "FAQ"
      ]
    },
    {
      "title": "📚 Guide",
      "url": "https://edu.ihom.app/en/guide/",
      "id": "https://edu.ihom.app/en/guide/",
      "content_html": "",
      "date_published": "2022-08-26T03:00:05.000Z",
      "date_modified": "2023-06-28T09:25:32.000Z",
      "authors": [],
      "tags": [
        "Guide"
      ]
    },
    {
      "title": "💡 Get Started",
      "url": "https://edu.ihom.app/en/guide/get-started/",
      "id": "https://edu.ihom.app/en/guide/get-started/",
      "content_html": "<div>\n<p>In the voxel world, everything is made up of blocks (or cubes).</p>\n<p>It is important to remember that all things in the voxel world are constructed from blocks (or cubes). All blocks (or cubes) can be &quot;freely&quot; mined (destroyed) or placed.</p>\n</div>\n",
      "date_published": "2022-08-26T03:00:05.000Z",
      "date_modified": "2023-06-29T14:40:54.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "Introduction",
      "url": "https://edu.ihom.app/en/guide/get-started/intro.html",
      "id": "https://edu.ihom.app/en/guide/get-started/intro.html",
      "content_html": "<h2 id=\"what-is-minetest-education-edition\" tabindex=\"-1\"> What is &quot;Minetest: Education Edition&quot;</h2>\n<p>&quot;<a href=\"/\">Minetest: Education Edition</a>&quot; is an interactive educational world application based on the open-source voxel game engine, <a href=\"https://minetest.net\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest</a>.</p>\n<h3 id=\"interactive-game-world-for-minetest\" tabindex=\"-1\"> Interactive game world for <a href=\"https://minetest.net\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest</a></h3>\n<p>The concept of &quot;<a href=\"https://zh.m.wikipedia.org/zh-hans/voxel\" target=\"_blank\" rel=\"noopener noreferrer\">voxel</a>&quot; in <a href=\"https://minetest.net\" target=\"_blank\" rel=\"noopener noreferrer\">Minetest</a> is similar to building blocks like Lego. In the interactive world, players can use these blocks to create houses, tools, and more. Unlike expensive Lego bricks, players can explore the virtual worlds they create and experience the new environments they design using these building blocks.</p>\n<div style=\"text-align:center\">\n<p><img src=\"/imgs/numerica.jpg\" alt=\"blocks\" title=\"Blocks\" width=\"360\" /> <img src=\"@source/en/guide/get-started/sunrise.jpg\" alt=\"sun rise\" title=\"Rising Sun\" width=\"360\" /></p>\n</div>\n<details><summary>Experience the \"new world\" you create</summary>\n<p>The interactive world of Minetest allows for the use of material blocks to build a wide variety of creative structures, from houses and farms to cities and tools. Players can mine and sculpt metal ore into ingots, then use those ingots to create different types of tools and structures. Unlike expensive Lego bricks, players can explore and experience their creations in a virtual world. For example, players can use ladders, make glass blocks from sand, and watch the square sun rise from their porch.</p>\n</details>\n<h3 id=\"the-interactive-educational-world-of-minetest-education-edition\" tabindex=\"-1\"> The interactive educational world of &quot;<a href=\"/\">Minetest: Education Edition</a>&quot;</h3>\n<details><summary>Letting children play in the interactive educational world does not serve any educational purpose.</summary>\n<p>Even in an interactive educational world, children may avoid completing tasks and instead engage in meaningless play if there is no adult supervision or guidance: jumping from a high place to commit suicide (the child calls it bungee jumping), after being resurrected, and running away again... It can be a joy to play.</p>\n</details>\n<p>Parents/teachers can manage game content, control playtime, and have educational exercises periodically appear during gameplay to enhance learning.</p>\n<ul>\n<li><input type=\"checkbox\" id=\"task-item-0\" checked=\"checked\" disabled=\"disabled\" /><label for=\"task-item-0\"> Separates game interface into gameplay and password-protected content management screens for parents/teachers.</label></li>\n<li><input type=\"checkbox\" id=\"task-item-1\" checked=\"checked\" disabled=\"disabled\" /><label for=\"task-item-1\"> Control of gameplay time to protect children's eyesight</label></li>\n<li><input type=\"checkbox\" id=\"task-item-2\" checked=\"checked\" disabled=\"disabled\" /><label for=\"task-item-2\"> Periodically presents educational exercises to improve knowledge while playing</label></li>\n<li><input type=\"checkbox\" id=\"task-item-3\" checked=\"checked\" disabled=\"disabled\" /><label for=\"task-item-3\"> Single-player game support different users to use a shared computer</label></li>\n<li><input type=\"checkbox\" id=\"task-item-4\" disabled=\"disabled\" /><label for=\"task-item-4\"> Write interactive educational world courses using approximate natural language text outside of the game(to be implemented)</label></li>\n</ul>\n<p>To enhance the learning experience, we developed the <a href=\"/en/guide/mods/quiz/\">Quiz player challenge mod</a> to implement periodic exercises during gameplay, ensuring that children are consistently practicing and learning.</p>\n<p>To make it easier for parents and teachers to manage game content, we directly modified the interface of Minetest by separating the student game interface (gameplay) from the teacher interface (manage game content). This makes it easier for teachers to manage the game and customize it for their students.</p>\n<p>In addition, Minetest: Education Edition comes with a variety of built-in educational mods, including mods for mathematics, automation, electronic circuits, programming, and more. These mods provide a wealth of educational content that can be used to enhance learning in various subjects.</p>\n<p>Looking to the future, we plan to develop a specification for a near-natural language text format, which will be used to write interactive course content. The course content written in this format can be converted into Minetest game worlds using a tool that we'll develop. This means that teachers will only need to maintain the course content text, rather than the game world itself.</p>\n<p>This approach will make it easier for teachers and parents to collaborate on course content, as they can review and revise the text-based course content without having to deal with the complexities of building and maintaining a game world.</p>\n<p>The game world is engaging and encourages children to keep practicing if they want to continue playing. With <a href=\"/en/guide/get-started/\">Minetest: Education Edition</a>, children can explore and learn in a fun and interactive way, with the freedom to customize their learning experience to fit their interests and needs.</p>\n<p>We hope that by releasing this open-source project, more people can benefit from the learning opportunities presented by <a href=\"/en/guide/get-started/\">Minetest: Education Edition</a>.</p>\n<h3 id=\"comparison-with-minecraft-education-edition-🎯\" tabindex=\"-1\"> Comparison with <a href=\"https://education.minecraft.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Minecraft: Education Edition</a> 🎯</h3>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\"></th>\n<th><a href=\"https://education.minecraft.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Minecraft: Educational Edition</a></th>\n<th>《<a href=\"/\">Minetest: Educational Edition</a>》</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\">Offline</td>\n<td>Can only be used online (you must log in before entering)</td>\n<td>Software that can run offline (no registration and login, and it can also be used without a network)</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Type</td>\n<td>Paid Commercial Software</td>\n<td>Free (Free) Open Source Software</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">target users</td>\n<td>Only for educational institutions, not for individuals</td>\n<td>Parents/teachers are free to use</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Courses</td>\n<td>About 700 online courses</td>\n<td>None</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Modules</td>\n<td>Not supported</td>\n<td>Local built-in education-related modules (mathematics, science, automation, electronic circuits, programming, etc.) and selected modules</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Stand-alone server</td>\n<td>Not supported</td>\n<td>Local network or Internet game service can be set up on a professional Linux server</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Game time control</td>\n<td>Not supported</td>\n<td>Support game time control</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Game content management</td>\n<td>Not supported</td>\n<td>Support game content management</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Interspersed exercises</td>\n<td>Not supported</td>\n<td>Support periodic exercises during gameplay</td>\n</tr>\n</tbody>\n</table>\n<hr />\n<ul>\n<li><a href=\"https://education.minecraft.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Minecraft: Education Edition</a>:\n<ul>\n<li>Essentially an online service (must log in before entering)</li>\n<li>Paid commercial software\n<ul>\n<li>No modifications or improvements can be made to the software itself</li>\n</ul>\n</li>\n<li>Only for educational institutions, not for individuals (individuals must rely on institutions)</li>\n<li>700 standard compliant lessons built into the in-game library (not natively built in, need to be downloaded in-app)</li>\n<li>Trouble writing courses: essentially building in the game</li>\n<li>Officially does not support custom mods</li>\n<li>Does not support independent self-supporting local network or Internet game services (only services can be provided in the game)</li>\n<li>Does not support controlling game time</li>\n<li>Does not support game content management</li>\n<li>Intersperse exercises that do not support play</li>\n</ul>\n</li>\n<li>&quot;<a href=\"/\">Minetest: Education Edition</a>&quot;:\n<ul>\n<li>The essence is a software that can run offline (no need to register and log in, and it is also available without the Internet)</li>\n<li>Free (free) open source software\n<ul>\n<li>The software itself can be modified or improved under the premise of following its open source copyright license (<a href=\"https://www.gnu.org/licenses/lgpl-3.0.zh-cn.html\" target=\"_blank\" rel=\"noopener noreferrer\">LGPL3</a>)</li>\n</ul>\n</li>\n<li>Parents/Teachers are free to use</li>\n<li>Freely combinable module architecture design</li>\n<li>Local built-in education-related modules (mathematics, automation, electronic circuits, programming, etc.) and selected modules.</li>\n<li>No courses for now, need to create by yourself</li>\n<li>Support self-hosted local network or Internet game service on Linux server for multiplayer games (minetestserver)</li>\n<li>Support control game time</li>\n<li>Support game content management</li>\n<li>Periodic exercises during gameplay</li>\n</ul>\n</li>\n</ul>\n",
      "image": "https://edu.ihom.app/imgs/numerica.jpg \"Blocks\" =360x",
      "date_published": "2022-08-26T03:00:05.000Z",
      "date_modified": "2023-07-06T07:39:04.000Z",
      "authors": [],
      "tags": [
        "Get Started"
      ]
    }
  ]
}